{
    "id": "are-dividends-taxable-in-canada",
    "slug": "are-dividends-taxable-in-canada",
    "title": "Are Dividends Taxable in Canada?",
    "excerpt": "‍Introduction...",
    "content": "<h2 id=\"-introduction\">‍Introduction</h2>\n<p>Dividends can be a common way to earn income as an investor or business owner in Canada. Understanding how dividends are taxed in Canada is crucial to optimizing your returns and minimizing your tax liability.</p>\n<p>This guide explains the Canadian dividend tax credit system, highlighting its benefits and impact on various dividends</p>\n<p>Not only will this article serve as a complete guide in answering the question \"how are dividends taxed in Canada?\", it will also provide you with the knowledge you need to make informed decisions about your investment or profit distribution strategy.</p>\n<h2 id=\"are-dividends-taxable-in-canada\">Are Dividends Taxable in Canada</h2>\n<p>In Canada, dividends are taxable, but there is a dividend tax credit system in place that provides tax advantages for Canadian residents who receive dividends from Canadian businesses. T</p>\n<p>he dividend tax rate in Canada depends on the type of dividends you receive, whether they are eligible or non-eligible dividends. Eligible dividends are taxed at a lower rate than non-eligible dividends.</p>\n<p>Additionally, if you receive dividends from foreign corporations, you may be subject to withholding taxes imposed by the country where the corporation is based. It's important to seek professional advice from a qualified tax advisor or financial planner to navigate the complexities of the dividend tax in Canada.</p>\n<h2 id=\"how-are-canadian-dividends-taxed-in-canada\">How Are Canadian Dividends Taxed in Canada</h2>\n<p>Canadian dividends income is generally taxable in the year it is received. Canadian residents benefit from tax advantages on dividends from Canadian businesses via the dividend tax credit system.</p>\n<p>This system aims to prevent double taxation by providing a credit for taxes paid at the corporate level. Foreign dividends received from foreign corporations are also subject to taxation at the investor's highest marginal rate. However, the overall taxes paid on that income may be reduced by a foreign tax credit.</p>\n<h2 id=\"types-of-dividends-eligible-vs-non-eligible\">Types of Dividends: Eligible vs. Non-Eligible</h2>\n<p>There are two main types of dividends that shareholders can receive: eligible dividends and non-eligible dividends.</p>\n<p>Canada eligible dividends are paid out by large Canadian businesses that pay higher corporate taxes. Meanwhile, non-eligible dividends are paid out by smaller Canadian private corporations that pay corporate tax at a lower rate.</p>\n<p>The tax treatment of these Canadian dividends differs, with eligible dividends being taxed more favorably due to an enhanced dividend tax credit.</p>\n<h3 id=\"eligible-dividends\">Eligible Dividends</h3>\n<p>Eligible dividends are taxed at a lower rate compared to non-eligible dividends. When eligible dividends are paid, they are \"grossed up\" by a certain percentage to reflect the corporate income that was earned.</p>\n<p>This grossed-up amount is then given an enhanced dividend tax credit to account for the higher corporate tax already paid. The federal tax rate on eligible dividends in Canada is 15.0198%.</p>\n<h3 id=\"non-eligible-dividends\">Non-Eligible Dividends</h3>\n<p>Non-eligible dividends, also known as regular dividends, are taxed at a higher rate than eligible dividends. These dividends are paid by Canadian private corporations that benefit from lower tax rates.</p>\n<p>Non-eligible dividends have a lower gross-up rate and reduced dividend tax credit compared to eligible dividends. The federal tax rate on non-eligible dividends is 9.0301%.</p>\n<h3 id=\"provincial-dividend-tax-credit\">Provincial Dividend Tax Credit</h3>\n<p>In addition to federal taxation, dividend taxation in Canada also involves provincial tax rates. Each province has its own dividend tax credit rates for eligible and non-eligible dividends.</p>\n<p>For example, in British Columbia, the dividend tax credit for eligible dividends is 12%, while for non-eligible dividends, it is 2.18%. The rates vary across provinces, so it's important to consult the specific rates for your province.</p>\n<h2 id=\"how-are-foreign-dividends-taxed-in-canada-\">How Are Foreign Dividends Taxed in Canada?</h2>\n<p>Dividends received from foreign companies are subject to different tax rules. No dividend tax credit is applied because the foreign company issuing the dividend did not pay taxes to Canada.</p>\n<p>The taxation of foreign dividends includes a withholding tax, which varies from country to country.</p>\n<p>However, tax treaties between countries may reduce or eliminate these withholding taxes, so it's important to consult with a tax professional to understand your specific obligations. It's important to note that the withholding tax is not available if you hold your foreign dividends in registered accounts.</p>\n<h2 id=\"how-are-us-dividends-taxed-in-canada-\">How Are US Dividends Taxed in Canada?</h2>\n<p>When a Canadian taxpayer receives dividend income from U.S. sources, this income is subject to taxation in Canada. However, thanks to the Canada-U.S. Tax Treaty, the tax rate on these dividends is typically reduced. For Canadian residents, the foreign dividends must be reported on their Canadian income tax return in Canadian dollars.</p>\n<p>The treaty reduces the U.S. withholding tax to 15% for most Canadian residents, which can be credited against the Canadian tax owing on that income to avoid double taxation. It's important to note that U.S. dividends do not qualify for the Canadian Dividend Tax Credit, which is available for dividends received from Canadian corporations.</p>\n<p>Therefore, the grossed-up amount and tax credit do not apply to U.S. dividends. For precise calculations and to understand how this impacts your individual tax situation, it's advisable to consult with a qualified tax professional.</p>\n<h2 id=\"tax-free-dividends-in-canada\">Tax-Free Dividends in Canada</h2>\n<h3 id=\"no-tax-on-dividend-income-if-income-below-a-certain-threshold\">No Tax on Dividend Income if Income Below a Certain Threshold</h3>\n<p>While dividends are generally taxable in Canada, there are certain scenarios where dividends can be tax-free. If dividends are your only form of income and you meet specific criteria, you may be eligible for tax-free dividends.</p>\n<p>For example, as a single person with no other income, you can earn up to a certain amount in eligible dividends before having to pay federal taxes. The exact threshold may vary, so it's essential to consult the current tax regulations.</p>\n<p>Additionally, dividends from certain tax-exempt securities, such as those from mutual funds or regulated investment companies, may also be tax-free.</p>\n<h3 id=\"capital-dividends\">Capital Dividends</h3>\n<p>A capital gain dividend is a type of dividend paid to shareholders from the non-taxable portion of capital gains generated by a corporation, rather than from the corporation's earnings. They are typically paid when a corporation disposes of certain assets, such as real estate or investments, resulting in a capital gain.</p>\n<p>Capital gains dividends can be paid tax-free because they are not considered taxable income to the recipient. This is because the capital gains tax has already been paid by the corporation when the assets were sold.</p>\n<p>The non-taxable portion of capital gains (50%) is added to a capital dividend account, or <a href=\"/blog/capital-dividend-account-example\">CDA account.</a> This can be then be used to distribute the dividends to the shareholders of a corporation on a tax-free basis.</p>\n<p>In order to pay capital dividends, an election to pay capital dividends has to be made in prescribed form by completing CRA form <a href=\"https://www.canada.ca/en/revenue-agency/services/forms-publications/forms/t2054.html\">T2054</a><a href=\"https://www.canada.ca/en/revenue-agency/services/forms-publications/forms/t2054.html\">.</a> Additional documents documents are also required under this election. More information can be obtained by reviewing <a href=\"https://www.canada.ca/en/revenue-agency/services/tax/technical-information/income-tax/income-tax-folios-index/series-3-property-investments-savings-plans/series-3-property-investments-savings-plan-folio-2-dividends/income-tax-folio-s3-f2-c1-capital-dividends.html\">Income Tax Folio S3-F2-C1, Capital Dividends</a> or by <a href=\"https://calendly.com/ledgerlogic/free-consultation-30-min?back=1&month=2023-09\">Booking a Free Consultation with LedgerLogic</a>.</p>\n<p>Capital dividends can be an effective way for corporations to distribute funds to shareholders without them incurring additional tax liabilities.</p>\n<h2 id=\"the-benefits-of-paying-yourself-dividends\">The Benefits of Paying Yourself Dividends</h2>\n<p>Many professionals choose to pay themselves in dividends from their corporations. There are several reasons why this strategy is popular:</p>\n<p>1. <strong></strong>Simplicity<strong></strong>: Paying yourself dividends is relatively straightforward and doesn't require setting up payroll or making CPP contributions.\n2. <strong></strong>Lower Personal Tax Rate<strong></strong>: Dividends are taxed at a lower rate compared to employment income. However, it is important to consider additional taxes paid at the corporate level when comparing whether <a href=\"/blog/is-it-better-to-pay-yourself-a-salary-or-dividends-in-canada\">salary or dividends</a> is more advantageous overall. Generally, Canadian tax integration should result in similar overall tax liability between salary and dividends.\n3. <strong></strong>Income Splitting<strong></strong>: If your spouse is a shareholder and works in the business, they can receive dividends, potentially reducing your overall household tax rate.</p>\n<p>While paying yourself dividends offers advantages, it's important to consider potential <a href=\"/blog/is-it-better-to-pay-yourself-a-salary-or-dividends-in-canada\">disadvantages and complexities</a>, such as limited RRSP contribution room, no ability to deduct child care expenses, lack of CPP benefits, and the inability to deduct dividends as a business expense.</p>\n<p>Consulting with a financial advisor can help you determine if this strategy is right for your specific circumstances.</p>\n<h2 id=\"understanding-the-dividend-tax-credit\">Understanding the Dividend Tax Credit</h2>\n<p>The dividend tax credit in Canada is a mechanism designed to provide tax relief to Canadian residents who receive eligible dividends. This federal dividend tax credit offsets the taxes already paid by the corporation at the corporate level.</p>\n<p>The amount of the dividend tax credit depends on the nature of the dividends (eligible vs. non-eligible) as well as your province of residence since it is affected by the amount of taxes paid at the corporate level.</p>\n<h2 id=\"tax-planning-considerations\">Tax Planning Considerations</h2>\n<p>When it comes to dividend taxation in Canada, there are several factors to consider for effective tax planning. Here are a few key considerations:</p>\n<h3 id=\"integration\">Integration</h3>\n<p>The Canadian tax system aims to achieve integration, meaning that regardless of how taxable income flows through corporations and businesses to individuals, the overall tax rate remains consistent.</p>\n<p>This is why eligible and non-eligible dividends, dividend gross-up, and dividend tax credits exist. Understanding the concept of integration can help you optimize your tax planning strategies.</p>\n<h3 id=\"capital-gains-tax\">Capital Gains Tax</h3>\n<p>It's important to differentiate between dividends and capital gains when it comes to investment income taxation. Capital gains are realized when you sell a security for more than its purchase price, and they are taxed at a different rate.</p>\n<p>While both dividends and capital gains have lower tax rates compared to other forms of income, dividends generally have the lowest tax rate. It's crucial to consider the tax implications of both types of investment income when planning your investments.</p>\n<h3 id=\"registered-accounts\">Registered Accounts</h3>\n<p>Registered accounts, such as RRSPs and TFSAs, offer tax advantages for dividend income. Dividends earned within these accounts are either tax-deferred until withdrawal (RRSPs) or entirely tax-free (TFSAs).</p>\n<p>By strategically utilizing registered accounts, you can optimize your tax position and maximize your investment returns.</p>\n<h3 id=\"income-splitting\">Income Splitting</h3>\n<p><a href=\"/blog/how-does-income-splitting-work-in-canada\">Income splitting</a> refers to the strategy of allocating income among family members to reduce the overall tax burden. You can split income with a spouse who's a shareholder and active in your business by paying them dividends</p>\n<p>However, it's important to ensure that you comply with tax regulations and consult with a tax professional for personalized advice.</p>\n<h2 id=\"maximizing-your-dividend-tax-credit\">Maximizing Your Dividend Tax Credit</h2>\n<p>Maximize your Canadian dividend tax credit by knowing the differences between eligible and non-eligible dividends and applying suitable tax strategies.</p>\n<h3 id=\"invest-in-eligible-dividend-paying-stocks\">Invest in Eligible Dividend-Paying Stocks</h3>\n<p>Eligible dividends are paid out of income taxed at the general corporate tax rate, and they qualify for an enhanced dividend tax credit. Investing in companies that pay eligible dividends can be more tax-efficient.\n<h3 id=\"understand-the-gross-up-mechanism\">Understand the Gross-Up Mechanism</h3></p>\n<p>Both eligible and non-eligible dividends are grossed-up to reflect pre-tax income. In 2023, the gross-up rate for eligible dividends is 38%, while for non-eligible dividends, it's 15%. This gross-up increases your taxable income, but also increases the dividend tax credit you can claim.\n<h3 id=\"utilize-the-dividend-tax-credit\">Utilize the Dividend Tax Credit</h3></p>\n<p>The dividend tax credit is a non-refundable tax credit that reduces the amount of tax you owe. The federal dividend tax credit rate for eligible dividends is 15.0198% of the grossed-up amount in 2023, and for non-eligible dividends, it's 9.0301%.\n<h3 id=\"consider-the-impact-on-personal-income\">Consider the Impact on Personal Income</h3></p>\n<p>Dividends affect your personal income level, which can impact other income-tested benefits and credits. It's important to consider this in your overall tax planning.\n<h3 id=\"explore-income-splitting-opportunities\">Explore Income Splitting Opportunities</h3></p>\n<p>If you have a spouse or partner with a lower income, consider income splitting strategies. This can involve paying dividends to a lower-income family member from a family business, reducing the overall tax burden.\n<h3 id=\"incorporate-tax-efficient-investment-vehicles\">Incorporate Tax-Efficient Investment Vehicles</h3></p>\n<p>Utilize tax-sheltered accounts like RRSPs (Registered Retirement Savings Plans) and TFSAs (Tax-Free Savings Accounts) to hold dividend-paying investments, which can provide tax benefits.\n<h3 id=\"stay-informed-about-tax-law-changes\">Stay Informed about Tax Law Changes</h3></p>\n<p>Tax laws and rates can change, affecting how dividends are taxed. Stay informed to ensure you are maximizing your dividend tax credit under the current laws.\nRemember, the effectiveness of these strategies can vary based on individual circumstances, and it's advisable to consult with a tax professional for personalized advice.</p>\n<p><a href=\"https://www.canada.ca/en/revenue-agency.html\">Canada Revenue Agency</a> is a reliable source for current tax rates and regulations. Always verify the latest tax laws and consider professional advice for your specific situation.</p>\n<h2 id=\"reporting-dividends-on-your-tax-return\">Reporting Dividends on Your Tax Return</h2>\n<p>When it's time to file your line 12000 tax return, accurately reporting dividend income and claiming the line 40425 tax credits is crucial. Here are some key steps to follow:</p>\n<p>1. <strong></strong>Gather Your T5 Slips<strong></strong>: <a href=\"/blog/what-is-the-difference-between-t3-t4-t4a-and-t5-slips\">T5 slips</a>, also known as Statement of Investment Income, are issued by financial institutions and provide details about the dividends you received during the tax year. Make sure to collect all your T5 slips before preparing your tax return.\n2. <strong></strong>Report Dividend Income<strong></strong>: Enter the amount of dividend income from eligible and non-eligible dividends separately on your tax return. Be sure to follow the instructions provided by the Canada Revenue Agency (CRA) to ensure accuracy.\n3. <strong></strong>Claim the Dividend Tax Credit<strong></strong>: Calculate and claim the dividend tax credit based on the grossed-up amount of eligible dividends received. The CRA provides tables and formulas to assist with this calculation.\n4. <strong></strong>Report Foreign Dividends:<strong></strong> If you received dividends from foreign companies, report them on Line 12100 of your tax return. Foreign dividends do not qualify for the Canadian dividend tax credit and are taxed as regular income. Remember to include any foreign taxes paid, as you may be eligible for a foreign tax credit to prevent double taxation.</p>\n<p>Remember, accurately reporting your dividend income to the CRA and claiming the appropriate tax credits is essential for complying with Canada Revenue Agency tax laws and minimizing your tax liability.</p>\n<h2 id=\"the-importance-of-professional-advice\">The Importance of Professional Advice</h2>\n<p>Navigating the complexities of the Canadian dividend tax credit system with the CRA can be challenging. It's important to seek professional advice from a qualified tax advisor or financial planner who can help you develop a tax-efficient investment and income strategy in compliance with Canada Revenue Agency regulations.</p>\n<p>A knowledgeable advisor can assess your unique circumstances, provide personalized recommendations, and ensure compliance with tax laws. They can also help you stay abreast of any changes in tax regulations that may impact your dividend income.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Understanding how dividends tax and the dividend tax rate in Canada are crucial for maximizing your investment returns and minimizing your tax liability. The federal dividend tax credit system provides tax advantages for Canadian residents who receive dividends from Canadian businesses.</p>\n<p>By paying attention to the type of dividends you receive, utilizing available deductions and credits, and seeking professional advice, you can optimize your dividend income and achieve your financial goals.</p>\n<p>Remember, CRA tax laws and regulations are subject to change, so it's important to stay informed and consult with a Canada Revenue Agency qualified professional to ensure you are making the most tax-efficient decisions.</p>",
    "toc": [
        {
            "id": "-introduction",
            "title": "‍Introduction"
        },
        {
            "id": "are-dividends-taxable-in-canada",
            "title": "Are Dividends Taxable in Canada"
        },
        {
            "id": "how-are-canadian-dividends-taxed-in-canada",
            "title": "How Are Canadian Dividends Taxed in Canada"
        },
        {
            "id": "types-of-dividends-eligible-vs-non-eligible",
            "title": "Types of Dividends: Eligible vs. Non-Eligible"
        },
        {
            "id": "how-are-foreign-dividends-taxed-in-canada-",
            "title": "How Are Foreign Dividends Taxed in Canada?"
        },
        {
            "id": "how-are-us-dividends-taxed-in-canada-",
            "title": "How Are US Dividends Taxed in Canada?"
        },
        {
            "id": "tax-free-dividends-in-canada",
            "title": "Tax-Free Dividends in Canada"
        },
        {
            "id": "the-benefits-of-paying-yourself-dividends",
            "title": "The Benefits of Paying Yourself Dividends"
        },
        {
            "id": "understanding-the-dividend-tax-credit",
            "title": "Understanding the Dividend Tax Credit"
        },
        {
            "id": "tax-planning-considerations",
            "title": "Tax Planning Considerations"
        },
        {
            "id": "maximizing-your-dividend-tax-credit",
            "title": "Maximizing Your Dividend Tax Credit"
        },
        {
            "id": "reporting-dividends-on-your-tax-return",
            "title": "Reporting Dividends on Your Tax Return"
        },
        {
            "id": "the-importance-of-professional-advice",
            "title": "The Importance of Professional Advice"
        },
        {
            "id": "conclusion",
            "title": "Conclusion"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "November 21, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_tax_canada.png"
}