{
    "id": "can-you-get-ei-if-you-are-self-employed",
    "slug": "can-you-get-ei-if-you-are-self-employed",
    "title": "Can You Get EI If You Are Self-Employed? Understanding Your Eligibility",
    "excerpt": "Self-employed individuals in Canada have the option to enroll in the Employment Insurance (EI) program to gain access to EI benefits. Unlike salaried ...",
    "content": "<p>Self-employed individuals in Canada have the option to enroll in the Employment Insurance (EI) program to gain access to EI benefits. Unlike salaried employees, whose employers typically handle EI premium deductions automatically, self-employed people must actively opt into the program to be covered. This process involves registering with the EI program and paying premiums based on earned income.</p>\n<p>The EI system for self-employed workers functions as a safety net, offering special benefits such as sickness, maternity, paternity, adoption, and caregiving benefits. Premium rates are determined annually and as of 2023, self-employed individuals will pay $1.63 for every $100 earned up to a maximum of $1,002.45. For residents of Quebec, the rate is adjusted to $1.27 per $100 of earnings. It's important to note that these contributions are based on net income from self-employment and are reported through the individual's income tax return.</p>\n<p>Once enrolled and contributing to the EI program, self-employed individuals become eligible to receive benefits, if they meet the specific criteria set out by the program. This may include, for instance, the number of hours worked or the income earned during a certain period. For those who qualify and receive EI benefits, it is possible to earn money while on EI. The system allows claimants to retain 50 cents of their benefits for every dollar they earn, up to 90% of their previous weekly earnings. This feature is designed to encourage work and ease the transition back to full-time employment.\n<h2 id=\"eligibility-for-employment-insurance-as-a-self-employed-individual\">Eligibility for Employment Insurance as a Self-Employed Individual</h2></p>\n<p>Self-employed individuals in Canada can access Employment Insurance (EI) benefits provided they meet specific registration and income criteria, and register to pay into the program.\n<h3 id=\"registering-for-the-ei-program\">Registering for the EI Program</h3></p>\n<p>Self-employed individuals must register for the EI program online and opt to start paying EI premiums. Their participation in the program is not automatic and necessitates an active enrollment step.\n<h3 id=\"qualifying-conditions\">Qualifying Conditions</h3></p>\n<p>To qualify for EI benefits, individuals must have engaged in insurable employment. This means self-employed persons must have had a contractual working arrangement where EI premiums were duly contributed.\n<h3 id=\"special-benefits-access\">Special Benefits Access</h3></p>\n<p>Once registered, self-employed Canadians can access special benefits under the EI program. These benefits are designed to support during specific life circumstances, such as sickness or parental leave, provided they have paid premiums into the program.\n<h3 id=\"income-requirements\">Income Requirements</h3></p>\n<p>For the benefit period between January 1, 2023, and December 31, 2023, self-employed individuals are required to have a minimum of <strong>$8,255</strong> in net self-employed earnings from the previous year. This threshold ensures that the EI benefits are extended to those who have contributed a baseline amount into the system.\n<h2 id=\"are-shareholders-exempt-from-ei-\">Are shareholders exempt from EI?</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-28-14.11.45-A-small-business-owner-a-middle-aged-Caucasian-woman-stands-proudly-in-front-of-her-quaint-independently-owned-bookshop.-The-shop-has-a-cozy-invit.png\" alt=\"\" class=\"img-fluid\" />\n<p>Shareholders of a corporation do not automatically receive an exemption from Employment Insurance (EI) premiums. The eligibility for EI benefits for shareholders hinges on their involvement with the business and whether their income is classified as self-employment income.</p>\n<p><strong>Involvement in Business Operations:</strong>\n<li>A shareholder actively involved in the day-to-day running of a corporation is considered self-employed.</li>\n<li>Self-employment income for active shareholders affects EI benefits eligibility.</li></p>\n<p><strong>Premiums Payment:</strong>\n<li>Both self-employed individuals and employees pay the same rate for EI premiums.</li>\n<li>For 2023, the rate is $1.63 per $100 earned, with a maximum of $1,002.45.</li></p>\n<p><strong>Income Consideration:</strong>\n<li>Income from active participation in the business qualifies as self-employment income.</li>\n<li>Passive income, such as from investments, is typically not considered self-employment income for EI purposes.</li></p>\n<p><strong>Special Considerations for Relatives:</strong>\n<li>Employees related to their employer may have different insurability conditions under the Employment Insurance Act.</li></p>\n<p>It is crucial for shareholders to assess their role within their corporation and consult with EI guidelines or financial professionals to understand their specific EI obligations and entitlements. Self-employed individuals seeking EI benefits must have opted into the program.\n<h2 id=\"application-process-for-ei-benefits\">Application Process for EI Benefits</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-28-14.12.30-A-person-sitting-at-a-kitchen-table-working-on-a-laptop.-The-kitchen-is-modern-and-well-lit-with-a-large-window-letting-in-natural-light.-The-person.png\" alt=\"\" class=\"img-fluid\" />\n<p>Navigating the application process for Employment Insurance (EI) benefits as a self-employed individual requires careful submission of essential documentation, an understanding of the online application system, and cognizance of deadlines.\n<h3 id=\"required-documentation\">Required Documentation</h3></p>\n<p>Self-employed applicants need to provide concrete records to meet the EI program's requirements. The core documents required include:\n<li>Proof of self-employment income and activities.</li>\n<li>Records of Employment (ROE) from any employers within the last 52 weeks, if applicable.</li>\n<li>Documentation confirming registration for the EI program if not previously registered.</li></p>\n<h3 id=\"applying-online\">Applying Online</h3>\n<p>Applicants should proceed to the official Canada.ca website to access the EI application form. Specific steps to be followed are:\n1. <strong>Fill in personal details:</strong> Legal name, address, direct deposit information.\n2. <strong>Employment history:</strong> Dates and reasons for leaving, if applicable.\n3. <strong>Submit online:</strong> After ensuring all information is complete and accurate.</p>\n<p><strong>Reminder:</strong> Applicants can submit additional required documents after the initial application.\n<h3 id=\"deadline-for-application\">Deadline for Application</h3></p>\n<p>Submitting the EI application promptly is vital:\n<li><strong>Apply as soon as possible</strong> after experiencing an interruption in earnings.</li>\n<li>Failure to apply within four weeks of the last day worked may result in decreased benefits.</li></p>\n<h2 id=\"calculation-of-ei-benefits\">Calculation of EI Benefits</h2>\n<p>When self-employed individuals register for Employment Insurance (EI) benefits, the amount they receive is calculated based on their earnings, with a fixed rate applied to the insurable amount.\n<h3 id=\"benefit-rate-determination\">Benefit Rate Determination</h3></p>\n<p>The EI benefits are typically calculated at a <strong>rate of 55%</strong> of the average insurable weekly earnings. For 2023, the ceiling for insurable earnings is <strong>$61,500</strong>, which caps the maximum weekly benefit rate at <strong>$650 per week</strong>. Self-employed individuals must pay EI premiums, which in 2023 is <strong>$1.63 for every $100</strong> earned, up to a maximum of <strong>$1,002.45</strong> for the year.\n<h3 id=\"duration-of-benefits\">Duration of Benefits</h3></p>\n<p>The duration of EI benefits for self-employed individuals depends on the type of benefits claimed and the specific economic region's unemployment rate. Regular benefits may range from a minimum of <strong>14 weeks</strong> to a maximum of <strong>45 weeks</strong>, varying according to the accumulated insurable hours and regional rates of unemployment.\n<h2 id=\"responsibilities-while-receiving-ei\">Responsibilities While Receiving EI</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-28-14.14.46-A-job-interview-scene-with-two-people-at-a-modern-office.-The-first-person-a-South-Asian-woman-is-the-interviewer-dressed-in-professional-business-.png\" alt=\"\" class=\"img-fluid\" />\n<p>When self-employed individuals receive Employment Insurance (EI), they must adhere to specific responsibilities to maintain their benefits.\n<h3 id=\"reporting-income\">Reporting Income</h3></p>\n<p>Recipients are required to <strong>report any income</strong> they earn while collecting EI. This income must be declared during the bi-weekly reports, and failure to do so can lead to repercussions such as repayment obligations or loss of benefits. For example:\n<li>If a recipient earns money from a contract, this amount must be reported in the period it was earned.</li>\n<li>If they receive payment for services rendered, they must declare this even if the work was done before the EI claim.</li></p>\n<h3 id=\"job-search-obligations\">Job Search Obligations</h3>\n<p>Individuals on EI must be actively seeking employment and be ready and willing to work. They need to maintain:\n<li>A <strong>log of job search activities,</strong> including dates, company names, and types of jobs applied for.</li>\n<li><strong>Evidence of job search efforts</strong> should be sufficient in case they are requested by Service Canada for review.</li></p>\n<p>Self-employed individuals must also ensure that their self-employment activities do not restrict their availability to search for, and accept, potential employment.\n<h2 id=\"implications-of-being-self-employed-on-ei-benefits\">Implications of Being Self-Employed on EI Benefits</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-28-14.13.20-A-young-Black-woman-engaged-in-a-phone-conversation-standing-in-a-bustling-city-environment.-She-is-stylishly-dressed-in-business-casual-attire-with.png\" alt=\"\" class=\"img-fluid\" />\n<p>When self-employed individuals access Employment Insurance (EI) benefits, it shapes both future claims and current business operations. Those opting into the EI program must be aware of the specific implications this decision carries for their professional and financial landscape.\n<h3 id=\"impact-on-future-ei-claims\">Impact on Future EI Claims</h3></p>\n<p>For self-employed individuals registered for the EI program, <strong>financial support</strong> is linked to their earnings, offering up to <strong>55% of their income</strong>, with a cap in 2023 at <strong>$650 per week</strong>. This rate influences not only their current benefits but also sets a precedent for future claims. Should their business income increase or decrease, this will <strong>directly affect</strong> the compensation received from EI in subsequent claims.\n<h3 id=\"effect-on-business-operations\">Effect on Business Operations</h3></p>\n<p>Engagement in limited business activities while receiving EI is permissible, provided that the work does not generate a sustainable income. This stipulation ensures that the primary focus remains on eligibility for benefits, which can include <strong>maternity</strong>, <strong>paternal</strong>, and <strong>sickness</strong> allowances, among others. However, this may necessitate adjustments to one's business model, as substantial work efforts could compromise EI eligibility and future claims.\n<h2 id=\"appealing-ei-decisions\">Appealing EI Decisions</h2></p>\n<p>When a self-employed individual disagrees with an Employment Insurance (EI) decision made by Service Canada, they have the right to appeal. This section outlines the grounds one can base their appeal on and details the step-by-step process to follow.\n<h3 id=\"grounds-for-appeal\">Grounds for Appeal</h3></p>\n<p>Individuals can appeal an EI decision if they believe there has been a misinterpretation of the facts or a misapplication of the law. For instance, if they feel that their earnings or hours worked were incorrectly calculated or if they believe a decision was made based on incomplete information.\n<h3 id=\"the-appeals-process\">The Appeals Process</h3></p>\n<p>The first step is to request a reconsideration of the original EI decision. This request must be submitted to Service Canada <strong>within 30 days</strong> after the decision is communicated. If the request is late, the individual must provide a reason for the delay. If unsatisfied with the reconsideration outcome, the individual can take their appeal to the Social Security Tribunal (SST). They will receive a letter confirming the receipt of their appeal. The proceedings involve document exchanges and an assignment to a decision-maker, who will review the case.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<p>The following frequently asked questions cover essential information for self-employed individuals in Canada considering applying for Employment Insurance.\n<h3 id=\"how-do-you-qualify-for-ei-when-you-are-self-employed-in-canada-\">How do you qualify for EI when you are self-employed in Canada?</h3></p>\n<p>A self-employed individual in Canada must be registered with the EI program for at least 12 months to qualify for benefits. They need to demonstrate that their business or self-employment activities meet the necessary criteria, including controlling more than 40% of the corporation’s voting shares if applicable.\n<h3 id=\"what-are-the-steps-to-register-for-ei-as-a-self-employed-individual-\">What are the steps to register for EI as a self-employed individual?</h3></p>\n<p>To register for EI, self-employed workers must sign up through the EI program, opt into the scheme, and pay premiums for at least one year before they can claim benefits. The registration process can be completed online via Service Canada.\n<h3 id=\"are-there-health-benefits-available-to-self-employed-workers-through-ei-\">Are there health benefits available to self-employed workers through EI?</h3></p>\n<p>Self-employed individuals in Canada can access special EI benefits that include sickness benefits, which offer financial assistance when they are unable to work due to health conditions or injuries.\n<h3 id=\"what-options-are-available-for-self-employed-individuals-seeking-maternity-or-parental-leave-benefits-in-canada-\">What options are available for self-employed individuals seeking maternity or parental leave benefits in Canada?</h3></p>\n<p>EI provides maternity and parental benefits for self-employed individuals who opt into the EI program. These benefits are designed to offer financial support to those taking time off for the birth or adoption of a child.\n<h3 id=\"how-can-self-employed-workers-in-ontario-access-ei-benefits-\">How can self-employed workers in Ontario access EI benefits?</h3></p>\n<p>Self-employed workers in Ontario can access EI benefits by registering with the EI program for self-employed people via the Service Canada website. They must meet the same criteria as self-employed individuals in other provinces to be eligible.\n<h3 id=\"what-are-the-common-reasons-for-ineligibility-for-ei-among-self-employed-workers-\">What are the common reasons for ineligibility for EI among self-employed workers?</h3></p>\n<p>Self-employed workers may be ineligible for EI if they have not paid into the program for the requisite 12 months, fail to meet income thresholds, or if they do not meet the work hours criteria for regular benefits. Additionally, if self-employed individuals have not experienced a significant stoppage of work, they may not qualify.</p>",
    "toc": [
        {
            "id": "eligibility-for-employment-insurance-as-a-self-employed-individual",
            "title": "Eligibility for Employment Insurance as a Self-Employed Individual"
        },
        {
            "id": "are-shareholders-exempt-from-ei-",
            "title": "Are shareholders exempt from EI?"
        },
        {
            "id": "application-process-for-ei-benefits",
            "title": "Application Process for EI Benefits"
        },
        {
            "id": "calculation-of-ei-benefits",
            "title": "Calculation of EI Benefits"
        },
        {
            "id": "responsibilities-while-receiving-ei",
            "title": "Responsibilities While Receiving EI"
        },
        {
            "id": "implications-of-being-self-employed-on-ei-benefits",
            "title": "Implications of Being Self-Employed on EI Benefits"
        },
        {
            "id": "appealing-ei-decisions",
            "title": "Appealing EI Decisions"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "September 21, 2023",
    "readTime": "5 min read",
    "tags": [
        "Cra",
        "Payroll",
        "Personal Tax"
    ],
    "category": "Cra",
    "image": "/images/blog-heroes/hero_ledgerlogic_ei_self_employed.png"
}