{
    "id": "canadian-client-withheld-15-percent-invoice-refund",
    "slug": "canadian-client-withheld-15-percent-invoice-refund",
    "title": "Canadian Client Withheld 15% From My Invoice: How to Get It Back",
    "excerpt": "Did a Canadian client withhold 15% from your invoice? Learn how to claim your Regulation 105 refund, what forms to file, and when to expect your money.",
    "content": "<p>If you are a US or international contractor who recently did work for a Canadian client, you might have been shocked to receive a payment that was 15% light. Your client likely cited \"Regulation 105\" and told you they were legally required to send that money to the Canada Revenue Agency (CRA) instead of you.</p>\n<p>They were right—but that doesn't mean the money is gone forever. In fact, for most non-resident businesses that don't have a permanent office in Canada, <strong>that 15% is partially or fully refundable.</strong></p>\n<p>This guide explains exactly why this happened and, more importantly, how to get your money back.</p>\n<h2 id=\"why-did-my-client-keep-15-percent\">Why did my client keep 15% of my money?</h2>\n<p>Under Regulation 105 of Canada's Income Tax Act, any Canadian business paying a non-resident for services physically performed in Canada must withhold 15% of the gross fee. This is not a final tax; it's a prepayment or \"withholding\" to ensure you file a Canadian tax return.</p>\n<p>Think of it like a security deposit. The CRA holds the funds to make sure you determine your final tax liability. If you don't owe any tax (which is common for US companies protected by the tax treaty), the CRA refunds the deposit—but only if you ask for it correctly.</p>\n<h2 id=\"am-i-eligible-for-a-full-refund\">Am I eligible for a full refund?</h2>\n<p>Most likely, yes. If your business is based in a country with a tax treaty with Canada (like the US, UK, or Australia), you are generally exempt from paying Canadian income tax on your business profits, provided you do not have a \"Permanent Establishment\" (PE) in Canada.</p>\n<p>However, the exemption isn't automatic. The 15% is taken first, and you must prove your treaty exemption later by filing a tax return.</p>\n<h2 id=\"the-permanent-establishment-test\">The \"Permanent Establishment\" Test</h2>\n<p>To get your refund, you must demonstrate you didn't have a Permanent Establishment in Canada. Generally, you do <strong>NOT</strong> have a PE if:</p>\n<ul>\n<li>You do not have a fixed place of business in Canada (office, factory, workshop).</li>\n<li>Your employees were in Canada for short durations (typically less than 183 days).</li>\n<li>You didn't use a dedicated agent in Canada who habitually concludes contracts on your behalf.</li>\n</ul>\n[[CTA_CONSULT]]\n<h2 id=\"the-refund-process-step-by-step\">The Refund Process: Step-by-Step</h2>\n<p>You cannot simply call the CRA and ask for a check. You must follow a strict corporate tax filing process.</p>\n<ol>\n<li><strong>Wait for the Slip:</strong> Your client must send you an <strong>NR4 Slip</strong> (Statement of Amounts Paid or Credited to Non-Residents) showing the gross income and the tax withheld.</li>\n<li><strong>Get a Business Number:</strong> You need a Canadian Non-Resident Business Number (BN) to file.</li>\n<li><strong>File a T2-Return:</strong> You must file a <em>T2 Corporation Income Tax Return</em> for the tax year the work was done.</li>\n<li><strong>Attach Schedules:</strong> You must include <strong>Schedule 91</strong> (Treaty Exemption) and <strong>Schedule 97</strong> (Non-Resident Information).</li>\n</ol>\n<h2 id=\"documents-you-need\">Documents You Need (The Checklist)</h2>\n<p>Before you file, gather these documents to ensure your claim is processed smoothly:</p>\n<ul>\n<li><strong>NR4 Slip:</strong> The official proof of tax withheld.</li>\n<li><strong>Invoices and Contracts:</strong> Proof of the services rendered.</li>\n<li><strong>Travel Logs:</strong> Dates of entry and exit from Canada for all employees.</li>\n<li><strong>US Tax Returns (Form 1120):</strong> Sometimes requested to prove residency.</li>\n<li><strong>Certificate of Residency:</strong> IRS Form 6166 (for US companies) proves you are a resident of the US for tax purposes.</li>\n</ul>\n<h2 id=\"common-pitfalls-to-avoid\">Common Pitfalls to Avoid</h2>\n<p><strong>Missing the deadline:</strong> You must file your return within 6 months of your fiscal year-end (though you have up to 3 years to claim a refund, filing late risks penalties).</p>\n<p>Getting your 15% back is a standard process, but it requires precise paperwork. Don't let the CRA keep your hard-earned revenue.</p>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p><strong>How long does it take to get the refund?</strong><br>Typically 4 to 7 months after filing the T2 return, depending on CRA processing times.</p>\n<p><strong>Can I just deduct this from my US taxes?</strong><br>You can claim a Foreign Tax Credit, but only if the tax was <em>legally owed</em>. Since Regulation 105 is often refundable, the IRS may deny the credit if you didn't try to get the refund from Canada first.</p>\n<p><strong>What if I don't have an NR4 slip?</strong><br>Contact your client immediately. If they can't provide it, you may be able to use a confirmation letter and proof of payment, but an NR4 is best.</p>\n<p><strong>Do I need a Canadian bank account?</strong><br>No, the CRA can issue a cheque in CAD or USD, but setting up direct deposit is faster.</p>\n<p><strong>Is this appropriate for sole proprietors?</strong><br>Sole proprietors file a T1-General instead of a T2, but the concept of Regulation 105 recovery is the same.</p>"
}