{
    "id": "cra-voluntary-disclosure",
    "slug": "cra-voluntary-disclosure",
    "title": "CRA Voluntary Disclosure: Navigating the Program to Correct Past Tax Errors",
    "excerpt": "The Canada Revenue Agency (CRA) Voluntary Disclosures Program (VDP) is a legal avenue that allows Canadian taxpayers to rectify previous errors or omi...",
    "content": "<p>The Canada Revenue Agency (CRA) Voluntary Disclosures Program (VDP) is a legal avenue that allows Canadian taxpayers to rectify previous errors or omissions in their tax filings. It presents an opportunity for individuals and businesses to come forward and voluntarily correct their tax affairs before the CRA initiates any action or <a href=\"/blog/how-do-you-deal-with-a-cra-audit\">audit</a> regarding the misinformation or incomplete information. This proactive approach to compliance may result in relief from penalties or prosecution that would typically accompany later detection by the tax authority.</p>\n<p>Participation in the VDP involves a detailed application process where applicants must provide complete and accurate disclosure by furnishing all necessary information and documentation to support their case. It is crucial that the disclosure is made before the CRA has any knowledge of the compliance issues, ensuring the taxpayer is truly acting voluntarily. There are certain eligibility criteria to meet and procedural steps to follow, which typically begin with the submission of Form RC199 or a comparable letter outlining the same details requested in the form.</p>\n<p>The program is designed to favor honesty and integrity within the Canadian tax system, potentially offering different levels of relief depending on the nature of the disclosure and the taxpayer’s history. The CRA assesses several factors to determine the extent of relief, which may include waiving penalties and interest, on a case-by-case basis. Engaging in the VDP reflects taxpayers' willingness to adhere to tax laws and can result in a clearer financial standing with the CRA moving forward.\n<h2 id=\"overview-of-the-cra-voluntary-disclosure-program\">Overview of the CRA Voluntary Disclosure Program</h2></p>\n<p>The Canada Revenue Agency (CRA) Voluntary Disclosure Program (VDP) provides taxpayers with an opportunity to voluntarily correct inaccuracies or omissions in their previous tax filings. The primary aim of the VDP is to promote compliance with Canada's tax laws by offering a chance for taxpayers to come forward before the CRA initiates any compliance action against them.</p>\n<p><strong>Eligibility for the VDP</strong> includes individuals, corporations, trusts, and any other entities required to comply with tax obligations. The key requirements for a disclosure to be considered valid under the program are:\n<li><strong>Voluntary</strong>: Applications must be submitted before the CRA begins any enforcement action.</li>\n<li><strong>Complete</strong>: All relevant information and documentation must be included, covering all taxation years with discrepancies.</li>\n<li><strong>Penalty Exposure</strong>: The disclosure must involve a potential penalty.</li>\n<li><strong>Information is At Least One Year Past Due</strong>: The information should be for a tax year that is at least one year overdue.</li></p>\n<p>Taxpayers who meet these criteria might be eligible for relief from prosecution and certain penalties, and in some cases, partial interest relief.</p>\n<p>The steps to apply for the VDP involve:\n1. Completing Form RC199, the Voluntary Disclosures Program application, or a letter providing the same information.\n2. Providing all necessary documents to support the disclosure, including details of all omissions or errors and the taxation years affected.</p>\n<p><strong>Program Types</strong>: The VDP has two tracks:\n<li><strong>General Program</strong>: Offers relief from penalties and potential prosecution for tax errors with no intentional conduct.</li>\n<li><strong>Limited Program</strong>: Provides lesser relief and is designed for cases where there is an element of intentional conduct on the taxpayer's part.</li></p>\n<p>Understanding these aspects of the VDP is critical for anyone considering a voluntary disclosure to the CRA.\n<h2 id=\"eligibility-criteria\">Eligibility Criteria</h2></p>\n<p>Eligibility for the Voluntary Disclosures Program (VDP) hinges on strict criteria aimed at ensuring the Canadian Revenue Agency (CRA) offers relief fairly to those who proactively correct their tax affairs.\n<h3 id=\"taxpayer-eligibility\">Taxpayer Eligibility</h3></p>\n<p><strong>Individuals and entities</strong> may apply to the VDP if they:\n<li>Have not yet been contacted by the CRA for potential errors or omissions.</li>\n<li>Volunteer information that is <strong>at least one year past due</strong>.</li></p>\n<p>Entities include corporations, partnerships, trusts, and GST/HST registrants. Represented taxpayers must also authorize their representative through appropriate CRA processes.\n<h3 id=\"types-of-disclosures\">Types of Disclosures</h3></p>\n<p>Types of tax issues eligible for disclosure include:\n<li><strong>Income tax violations</strong>, such as unreported income or ineligible claimed expenses.</li>\n<li><strong>GST/HST infractions</strong>, including incorrect reporting or unclaimed input tax credits.</li>\n<li><strong>Errors in payroll deductions</strong> or not filing the necessary information returns like Form T1135 for foreign income.</li></p>\n<p>Eligible disclosures must fulfill the following requirements:\n<li>Be voluntary and complete.</li>\n<li>Involve a penalty risk.</li>\n<li>Include information at least one year overdue.</li>\n<li>Include payment arrangements for the owed tax (or the actual amount if possible).</li></p>\n<h3 id=\"limits-and-exclusions\">Limits and Exclusions</h3>\n<p>Certain exclusions apply, which means not all disclosures will be accepted:\n<li>Disclosures will not be considered if they relate to <strong>bankruptcy returns</strong> or <strong>returns with no tax owing</strong> or an expected refund.</li>\n<li>Applications based on decisions that have already been made by the CRA or the courts.</li>\n<li>Requests that relate only to the determination of a <strong>fair market value</strong>.</li>\n<li>Situations that involve advance pricing arrangements or roll-over provisions.</li></p>\n<h2 id=\"benefits-of-voluntary-disclosure\">Benefits of Voluntary Disclosure</h2>\n<p>The Voluntary Disclosures Program (VDP) administered by the Canada Revenue Agency offers taxpayers the opportunity to come forward and correct inaccuracies in their tax affairs.\n<h3 id=\"penalty-relief\">Penalty Relief</h3></p>\n<p>Through the VDP, taxpayers who voluntarily correct their tax filings can receive relief from penalties that would typically result from errors or omissions. This includes late filing penalties, omission penalties, and other sanctions that the <a href=\"/blog/cra-audit-penalties\">CRA might impose</a> under normal circumstances.\n<h3 id=\"interest-relief\">Interest Relief</h3></p>\n<p>Additionally, the VDP may grant partial relief for the interest owed on unpaid taxes. This relief can vary depending on the specifics of each case, including the duration of the delay in payment and the amount of tax owed.\n<h3 id=\"avoidance-of-criminal-prosecution\">Avoidance of Criminal Prosecution</h3></p>\n<p>Taxpayers embracing the VDP can avoid criminal prosecution for tax-related offenses. By proactively disclosing inaccuracies before an audit or enforcement action begins, an individual can demonstrate good faith, which factors into the CRA's decision-making process regarding prosecution.\n<h2 id=\"the-voluntary-disclosure-process\">The Voluntary Disclosure Process</h2></p>\n<p>The Voluntary Disclosure Program (VDP) allows taxpayers to correct inaccuracies in their previous tax filings. It is critical to follow the proper procedures to ensure compliance and potentially obtain relief from penalties and interest.\n<h3 id=\"preparation-and-documentation\">Preparation and Documentation</h3></p>\n<p>Taxpayers must compile all necessary documents that pertain to the tax years in question. This preparation includes gathering relevant financial statements, receipts, and prior tax returns. <strong>All information must be complete</strong>, meaning every tax year and issue must be disclosed. The taxpayer must not have any omissions or incomplete facts related to the disclosures.\n<h3 id=\"submission-procedures\">Submission Procedures</h3></p>\n<p>To initiate the VDP process, taxpayers should submit <em>Form RC199, Voluntary Disclosures Program (VDP) Application</em> or an equivalent letter containing the same information as the form. The submission must be <strong>voluntary</strong>—done before the Canada Revenue Agency (CRA) starts any enforcement action like an audit or investigation regarding the taxpayer's returns.\n<li>Use Form RC199 for application</li>\n<li>Include all relevant information</li>\n<li>Make the disclosure voluntarily before CRA action</li></p>\n<h3 id=\"assessment-and-completion\">Assessment and Completion</h3>\n<p>After submission, the CRA will review the application to determine if it meets the criteria of the program. If accepted, the CRA will process the disclosure and assess any taxes owing. The taxpayer may be granted relief from prosecution and, in some cases, from penalties and interest.\n<li>CRA reviews the disclosure</li>\n<li>Determines acceptance based on VDP criteria</li>\n<li>Assesses taxes and considers relief options</li></p>\n<h2 id=\"conditions-for-a-valid-disclosure\">Conditions for a Valid Disclosure</h2>\n<p>In order for a disclosure to be accepted by the Canada Revenue Agency (CRA) under its Voluntary Disclosures Program (VDP), several specific criteria must be met. These include completeness, voluntariness, potential penalty exposure, and the timeliness of the information being provided.\n<h3 id=\"completeness\">Completeness</h3></p>\n<p>A valid disclosure must be comprehensive, meaning all information affecting the tax years in question is disclosed. This encompasses all relevant facts, documentation, and any other pertinent information related to the disclosure, ensuring the CRA can make an accurate assessment.\n<h3 id=\"voluntariness\">Voluntariness</h3></p>\n<p>The disclosure must be made voluntarily, which indicates the taxpayer initiates the process before the CRA takes any compliance action against them. It is vital that the CRA has not already contacted the taxpayer regarding the information being disclosed.\n<h3 id=\"penalty-exposure\">Penalty Exposure</h3></p>\n<p>The disclosure must include issues that involve a potential application of a penalty. The CRA considers disclosures that prevent the imposition of penalties, which could range from late filing fees to more severe penalties associated with omission or misrepresentation.\n<h3 id=\"information-to-be-more-than-one-year-overdue\">Information to Be More Than One Year Overdue</h3></p>\n<p>The information provided in the disclosure should relate to tax obligations or filings that are at least one year past due. This criterion ensures the program is used by those who are addressing older compliance issues rather than trying to correct immediate past errors.\n<h2 id=\"examples-of-voluntary-disclosure-t1135\">Examples of Voluntary Disclosure: T1135</h2></p>\n<p>When Canadian taxpayers possess foreign property with a total cost amount over CAD $100,000 at any point during the year, they must file <a href=\"/blog/t1135-reporting-requirements\">Form T1135</a>, Foreign Income Verification Statement. Mistakes can occur, and one may forget to report such assets. Forgetting this critical obligation can result in significant penalties.</p>\n<p><strong>The Canada Revenue Agency (CRA)</strong> offers a remedy through the Voluntary Disclosures Program (VDP). If an individual has not reported income from foreign sources on their Canadian tax returns, they can use the VDP to disclose this oversight.</p>\n<p>Consider the following example:\n<li>An individual owns equities in a foreign corporation valued at CAD $150,000 and earns dividends from this investment.</li>\n<li>The individual fails to file Form T1135 for this foreign property.</li>\n<li>The CRA can levy a penalty of up to $2,500 for the failure to file Form T1135.</li></p>\n<p>By coming forward voluntarily and providing the CRA with the necessary information about the mistake:\n1. The taxpayer shows a willingness to comply with tax laws.\n2. They can potentially avoid the hefty penalties that would otherwise accrue.</p>\n<p><em>It is essential to adhere to the CRA's process for the disclosure to be considered valid:</em>\n<li>The disclosure must be voluntary and complete,</li>\n<li>It must involve a potential penalty,</li>\n<li>It must concern information that is at least one year past due,</li>\n<li>And the taxpayer must include payment for the estimated taxes owing.</li></p>\n<p>Using the VDP can be a sound strategy for taxpayers to correct past omissions and gain peace of mind while aligning with the CRA's compliance efforts.</p>\n<p>| Criteria for VDP Eligibility | Applies to T1135 Requirements |\n| --- | --- |\n| Full and voluntary disclosure | Must disclose all details relating to T1135 |\n| Involvement of a penalty | Avoids the $2,500 non-compliance penalty |\n| Minimum one-year past due information | Relates to foreign assets over $100,000 not previously reported |\n| Payment of the estimated tax owing | Taxpayer proposes payment arrangements for taxes owed on unreported income |</p>\n<h2 id=\"after-disclosure-compliance-measures\">After Disclosure: Compliance Measures</h2>\n<p>Following a successful voluntary disclosure with the Canada Revenue Agency (CRA), taxpayers must ensure they abide by certain post-disclosure compliance measures to maintain their good standing and avoid future penalties.\n<h3 id=\"payment-arrangements\">Payment Arrangements</h3></p>\n<p>After disclosing to the CRA, the taxpayer is typically required to settle the owed amounts. If the taxpayer cannot pay the full amount immediately, <strong>the CRA may offer a payment arrangement</strong>. This allows the taxpayer to make smaller, scheduled payments over time.\n<li><strong>Initial Payment</strong>: An upfront payment may be required to demonstrate commitment to the payment arrangement.</li>\n<li><strong>Installment Payments</strong>: The balance can often be paid through a series of installments, the terms of which must be adhered to strictly to avoid default.</li></p>\n<h3 id=\"ongoing-tax-obligations\">Ongoing Tax Obligations</h3>\n<p>Post-disclosure, taxpayers must maintain ongoing compliance with tax laws. This involves:\n<li><strong>Accurate Reporting</strong>: Ensuring all future tax returns are accurate and filed on time.</li>\n<li><strong>Record Keeping</strong>: Maintaining detailed financial records to support claims on tax returns.</li>\n<li><strong>Deadlines</strong>: Meeting all CRA deadlines for submissions and payments to avoid further interest and penalties.</li></p>\n<p>It is crucial that taxpayers engage with the CRA's guidelines to remain in compliance after a voluntary disclosure.\n<h2 id=\"potential-risks-and-considerations\">Potential Risks and Considerations</h2></p>\n<p>When considering the Voluntary Disclosures Program (VDP) offered by the Canada Revenue Agency (CRA), individuals and entities need to be aware of potential risks and important considerations that could affect the outcome of their disclosure.\n<h3 id=\"rejection-of-application\">Rejection of Application</h3></p>\n<p>An application may be <strong>rejected</strong> if it does not meet the CRA's criteria for a valid voluntary disclosure. This includes ensuring that the application is complete, is submitted before the CRA is aware of the compliance issue, and contains information that is <strong>more than one year past due</strong>. The CRA's decision to reject a voluntary disclosure can lead to <strong>taxpayers</strong> being liable for the full amount of taxes owing, plus interest and penalties.\n<h3 id=\"subsequent-audits-and-investigations\">Subsequent Audits and Investigations</h3></p>\n<p>Following a voluntary disclosure, taxpayers may still be <strong>subject</strong> to audits by the CRA for the years disclosed or other tax years. Such audits can uncover additional discrepancies that were not originally reported, potentially leading to further tax liabilities. Moreover, if the CRA suspects <strong>fraud or misrepresentation</strong>, a voluntary disclosure will not protect a taxpayer from criminal investigation or charges.\n<h2 id=\"legal-interpretations-and-precedents\">Legal Interpretations and Precedents</h2></p>\n<p>The Canada Revenue Agency's (CRA) Voluntary Disclosures Program (VDP) has a framework established through Information Circular IC00-1R6. <strong>Legal interpretations</strong> of the VDP guidelines are guided by past <strong>CRA decisions</strong> and <strong>court rulings</strong>.\n<li><strong>Key Criteria:</strong></li>\n\t+ The disclosure must be voluntary.\n\t+ It must be complete.\n\t+ Involves a potential penalty.\n\t+ Includes information that is at least one year past due.</p>\n<p><strong>Precedents</strong> play a significant role in the administration of the VDP. Judicial decisions shape the understanding of \"voluntariness,\" for example, particularly in cases where the CRA has not initiated contact or action.\n<li><strong>Notable Court Cases:</strong></li>\n\t+ Case A: Defined \"voluntary\" within the context of the VDP.\n\t+ Case B: Addressed the completeness of disclosures.</p>\n<p>Taxpayers who come forward through the VDP can benefit from <strong>precedents</strong> set by successful prior disclosures, particularly regarding relief from penalties and interest. As each case is assessed on its merits, interpretations can evolve, although they generally adhere to the principles laid out in the Information Circular.</p>\n<p><em>Relevance of Precedents:</em>\n<li><strong>Consistency:</strong> Ensures fair application across similar cases.</li>\n<li><strong>Guidance:</strong> Offers a reference for lawyers and accountants when advising clients.</li></p>\n<p>The VDP's legal interpretations and the precedents are crucial as they provide taxpayers with clarity on program eligibility and the potential outcomes of disclosure.\n<h2 id=\"how-to-seek-professional-advice\">How to Seek Professional Advice</h2></p>\n<p>When considering the Canada Revenue Agency (CRA) Voluntary Disclosure Program (VDP), taxpayers are advised to seek professional advice. The complexities involved in tax disclosures require expertise to ensure the applications are complete and compliant.</p>\n<p><strong>Select a Qualified Professional:</strong>\n<li><strong>Tax Attorneys:</strong> Specialists in tax law, they offer client-attorney privilege.</li>\n<li><strong>Certified Accountants:</strong> Experts in financial documentation and tax preparation.</li></p>\n<p><strong>Preparation for Consultation:</strong>\n<li>Gather all financial records.</li>\n<li>List questions and concerns related to previous tax filings.</li></p>\n<p><strong>Considerations When Choosing a Professional:</strong>\n<li><strong>Experience:</strong> How versed are they with VDP applications?</li>\n<li><strong>Credentials:</strong> Are they authorized by relevant bodies?</li>\n<li><strong>Reputation:</strong> Do they have positive client testimonials or reviews?</li></p>\n<p><strong>During the Consultation:</strong>\n<li>Be transparent about past filings and concerns.</li>\n<li>Assess their understanding of the VDP and your unique situation.</li>\n<li>Discuss potential scenarios and outcomes.</li></p>\n<p>Professionals can help a taxpayer navigate the nuances of the VDP application, assess the completeness of disclosures, and advise on the implications of the disclosure. A well-selected advisor significantly increases the chances of a successful VDP application.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<p>This section provides succinct answers to common questions about the Canada Revenue Agency's (CRA) Voluntary Disclosure Program (VDP).\n<h3 id=\"how-does-the-cra-s-voluntary-disclosure-program-work-\">How does the CRA's Voluntary Disclosure Program work?</h3></p>\n<p>The CRA's Voluntary Disclosure Program allows taxpayers to come forward and correct inaccuracies or omissions in their previous tax filings. If accepted, they may avoid penalties and prosecution but are still required to pay taxes owed, plus interest.\n<h3 id=\"what-is-included-in-a-voluntary-disclosure-to-the-cra-\">What is included in a voluntary disclosure to the CRA?</h3></p>\n<p>A voluntary disclosure should include all information related to unreported or incorrect income, expenses claimed, or any information that would change the tax owed to the CRA in prior year tax filings.\n<h3 id=\"what-is-the-maximum-number-of-years-for-which-a-voluntary-disclosure-can-be-made-\">What is the maximum number of years for which a voluntary disclosure can be made?</h3></p>\n<p>Taxpayers can make disclosures for any tax years that have not yet been assessed or investigated by the CRA, with no specific limit on the number of years. However, the CRA typically reviews the past six to ten years of filings during the disclosure process.\n<h3 id=\"how-should-an-application-for-the-cra-s-voluntary-disclosure-program-be-submitted-\">How should an application for the CRA's Voluntary Disclosure Program be submitted?</h3></p>\n<p>Applications can be submitted via the CRA's web portal, mail, fax, or through the VDP's dedicated electronic submission service, depending on the individual's circumstance and the form required.\n<h3 id=\"what-is-the-usual-processing-time-for-a-cra-voluntary-disclosure-program-application-\">What is the usual processing time for a CRA Voluntary Disclosure Program application?</h3></p>\n<p>Processing times can vary, but the CRA endeavors to review and process applications within 90 days of submission. Complex cases may take longer.\n<h3 id=\"where-should-the-rc199-voluntary-disclosure-form-be-mailed-to-\">Where should the RC199 Voluntary Disclosure form be mailed to?</h3></p>\n<p>The RC199 Voluntary Disclosure Form should be mailed to the designated tax centre that serves the individual's or entity's region, as indicated on the Canada Revenue Agency's website. Specific address information can be found on the CRA contact page.</p>",
    "toc": [
        {
            "id": "overview-of-the-cra-voluntary-disclosure-program",
            "title": "Overview of the CRA Voluntary Disclosure Program"
        },
        {
            "id": "eligibility-criteria",
            "title": "Eligibility Criteria"
        },
        {
            "id": "benefits-of-voluntary-disclosure",
            "title": "Benefits of Voluntary Disclosure"
        },
        {
            "id": "the-voluntary-disclosure-process",
            "title": "The Voluntary Disclosure Process"
        },
        {
            "id": "conditions-for-a-valid-disclosure",
            "title": "Conditions for a Valid Disclosure"
        },
        {
            "id": "examples-of-voluntary-disclosure-t1135",
            "title": "Examples of Voluntary Disclosure: T1135"
        },
        {
            "id": "after-disclosure-compliance-measures",
            "title": "After Disclosure: Compliance Measures"
        },
        {
            "id": "potential-risks-and-considerations",
            "title": "Potential Risks and Considerations"
        },
        {
            "id": "legal-interpretations-and-precedents",
            "title": "Legal Interpretations and Precedents"
        },
        {
            "id": "how-to-seek-professional-advice",
            "title": "How to Seek Professional Advice"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "December 21, 2023",
    "readTime": "5 min read",
    "tags": [
        "Cra"
    ],
    "category": "Cra",
    "image": "/images/blog-heroes/hero_tax_canada.png"
}