{
    "id": "current-gst-hst-rate-canada-and-by-provinces",
    "slug": "current-gst-hst-rate-canada-and-by-provinces",
    "title": "GST/HST Rates in Canada and Provincial Sales Tax Rates",
    "excerpt": "The Goods and Services Tax (GST) and Harmonized Sales Tax (HST) are value-added taxes applied to goods and services throughout Canada. The rates of th...",
    "content": "<p>The Goods and Services Tax (GST) and Harmonized Sales Tax (HST) are value-added taxes applied to goods and services throughout Canada. The rates of these taxes vary depending on the province or territory in which the transaction takes place. These taxes serve as a significant source of revenue for both federal and provincial governments, and play a crucial role in the Canadian tax system.</p>\n<p>Currently, the GST rate is set at 5% and applies to Alberta, British Columbia, Manitoba, Northwest Territories, Nunavut, Quebec, Saskatchewan, and Yukon. In some provinces, the GST is combined with a provincial sales tax (PST) to create the HST. The HST rate is 13% in Ontario, while it stands at 15% in New Brunswick, Newfoundland and Labrador, Nova Scotia, and Prince Edward Island. It is essential for businesses and consumers alike to be aware of the applicable rates in their respective provinces and territories to ensure <a href=\"/tax-compliance/\">compliance with tax regulations</a>.</p>\n<p>While most goods and services are subject to <a href=\"/blog/when-and-how-do-i-register-for-gst\">GST/HST</a>, certain supplies, such as basic groceries, are taxable at a zero rate. This means that although these items are technically considered taxable, the rate applied is 0%, and no additional tax is charged. Understanding the different tax rates and their applications across Canada enables businesses to accurately calculate and collect taxes, promoting transparency and accountability within the Canadian tax system.\n<h2 id=\"overview-of-gst-hst-in-canada\">Overview of GST/HST in Canada</h2></p>\n<p>The Goods and Services Tax (<a href=\"/blog\">GST</a>) is a federal tax levied on the sale of most goods and services in Canada. The current rate of GST is <strong>5%</strong>. It applies to everyday items like clothing, electronics, and restaurant meals.</p>\n<p>The Harmonized Sales Tax (HST) is a combined federal-provincial tax that incorporates both the GST and the Provincial Sales Tax (PST) of participating provinces. These provinces have chosen to harmonize their taxes instead of implementing separate GST and PST. HST rates vary by province, ranging from <strong>13% to 15%</strong>.</p>\n<p>Currently, there are five provinces in Canada using the HST system. Here is an overview of the HST rates by province:</p>\n<p>| Province | HST Rate |\n| --- | --- |\n| Ontario | 13% |\n| New Brunswick | 15% |\n| Newfoundland and Labrador | 15% |\n| Nova Scotia | 15% |\n| Prince Edward Island | 15% |</p>\n<p>Provinces that do not use HST levy their own separate PST alongside the federal GST. The rates for PST differ across provinces, and some territories have no PST at all.</p>\n<p>It is essential to stay updated with any changes in GST/HST rates and to ensure businesses are meeting their <a href=\"/blog/how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide\">indirect tax obligations</a>. As rates can change over time, consulting official sources, such as the Canada Revenue Agency, is recommended for up-to-date information on GST and HST rates and regulations.\n<h2 id=\"current-gst-hst-rates\">Current GST/HST Rates</h2></p>\n<p>Canada implements a Goods and Services Tax (GST) and a Harmonized Sales Tax (HST) system. The GST is a federal tax, while HST is combined federal and provincial taxes. Some provinces also apply a Provincial Sales Tax (PST). The tax rates vary among provinces and territories, depending on their individual arrangements.</p>\n<p><strong>GST:</strong> It is a federal tax charged at a rate of 5% throughout Canada, except for provinces that use the HST system.</p>\n<p><strong>HST:</strong> The HST rate differs by province, as it combines the 5% GST with a provincial sales tax rate. The HST rates range from 13% to 15%.</p>\n<p>Here is a table presenting the current GST/HST rates for each province and territory:</p>\n<p>| Province/Territory | GST (%) | HST (%) |\n| --- | --- | --- |\n| Alberta | 5 | - |\n| British Columbia | 5 | - |\n| Manitoba | 5 | - |\n| New Brunswick | - | 15 |\n| Newfoundland and Labrador | - | 15 |\n| Northwest Territories | 5 | - |\n| Nova Scotia | - | 15 |\n| Nunavut | 5 | - |\n| Ontario | - | 13 |\n| Prince Edward Island | - | 15 |\n| Quebec | 5 | - |\n| Saskatchewan | 5 | - |\n| Yukon | 5 | - |</p>\n<p>In provinces that do not apply the HST system, purchasers may be subject to an additional <em>Provincial Sales Tax (PST)</em> or <em>Quebec Sales Tax (QST)</em>. These taxes are separate from GST and need to be considered when calculating the total sales tax for certain transactions.</p>\n<p>It is essential for businesses to charge the correct GST/HST rate in their transactions, and they should always be aware of any changes in tax rates that may affect their operations.\n<h2 id=\"gst-hst-rates-by-province\">GST/HST Rates by Province</h2></p>\n<h3 id=\"alberta\">Alberta</h3>\n<p>In Alberta, the Goods and Services Tax (GST) rate is <strong>5%</strong>. The province does not have a Provincial Sales Tax (PST), so only the GST is applicable.\n<h3 id=\"british-columbia\">British Columbia</h3></p>\n<p>British Columbia's sales tax system includes a <strong>5%</strong> GST and a <strong>7%</strong> PST, which are applied separately to eligible goods and services. However, certain items are exempt from PST or taxed at a different rate.\n<h3 id=\"manitoba\">Manitoba</h3></p>\n<p>Manitoba's sales taxes comprise of a <strong>5%</strong> GST and an <strong>7%</strong> RST. These taxes are applied separately, and specific exemptions or reduced rates may apply to particular items.\n<h3 id=\"new-brunswick\">New Brunswick</h3></p>\n<p>New Brunswick implements a Harmonized Sales Tax (HST) of <strong>15%</strong>. This tax combines the GST and PST, simplifying the sales tax system within the province.\n<h3 id=\"newfoundland-and-labrador\">Newfoundland and Labrador</h3></p>\n<p>Similar to New Brunswick, Newfoundland and Labrador also use a <strong>15%</strong> HST rate, combining the sales taxes for ease of application and calculation.\n<h3 id=\"northwest-territories\">Northwest Territories</h3></p>\n<p>The sales tax in the Northwest Territories consists solely of the <strong>5%</strong> GST. There is no additional PST within this territory.\n<h3 id=\"nova-scotia\">Nova Scotia</h3></p>\n<p>Nova Scotia has an HST rate of <strong>15%</strong>, merging the GST and PST into a single tax system.\n<h3 id=\"nunavut\">Nunavut</h3></p>\n<p>Nunavut only has a <strong>5%</strong> GST without an additional PST, resulting in a simplified sales tax application.\n<h3 id=\"ontario\">Ontario</h3></p>\n<p>Ontario applies a single HST rate of <strong>13%</strong>, combining both the GST and PST elements into one unified tax system.\n<h3 id=\"prince-edward-island\">Prince Edward Island</h3></p>\n<p>Prince Edward Island uses an HST rate of <strong>15%</strong>, merging both the GST and PST into one harmonized system.\n<h3 id=\"quebec\">Quebec</h3></p>\n<p>Quebec employs a unique tax system with a <strong>5%</strong> GST, in addition to a <strong>9.975%</strong> Quebec Sales Tax (QST). These taxes are applied separately, but some goods and services may qualify for exemptions or reduced rates.\n<h3 id=\"saskatchewan\">Saskatchewan</h3></p>\n<p>Saskatchewan's sales tax consists of a <strong>5%</strong> GST and a <strong>6%</strong> PST. These taxes apply independently and may have differing rates or exemptions for specific items.\n<h3 id=\"yukon\">Yukon</h3></p>\n<p>Similar to the Northwest Territories and Nunavut, Yukon only applies the <strong>5%</strong> GST with no additional PST component.\n<h2 id=\"calculating-gst-hst-for-goods-and-services\">Calculating GST/HST for Goods and Services</h2></p>\n<p>When <a href=\"/blog/how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide\">calculating GST/HST</a> in Canada, one has to consider the type of supply and the province in which the transaction takes place. The GST/HST rates vary depending on the province, and it's essential to know the current rates and provincial requirements.</p>\n<p>As of 2024, the following table shows the GST/HST rates in each province:</p>\n<p>| Province | Type of sales tax | Rate (as of Jan 1, 2024) |\n| --- | --- | --- |\n| Alberta | GST Only | 5% |\n| British Columbia | GST+PST | 5%+7% |\n| Manitoba | GST+PST | 5%+7% |\n| New Brunswick | HST Only | 15% |\n| Newfoundland | HST Only | 15% |\n| Northwest Territories | GST Only | 5% |\n| Nova Scotia | HST Only | 15% |\n| Nunavut | GST Only | 5% |\n| Ontario | HST Only | 13% |\n| Prince Edward Island | HST Only | 15% |\n| Quebec | <a href=\"/blog/quebec-small-business-tax-rate\">GST+QST</a> | 5%+9.975% |\n| Saskatchewan | GST+PST | 5%+6% |\n| Yukon | GST Only | 5% |</p>\n<p>To calculate the GST/HST for a transaction, start by identifying the type of supply, either as goods or services. Then, determine the province where the transaction takes place and its corresponding tax rate. Lastly, apply the appropriate rate to the transaction's cost.</p>\n<p>For example, if one were to sell goods worth $1,000 in Ontario, the GST/HST calculation would be as follows:\n1. Identify the type of supply: taxable goods\n2. Determine the province: Ontario\n3. Applicable tax rate: 13% HST\n4. Calculate GST/HST: $1,000 * 0.13 = $130</p>\n<p>In this case, the total amount charged, including HST, would be $1,130.</p>\n<p>When calculating GST/HST in provinces with a combination of GST and PST/QST, remember to calculate both taxes separately. For instance, if the same $1,000 worth of goods were sold in British Columbia, the tax calculation would be:\n1. Apply 5% GST: $1,000 * 0.05 = $50\n2. Apply 7% PST: $1,000 * 0.07 = $70</p>\n<p>The final amount charged to the customer in this case, including both GST and PST, would be $1,120.</p>\n<p>Properly calculating GST/HST helps businesses stay compliant with Canadian tax regulations while also ensuring accurate pricing for customers.\n<h2 id=\"gst-hst-registration-requirements\">GST/HST Registration Requirements</h2></p>\n<p>In Canada, businesses must <a href=\"/blog/when-and-how-do-i-register-for-gst\">register for a <strong>GST/HST account</strong></a> if they provide taxable goods or services as part of their commercial activities. However, businesses that only provide exempt supplies are generally not eligible for registration. The Goods and Services Tax (GST) and Harmonized Sales Tax (HST) rates vary across provinces and territories.</p>\n<p>To determine whether your business needs to register for a GST/HST account, consider these two factors:\n1. Your business provides taxable goods or services.\n2. Your business surpasses a specific threshold in total taxable revenue.</p>\n<p>Businesses that meet both criteria must register for a GST/HST account. It is important to note that the registration requirements may vary depending on factors such as business size, location, and type of goods or services provided.</p>\n<p>For more information on the registration process and requirements, it is recommended to consult the Canada Revenue Agency's (CRA) official website or consult with a professional tax advisor.\n<h2 id=\"gst-hst-rebates-and-credits\">GST/HST Rebates and Credits</h2></p>\n<p>The Goods and Services Tax (GST) and the Harmonized Sales Tax (HST) are consumption taxes levied in Canada. The GST is applied at a federal level, while the HST is a combination of the federal GST and provincial taxes. The rates differ by province, with some provinces applying only the GST and others using the HST.</p>\n<p><strong>GST/HST Credit</strong> is a tax-free, quarterly payment that aids individuals and families with low to modest income to offset the GST or HST they pay. Eligibility for the GST/HST credit is determined by various factors, such as revenue, family size, and marital status.</p>\n<p>To receive the GST/HST credit, individuals need to meet certain eligibility criteria, such as having a valid social insurance number, being a resident of Canada, and filing annual tax returns.</p>\n<p>In conclusion, the GST/HST credit serves as an important support system for low-income families and individuals in Canada, helping to offset the burden of consumption taxes for more equitable living conditions.\n<h2 id=\"reporting-and-remitting-gst-hst\">Reporting and Remitting GST/HST</h2></p>\n<p>The process of reporting and remitting GST/HST includes filing a return, reporting the amount of tax collected and paid, and remitting any balance owed to the Canada Revenue Agency (CRA). It is crucial for businesses to understand their GST/HST obligations to stay compliant with the tax laws.</p>\n<p>Businesses can file their GST/HST returns using various methods, such as <strong>online through My Business Account</strong>, in person at a participating financial institution, or by mail by sending the paper GST/HST return (GST34-2 or GST62) to the address on the return. It is advisable to use the GST/HST Return Working Copy to calculate amounts and maintain records.</p>\n<p>When reporting the total sales and other revenues on the GST/HST return, it is essential to fill in <strong>lines 101, 103, 104, 105, 106, 107, 108, and 109</strong>. Additionally, other credits should be reported on lines 110, 111, 112, and 113A, while other debits need to be listed on lines 205, 405, and 113B. Detailed instructions on how to complete a GST/HST return can be found on the CRA website.</p>\n<p>Businesses must remit the collected GST/HST to the CRA using one of the following methods, based on their preference:\n1. <strong>Remit electronically</strong> through My Business Account or CRA's My Payment service.\n2. <strong>Remit at a financial institution</strong> in Canada by submitting the payment together with the return.\n3. <strong>Send the payment by mail</strong> using a cheque or money order, payable to the Receiver General.</p>\n<p>The <a href=\"/blog/how-to-save-money-with-the-gst-hst-quick-method\">Quick Method of Accounting for GST/HST</a> is an alternative reporting option available for some small businesses. It simplifies the calculation process and reduces the paperwork associated with remitting the GST/HST. However, it is important to note that not all supplies are eligible for the Quick Method calculation.</p>\n<p>In conclusion, businesses in Canada have to accurately report and remit the GST/HST they have collected on eligible supplies. Familiarity with the various reporting methods, remittance options, and calculation techniques can help businesses ensure compliance with the tax laws and maintain good standing with the CRA.\n<h2 id=\"gst-hst-exemptions-and-zero-rated-goods\">GST/HST Exemptions and Zero-Rated Goods</h2></p>\n<p>In Canada, the Goods and Services Tax (GST) and the Harmonized Sales Tax (HST) are applied to most goods and services. However, certain items are <a href=\"/blog/ontario-hst-exemptions-list\">exempt</a> or zero-rated, meaning they are not subject to these taxes.</p>\n<p><strong>Exempt goods and services</strong> are those not subject to GST/HST. Notably, health care and dental services provided by licensed professionals for medical reasons are exempt. Additionally, childcare services offered by babysitters and daycare providers for children under the age of 14 for less than 24 hours a day qualify as exempt services.</p>\n<p><strong>Zero-rated goods</strong>, on the other hand, have a 0% GST/HST rate throughout Canada. Basic groceries, for example, are taxable at a 0% rate in every province and territory.</p>\n<p>Keep in mind that GST/HST registrants must collect tax based on the province or territory where the taxable supplies take place. Understanding the different exemptions and zero-rated goods is essential for businesses to correctly charge and comply with Canada's tax regulations.\n<h2 id=\"impact-of-gst-hst-on-business\">Impact of GST/HST on Business</h2></p>\n<p>In Canada, <strong>Goods and Services Tax (GST)</strong> and <strong>Harmonized Sales Tax (HST)</strong> play a significant role in business operations.</p>\n<p>Businesses need to consider the impact of these taxes on their supply chain, pricing, cash flow, and regulatory compliance. It is essential for Canadian businesses to understand the GST/HST system and manage their tax obligations effectively.</p>\n<p>To begin with, businesses must register for GST/HST and collect it on taxable goods and services they provide. Proper management of these tax collections ensures that the business remits the correct tax amounts to the government. It is also crucial for businesses to monitor the GST/HST charged on their expenses, as they may be eligible to claim <strong>Input Tax Credits (ITCs)</strong>, which can offset the taxes paid on eligible business expenses.</p>\n<p>Moreover, GST/HST affects pricing decisions. Including these taxes in the final price of goods and services ensures that customers make informed purchasing decisions and businesses can maintain transparent pricing policies. This pricing clarity contributes to a better overall customer experience.</p>\n<p>Another aspect of the business is cash flow management. As businesses need to remit GST/HST collected from customers, they should be attentive to both the inflow and outflow of tax revenues. Effective management of this cash flow aspect can prevent potential shortfalls in the business's finances, particularly during periods of higher-than-usual business volume.</p>\n<p>In summary, GST/HST plays a vital part in different aspects of a business – from tax compliance and cash flow to pricing and customer experience. A thorough understanding of this tax system helps Canadian businesses make informed decisions and effectively navigate their financial ecosystem.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<h3 id=\"how-is-the-hst-calculated-in-ontario-\">How is the HST calculated in Ontario?</h3>\n<p>The Harmonized Sales Tax (HST) in Ontario is calculated by combining the federal Goods and Services Tax (GST) with the provincial portion. The current HST rate in Ontario is 13%, which includes a 5% federal GST and an 8% provincial component.\n<h3 id=\"what-is-the-current-combined-gst-and-pst-rate-in-british-columbia-\">What is the current combined GST and PST rate in British Columbia?</h3></p>\n<p>In British Columbia, the combined sales tax rate consists of a 5% federal GST and a 7% Provincial Sales Tax (PST), making the total combined rate 12%.\n<h3 id=\"which-province-in-canada-has-the-highest-combined-sales-tax-rate-and-what-is-the-percentage-\">Which province in Canada has the highest combined sales tax rate, and what is the percentage?</h3></p>\n<p>The provinces with the highest combined sales tax rates in Canada are New Brunswick, Newfoundland and Labrador, Nova Scotia, and Prince Edward Island, all with a 15% rate.\n<h3 id=\"what-are-the-specific-gst-rates-applied-in-the-provinces-without-hst-\">What are the specific GST rates applied in the provinces without HST?</h3></p>\n<p>In provinces without HST, only the federal GST is applied. The current GST rate is 5% and is applicable in Alberta, British Columbia, Manitoba, Northwest Territories, Nunavut, Quebec, Saskatchewan, and Yukon.\n<h3 id=\"how-do-quebec-s-sales-tax-rates-compare-to-those-of-other-provinces-\">How do Quebec's sales tax rates compare to those of other provinces?</h3></p>\n<p>Quebec has a unique tax system, with a combined rate of 14.975%. This consists of a 5% federal GST and a 9.975% Quebec Sales Tax (QST). This makes Quebec's combined sales tax rate lower than the four provinces with 15% HST but higher than most other provinces.</p>",
    "toc": [
        {
            "id": "overview-of-gst-hst-in-canada",
            "title": "Overview of GST/HST in Canada"
        },
        {
            "id": "current-gst-hst-rates",
            "title": "Current GST/HST Rates"
        },
        {
            "id": "gst-hst-rates-by-province",
            "title": "GST/HST Rates by Province"
        },
        {
            "id": "calculating-gst-hst-for-goods-and-services",
            "title": "Calculating GST/HST for Goods and Services"
        },
        {
            "id": "gst-hst-registration-requirements",
            "title": "GST/HST Registration Requirements"
        },
        {
            "id": "gst-hst-rebates-and-credits",
            "title": "GST/HST Rebates and Credits"
        },
        {
            "id": "reporting-and-remitting-gst-hst",
            "title": "Reporting and Remitting GST/HST"
        },
        {
            "id": "gst-hst-exemptions-and-zero-rated-goods",
            "title": "GST/HST Exemptions and Zero-Rated Goods"
        },
        {
            "id": "impact-of-gst-hst-on-business",
            "title": "Impact of GST/HST on Business"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "August 28, 2023",
    "readTime": "5 min read",
    "tags": [
        "Sales Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_ledgerlogic_gst_rates.png"
}