{
    "id": "e-commerce-gst-hst-collection-for-online-sales-in-canada",
    "slug": "e-commerce-gst-hst-collection-for-online-sales-in-canada",
    "title": "E-Commerce - GST/HST Collection for Online Sales in Canada",
    "excerpt": "The landscape of e-commerce in Canada is continually evolving, and with it, the tax implications for businesses operating in the digital space. For th...",
    "content": "<p>The landscape of e-commerce in Canada is continually evolving, and with it, the tax implications for businesses operating in the digital space. For those engaging in e-commerce, understanding the tax responsibilities is critical to ensure compliance with Canadian tax laws. This includes familiarizing themselves with the Goods and Services Tax (GST) and Harmonized Sales Tax (HST), which are pivotal elements in Canadian taxation.</p>\n<p>Canadian e-commerce businesses are subject to the same tax laws as traditional brick-and-mortar establishments. The threshold for mandatory GST/HST registration is significant; businesses with revenues exceeding $30,000 are required to <a href=\"/blog/when-and-how-do-i-register-for-gst\">register for a GST/HST</a> number. This tax registration is not just a formality; it has implications for how businesses collect and remit taxes on their sales within Canada.</p>\n<p>Moreover, recent tax law amendments have honed in on the digital economy, specifically targeting digital platform operators and expanding the GST/HST obligations to a broader range of services and intangible goods. As of July 1, 2021, significant measures have been initiated to adapt the tax system to the intricacies of the digital economy, indicating the government's recognition of the growing e-commerce sector and its impact on the Canadian market.\n<h2 id=\"overview-of-ecommerce-taxation-in-canada\">Overview of Ecommerce Taxation in Canada</h2></p>\n<p>In Canada, <a href=\"/blog/accounting-best-practices-for-canadian-e-commerce\"><strong>ecommerce transactions</strong></a> are subject to the Goods and Services Tax (GST) and Harmonized Sales Tax (HST), which apply to both tangible goods and services, including digital products and platforms operating in the digital economy. As of July 1, 2021, <strong>digital platform operators</strong> may have additional obligations under new measures.</p>\n<p>Ecommerce businesses must be aware of the following tax components:\n<li><strong>GST</strong>: A federal tax of 5% that applies to most goods and services.</li>\n<li><strong>HST</strong>: A combined tax that includes the GST and <a href=\"/blog/current-gst-hst-rate-canada-and-by-provinces\">provincial sales tax</a>, applicable in certain provinces.</li></p>\n<p>The HST rate is variable, determined by each participating province, making it critical for ecommerce operators to be informed of the rates applicable to their customers' locations.</p>\n<p>| Province | Combined HST Rate |\n| --- | --- |\n| Ontario | 13% |\n| Nova Scotia | 15% |\n| New Brunswick | 15% |\n| Newfoundland and Labrador | 15% |\n| Prince Edward Island | 15% |</p>\n<p><strong>Ecommerce and reporting requirements</strong> also extend to capital cost allowance for business expenses related to computer software and website development.</p>\n<p>Ecommerce businesses must register for a GST/HST account if their worldwide taxable revenues exceed CAD $30,000 in the last four consecutive quarters. Once registered, they are obliged to collect, report, and remit the appropriate taxes to the Canada Revenue Agency (CRA).</p>\n<p>It is crucial for ecommerce operators to understand their tax obligations and ensure compliance with Canadian tax laws to avoid penalties and interest. Enlisting the expertise of a tax professional may be beneficial to navigate the complexities of ecommerce taxation in Canada.\n<h2 id=\"goods-and-services-tax-gst-in-ecommerce\">Goods and Services Tax (GST) in Ecommerce</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/12/DALL·E-2023-12-01-11.22.26-A-text-free-creative-depiction-of-various-digital-payment-methods-in-e-commerce-including-credit-cards-mobile-payments-and-cryptocurrencies.-The-il.png\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, ecommerce transactions are subject to the Goods and Services Tax (GST), which also encompasses the Harmonized Sales Tax (HST) in certain provinces. These taxes apply to digital products and services sold to Canadian consumers by both domestic and foreign businesses. As of July 1, 2021, there have been significant updates to the application of GST/HST in the digital economy.</p>\n<p><strong>Who Should Charge GST/HST:</strong>\n<li>Domestic digital economy businesses</li>\n<li><strong>Foreign digital platform operators</strong> facilitating sales</li>\n<li><strong>Digital service providers</strong> selling directly to Canadian consumers</li></p>\n<p><strong>Taxable Supplies:</strong>\nGST/HST applies to a range of digital services, including but not limited to:\n<li>Downloadable digital content (music, videos, software)</li>\n<li>Online memberships</li>\n<li>Electronic learning platforms</li>\n<li>Digital subscriptions services</li></p>\n<p><strong>GST/HST Rates:</strong>\nSince these rates may vary, here's a breakdown:</p>\n<p>| Province | GST (%) | HST (%) | Provincial Sales Tax Considerations |\n| --- | --- | --- | --- |\n| Alberta, British Columbia, Manitoba, Quebec, Saskatchewan | 5 | N/A | Consider PST in BC & SK, RST in MB and QST in QC |\n| Ontario | N/A | 13 | N/A |\n| Nova Scotia, New Brunswick, PEI, Newfoundland | N/A | 15 | N/A |</p>\n<p>Businesses must account for these taxes in their pricing and remit them to the Canada Revenue Agency (CRA). The CRA's platform provides guidelines on how to calculate, charge, and collect these taxes efficiently.</p>\n<p>It's crucial for companies operating in the digital arena to comply with these tax laws, as failing to do so can lead to significant penalties. Those selling electronic services and products may need to register for GST/HST, collect the tax, and file returns periodically. This responsibility extends to non-resident companies participating in the Canadian digital economy, prompted by the 2021 tax law enhancements addressing the growing digital market.\n<h2 id=\"provincial-sales-taxes-pst-and-harmonized-sales-tax-hst-in-ecommerce\">Provincial Sales Taxes (PST) and Harmonized Sales Tax (HST) in Ecommerce</h2></p>\n<p>When navigating e-commerce in Canada, businesses must consider both Provincial Sales Taxes (PST) and the Harmonized Sales Tax (HST). E-commerce transactions abide by the same taxation rules as physical sales; taxes charged are based on the location of the buyer.</p>\n<p>The PST is a sales tax levied by individual provinces. Rates vary and not all provinces apply PST. For example, Saskatchewan charges a 6% PST. It is important to verify each province's rate as they can also change; therefore, maintaining current knowledge is crucial for compliance.</p>\n<p><strong>The Harmonized Sales Tax (HST)</strong>, is a combination of federal Goods and Services Tax (GST) and PST, employed by certain provinces. HST streamlines taxation by merging the two taxes into one single rate, simplifying the process for businesses and consumers. Rates differ as well:\n<li><strong>Ontario</strong>: 13% HST</li>\n<li><strong>Nova Scotia, New Brunswick, Prince Edward Island, and Newfoundland and Labrador</strong>: 15% HST</li></p>\n<p>In e-commerce, the seller must charge HST/PST according to the buyer's province of residence. This ensures that the correct tax amount is applied, whether the transaction involves goods or services.</p>\n<p>Small businesses generating less than $30,000 in revenue annually may be exempt from collecting GST/HST. Upon surpassing this threshold, the business must register for, and begin charging, the appropriate taxes.</p>\n<p>Failure to comply with Canada’s tax regulations can lead to penalties for businesses. Consequently, it is essential for e-commerce entities to stay informed of current tax rates and apply them correctly to their online sales.\n<h2 id=\"ecommerce-tax-registration-requirements\">Ecommerce Tax Registration Requirements</h2></p>\n<p>In Canada, e-commerce businesses are subject to various tax registration requirements, including GST/HST, PST, and QST, depending on the nature of their operations and location. Adherence to these regulations is critical for compliance.\n<h3 id=\"gst-hst-registration\">GST/HST Registration</h3></p>\n<p>Businesses operating in Canada with e-commerce activities must register for the Goods and Services Tax (GST) or Harmonized Sales Tax (HST) if their revenue exceeds <strong>$30,000</strong> over four consecutive quarters. This threshold is the same for all Canadian provinces and territories. Below are key points for GST/HST registration:\n<li><strong>Mandatory Registration</strong>: Businesses surpassing the $30,000 revenue threshold must register for GST/HST.</li>\n<li><strong>Voluntary Registration</strong>: Businesses under the threshold may register voluntarily, which allows them to reclaim any GST/HST paid on their expenses.</li></p>\n<h3 id=\"pst-registration\">PST Registration</h3>\n<p>The Provincial Sales Tax (PST) applies to e-commerce businesses operating in specific provinces that have not harmonized their sales tax with the GST. For these provinces, separate PST registration is required. Businesses should note the following:\n<li><strong>Province-Specific Rates</strong>: PST rates vary by province, and companies should adhere to the rate specific to the province of their customers.</li>\n<li><strong>Independent Registration</strong>: Registration for PST is separate from GST/HST and must be done with each applicable province's taxation authority.</li></p>\n<h3 id=\"qst-registration\">QST Registration</h3>\n<p>E-commerce businesses that sell goods or services in Quebec may need to register for the Quebec Sales Tax (QST). The QST system is administrated by Revenue Quebec and has its own set of regulations:\n<li><strong>QST Registration</strong>: Required for businesses selling to Quebec residents, similar to the GST registration process.</li>\n<li><strong>Distinct System</strong>: Though similar to the GST/HST, the QST is managed independently, and businesses must ensure proper registration and remittance as per Quebec laws.</li></p>\n<h2 id=\"filing-ecommerce-sales-taxes-in-canada\">Filing Ecommerce Sales Taxes in Canada</h2>\n<p>Canadian ecommerce businesses must stay compliant with sales tax regulations which include filing for the Goods and Services Tax/Harmonized Sales Tax (GST/HST), Provincial Sales Tax (PST), and in Quebec, the Quebec Sales Tax (QST).\n<h3 id=\"gst-hst-filing\">GST/HST Filing</h3></p>\n<p>Ecommerce companies operating in Canada are required to register for and file GST/HST if they make taxable supplies in Canada. <strong>Small suppliers</strong> may be exempt unless their revenue exceeds a specific threshold. <a href=\"/blog/when-and-how-do-i-register-for-gst\"><strong>Filing schedules</strong></a> vary based on the business’s revenue, and the Canada Revenue Agency (CRA) determines if it should be monthly, quarterly, or annually. Companies can <a href=\"/blog/how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide\"><strong>file electronically</strong></a> through the CRA’s online services.\n<h3 id=\"pst-filing\">PST Filing</h3></p>\n<p>Businesses that sell goods and services in provinces that collect <strong>PST</strong> must register for a PST account. British Columbia, Saskatchewan, Manitoba, and Quebec all require separate PST filings. Each province has its own <strong>filing deadlines and procedures</strong>. Businesses are responsible for understanding and adhering to the provincial guidelines, and they are encouraged to file <strong>online</strong> where available.\n<h3 id=\"qst-filing\">QST Filing</h3></p>\n<p>For <a href=\"https://www.revenuquebec.ca/en/one-mission-concrete-actions/helping-you-meet-your-obligations/what-is-the-digital-economy/e-commerce/\">ecommerce businesses operating within Quebec</a> or selling to Quebec residents, registering for QST is mandatory unless the business is a small supplier. The <strong>filing frequency</strong> for QST, similar to GST/HST, is informed by the business’s taxable sales. Revenu Quebec provides an electronic service enabling businesses to file and remit QST. Being registered for QST also means complying with specific <strong>record-keeping requirements</strong> set by the Agency.\n<h2 id=\"ecommerce-tax-deductions-and-credits\">Ecommerce Tax Deductions and Credits</h2></p>\n<p>E-commerce businesses in Canada can leverage various tax deductions and credits to reduce their fiscal burden. This section succinctly provides guidance on input tax credits and permissible business expense deductions.\n<h3 id=\"input-tax-credits\">Input Tax Credits</h3></p>\n<p>E-commerce enterprises are entitled to <strong>Input Tax Credits (ITCs)</strong> to recover the Goods and Services Tax (GST) or Harmonized Sales Tax (HST) paid on purchases and expenses related to their commercial activities. These credits are a direct offset against the GST/HST collected from customers. E-commerce businesses must be registered for GST/HST to claim ITCs, and only those who have surpassed the $30,000 annual threshold are mandated to register.\n<li><strong>Qualifying Expenses for ITCs:</strong></li>\n\t+ Inventory or supplies\n\t+ Commercial property rent or lease\n\t+ Utilities and operational costs\n\t+ Software and website development</p>\n<h3 id=\"business-expense-deductions\">Business Expense Deductions</h3>\n<p>E-commerce operators can deduct certain expenses incurred in the course of their business to reduce taxable income. These expenses must be both necessary and directly related to the pursuit of business profit.\n<li><strong>Eligible Business Expense Deductions:</strong></li>\n\t+ Capital cost allowance for computer software\n\t+ Website development and maintenance\n\t+ Advertising costs, specifically online marketing\n\t+ Shipping and delivery expenses</p>\n<p>It is essential that e-commerce businesses maintain meticulous records of all expenses to validate the deductions claimed.\n<h2 id=\"tax-compliance-for-international-ecommerce-sellers\">Tax Compliance for International Ecommerce Sellers</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/12/DALL·E-2023-12-01-11.09.58-A-digital-illustration-showing-a-globe-with-various-shopping-icons-and-digital-connections-linking-different-countries-representing-global-connectivi.png\" alt=\"\" class=\"img-fluid\" />\n<p>International ecommerce sellers must navigate Canada's tax system, ensuring compliance with the Goods and Services Tax/Harmonized Sales Tax (GST/HST) requirements and understanding the implications of duties and customs for their cross-border transactions.\n<h3 id=\"non-resident-gst-hst-registration\">Non-Resident GST/HST Registration</h3></p>\n<p>Foreign e-commerce businesses selling goods and services to Canadian consumers are typically required to register for GST/HST if their taxable supplies to Canada exceed a specified threshold. As of July 1, 2021, non-resident sellers, including digital platform operators, are subject to GST/HST obligations, and must collect and remit taxes for sales to Canadian customers. The registration process can be done through the Canada Revenue Agency (CRA) and involves the following steps:\n<li><strong>Determine if Required to Register</strong>: Check if your business meets the criteria for GST/HST registration.</li>\n<li><strong>Complete Registration</strong>: Fill out the necessary forms provided by the CRA.</li>\n<li><strong>Collect GST/HST</strong>: Apply the correct tax rate to your sales based on provincial guidelines.</li>\n<li><strong>Remit GST/HST</strong>: Submit the collected taxes to the CRA according to the established filing schedule.</li></p>\n<h3 id=\"duties-and-customs\">Duties and Customs</h3>\n<p>When shipping physical goods to Canada, international ecommerce sellers must also consider duties and customs. These are assessed based on the type and value of the goods imported into the country. Sellers should be aware of the following:\n<li><strong>Duties</strong>: Calculate the appropriate duty rates, which vary by product and origin.</li>\n<li><strong>Customs Declarations</strong>: Provide accurate customs documentation, including the value of goods.</li>\n<li><strong>Payment of Duties</strong>: Duties must be paid at the time of importation, or through a deferred payment plan if applicable.</li>\n<li><strong>Record Keeping</strong>: Maintain records of imports for at least six years, as required by Canadian law.</li></p>\n<p>Adherence to these tax and customs regulations is crucial for international ecommerce sellers to avoid penalties and ensure smooth operations within the Canadian market.\n<h2 id=\"ecommerce-platform-specific-tax-considerations\">Ecommerce Platform-Specific Tax Considerations</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/12/DALL·E-2023-12-01-11.25.06-An-image-showing-e-commerce-analytics-and-big-data-with-charts-graphs-and-data-visualizations.-The-image-should-depict-a-high-tech-modern-environm.png\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, ecommerce businesses must navigate platform-specific tax settings and obligations. Understanding these nuances ensures compliance with the Goods and Services Tax/Harmonized Sales Tax (GST/HST) requirements.\n<h3 id=\"shopify-tax-settings\">Shopify Tax Settings</h3></p>\n<p>Shopify merchants in Canada have the ability to set up GST/HST rates within their store settings. It is imperative for sellers to input the correct tax rates according to their province or territory to guarantee accurate charges at checkout. For example:\n<li><strong>GST-only provinces</strong>: 5% rate is applied.</li>\n<li><strong>HST provinces</strong>: Rates range from 13% to 15%, depending on the province.</li></p>\n<p>To adjust tax settings, merchants should:\n1. Go to their Shopify admin panel.\n2. Click on 'Settings' and then 'Taxes'.\n3. Set the appropriate tax rates for each region they operate in.</p>\n<p>Shopify also handles the complexities of tax collection on different types of products, including digital goods, by allowing sellers to classify their products accordingly within the platform's tax settings.\n<h3 id=\"amazon-seller-tax-obligations\">Amazon Seller Tax Obligations</h3></p>\n<p>Amazon sellers in Canada must also account for GST/HST on their sales. The platform does not automatically calculate and collect tax on behalf of third-party sellers, which places the responsibility squarely on the shoulders of the seller to determine and remit the correct taxes. Sellers must:\n<li>Register for a GST/HST account if surpassing the taxable threshold.</li>\n<li>Include the correct GST/HST in their product prices or add it at checkout.</li></p>\n<p>Amazon provides a detailed tax calculation service that sellers can opt into, which helps to calculate the appropriate tax on each sale, based on the item type and buyer's location. This service simplifies the process but does not absolve sellers of their responsibilities to report and remit taxes to the Canada Revenue Agency (CRA).\n<h2 id=\"audits-and-penalties-for-ecommerce-tax-non-compliance\">Audits and Penalties for Ecommerce Tax Non-Compliance</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38nkf-vwukt.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, businesses engaged in ecommerce are subject to strict tax regulations. The Canada Revenue Agency (CRA) conducts <a href=\"/blog/how-do-you-deal-with-a-cra-audit\">audits</a> to ensure compliance with tax laws. Non-compliance can result in significant penalties.</p>\n<p><strong>Audits</strong> typically involve examining financial records and transactions to verify that income is reported accurately and taxes are paid. For ecommerce, this includes reviewing online sales, digital services, and the use of electronic payment systems. The CRA employs tools and techniques to detect inaccuracies in tax reports, including <em>forensic data analysis</em>.</p>\n<p>Upon discovering non-compliance, the CRA can impose various <strong>penalties</strong>:\n<li><strong>Interest</strong> on unpaid taxes, calculated from the due date</li>\n<li><strong>Late Filing Penalties</strong> if tax returns are not filed on time: 5% of the balance owed, plus 1% of the balance owed for each full month the return is late, up to a maximum of 12 months</li>\n<li><strong>Gross Negligence <a href=\"/blog/cra-audit-penalties\">Penalties</a></strong> of up to 50% of the unpaid tax or the overstated credits related to the false statement or omission</li></p>\n<p>Businesses that engage in tax evasion or aggressive non-compliance may face more serious consequences, including <em>criminal charges</em>.</p>\n<p>| Penalty Type | Penalty |\n| --- | --- |\n| Late Filing | Up to 17% of owed balance (incremental) |\n| Inaccurate Reporting | Depends on extent of inaccuracies but could be up to 50% of unpaid tax |\n| Evasion | Up to 200% of evaded amount & possible jail time |</p>\n<p>Merchants are encouraged to maintain transparent and thorough records to facilitate accurate reporting of their online income, thereby avoiding potential penalties. The CRA continues to enhance its capabilities to track and assess online business activities for appropriate tax compliance.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38nl0-a8ono.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>The following subsections address the specific inquiries regarding the GST/HST requirements, tax calculation, thresholds for taxation, the impact of the digital services tax, tax filing obligations, and regulations around print on demand services for e-commerce businesses operating in Canada.\n<h3 id=\"what-are-the-gst-hst-requirements-for-digital-sales-in-canada-\">What are the GST/HST requirements for digital sales in Canada?</h3></p>\n<p>As of July 1, 2021, digital sales in Canada may be subject to GST/HST, regardless of whether the seller is domestic or international. Digital platform operators also need to be aware of their potential GST/HST obligations under the regulatory changes announced in the Fall Economic Statement 2020.\n<h3 id=\"how-do-i-calculate-sales-tax-for-an-online-store-in-canada-\">How do I calculate sales tax for an online store in Canada?</h3></p>\n<p>An online store in Canada must calculate sales tax based on the province or territory where the customer resides. Different rates apply across Canada, with GST being 5% and HST varying from 13% to 15% depending on the province.\n<h3 id=\"what-is-the-threshold-for-paying-taxes-on-online-sales-in-canada-\">What is the threshold for paying taxes on online sales in Canada?</h3></p>\n<p>The threshold for registering for the GST/HST in Canada is CAD $30,000 in taxable gross revenues over the last four consecutive calendar quarters. Once this threshold is crossed, e-commerce businesses must register for, collect, and remit GST/HST on online sales to Canadian customers.\n<h3 id=\"how-does-the-digital-services-tax-affect-e-commerce-businesses-in-canada-\">How does the digital services tax affect e-commerce businesses in Canada?</h3></p>\n<p>The digital services tax is proposed to target large global corporations offering digital services within Canada. Its implementation affects how multinational e-commerce businesses are taxed, ensuring they contribute a fair share under Canadian tax law.\n<h3 id=\"what-are-the-tax-filing-obligations-for-an-e-commerce-business-in-canada-\">What are the tax filing obligations for an e-commerce business in Canada?</h3></p>\n<p>E-commerce businesses with a GST/HST account must file tax returns regularly, which could be monthly, quarterly, or annually, depending on the business’s revenue and preferences. The tax return must report GST/HST collected and might include tax credits known as Input Tax Credits.\n<h3 id=\"does-print-on-demand-fall-under-different-tax-regulations-in-canada-\">Does print on demand fall under different tax regulations in Canada?</h3></p>\n<p>Print on demand products are generally treated as tangible personal property, and therefore, the same tax rules that apply to physical goods sold online are typically applicable. GST/HST should be charged based on where the product is shipped within Canada.</p>",
    "toc": [
        {
            "id": "overview-of-ecommerce-taxation-in-canada",
            "title": "Overview of Ecommerce Taxation in Canada"
        },
        {
            "id": "goods-and-services-tax-gst-in-ecommerce",
            "title": "Goods and Services Tax (GST) in Ecommerce"
        },
        {
            "id": "provincial-sales-taxes-pst-and-harmonized-sales-tax-hst-in-ecommerce",
            "title": "Provincial Sales Taxes (PST) and Harmonized Sales Tax (HST) in Ecommerce"
        },
        {
            "id": "ecommerce-tax-registration-requirements",
            "title": "Ecommerce Tax Registration Requirements"
        },
        {
            "id": "filing-ecommerce-sales-taxes-in-canada",
            "title": "Filing Ecommerce Sales Taxes in Canada"
        },
        {
            "id": "ecommerce-tax-deductions-and-credits",
            "title": "Ecommerce Tax Deductions and Credits"
        },
        {
            "id": "tax-compliance-for-international-ecommerce-sellers",
            "title": "Tax Compliance for International Ecommerce Sellers"
        },
        {
            "id": "ecommerce-platform-specific-tax-considerations",
            "title": "Ecommerce Platform-Specific Tax Considerations"
        },
        {
            "id": "audits-and-penalties-for-ecommerce-tax-non-compliance",
            "title": "Audits and Penalties for Ecommerce Tax Non-Compliance"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "December 1, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax",
        "E Commerce",
        "Sales Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/logo_shopify.png"
}