{
    "id": "gst-hst-on-remote-services",
    "slug": "gst-hst-on-remote-services",
    "title": "GST/HST on Remote Services: A Comprehensive Guide for Compliance",
    "excerpt": "The digital economy has transformed the way businesses operate, leading to changes in taxation rules and regulations. One such example is the impositi...",
    "content": "<p>The digital economy has transformed the way businesses operate, leading to changes in taxation rules and regulations. One such example is the imposition of goods and services tax/harmonized sales tax (GST/HST) on remote services. As of July 1, 2021, new rules have been implemented in Canada that affect digital economy businesses, including digital platform operators. These rules address potential GST/HST obligations, helping to ensure a level playing ground for both domestic and international service providers.</p>\n<p>Remote services encompass a variety of activities, such as consulting services, digital products, and online platform services. Nonresident and remote vendors of these services and digital products are now required to charge, collect, and <a href=\"/blog/how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide\">remit GST/HST</a> on sales made to consumers located in Canada. These changes are designed to create a fairer tax system for all businesses and promote compliance among digital service providers.</p>\n<p>Understanding GST/HST on remote services is essential for businesses operating within the digital economy. Adhering to these tax regulations establishes transparency and contributes toward maintaining a healthy business environment. As such, it is crucial for both local and international service providers to stay up-to-date with the latest tax policies and adjust their operations accordingly.\n<h2 id=\"overview-of-gst-hst-on-remote-services\">Overview of GST/HST on Remote Services</h2></p>\n<p>In recent years, the digital economy has grown rapidly, and with it, the need to regulate and impose taxes on remote services. The Goods and Services Tax/Harmonized Sales Tax (GST/HST) is designed to ensure a fair and competitive environment for businesses involved in the supply of digital products and services, both in Canada and abroad.</p>\n<p><strong><a href=\"/blog/when-and-how-do-i-register-for-gst\">GST/HST registration</a>:</strong> Generally, businesses providing remote services need to register for GST/HST if their worldwide taxable revenue exceeds CAD 30,000 in a year. This threshold applies to both domestic and international businesses. Once registered, businesses are required to charge and collect tax on taxable supplies they make in Canada.</p>\n<p><strong>Place of supply:</strong> When determining whether a remote service is subject to GST/HST, it's essential to understand the concept of the place of supply. In Canada, the place of supply for services is considered the location where the client is based, regardless of where the work is performed.</p>\n<p><strong>Tax rates:</strong> The <a href=\"/blog\">GST/HST rates</a> vary depending on the province or territory where the client is located. In some provinces, only the federal GST rate applies (currently 5%), while others follow a combined GST/HST rate or a separate PST rate. The combined rates range from 11% to 15%, depending on the province. Please note that provincial sales tax rates may no apply on all good and services so it is important to consult with a professional to make that determination.</p>\n<p>Here are the current GST/HST rates for each Canadian province and territory:</p>\n<p>| Province/Territory | GST/HST Rate |\n| --- | --- |\n| Alberta | 5% |\n| British Columbia | 5% + PST |\n| Manitoba | 5% + RST |\n| New Brunswick | 15% |\n| Newfoundland and Labrador | 15% |\n| Northwest Territories | 5% |\n| Nova Scotia | 15% |\n| Nunavut | 5% |\n| Ontario | 13% |\n| Prince Edward Island (PEI) | 15% |\n| Quebec | 5% + QST |\n| Saskatchewan | 5% + PST |\n| Yukon | 5% |</p>\n<p>In conclusion, the GST/HST applies to a wide range of remote services, ensuring that suppliers in the digital economy contribute their fair share to the Canadian tax system. Businesses operating remotely or e-commerce companies should familiarize themselves with the relevant <a href=\"/tax-compliance/\">tax regulations and obligations</a> as they pertain to their specific industry and clientele.\n<h2 id=\"legislation-and-compliance\">Legislation and Compliance</h2></p>\n<h3 id=\"key-regulations\">Key Regulations</h3>\n<p>Starting from July 1, 2021, new rules for digital economy businesses have come into effect in Canada. With these changes, nonresident and remote vendors of digital products and services are required to charge, collect, and remit <em>Goods and Services Tax</em> (GST) and <em>Harmonized Sales Tax</em> (HST) on sales to consumers located in Canada.</p>\n<p>The Canadian government announced these measures in its Fall Economic Statement 2020 and subsequently made revisions on April 19, 2021. The <strong>Canada Revenue Agency</strong> (CRA) will work closely with businesses and platform operators to help them meet their obligations.</p>\n<p>A brief overview of these obligations includes:\n1. Charging and collecting GST/HST on taxable supplies made in Canada\n2. <a href=\"/blog/when-and-how-do-i-register-for-gst\">Registering for GST/HST</a> when required\n3. Reporting and remitting collected taxes to the CRA</p>\n<p>These amendments to the <em>Excise Tax Act</em> (ETA) aim to level the playing field between Canadian and international sellers of digital products and services.\n<h3 id=\"international-agreements\">International Agreements</h3></p>\n<p>Canada's approach to taxing remote sales of digital products and services is in line with global trends and international tax agreements. Similar taxation models have been adopted by various countries, including the European Union and Australia. Implementing such regulations helps countries protect their tax base, especially in the rapidly growing digital economy sector.</p>\n<p>To ensure a smooth and seamless operation, the CRA may establish agreements with tax authorities in other countries or regions. These arrangements could involve sharing information or offering assistance to businesses for compliance purposes. By following international best practices and collaborating with other tax administrations, Canada endeavors to maintain a transparent and fair tax system.</p>\n<p>Through adherence to key regulations and international agreements, businesses operating in the digital economy can ensure they maintain compliance with Canada's GST/HST tax laws, contributing to a thriving and equitable marketplace.\n<h2 id=\"registration-requirements\">Registration Requirements</h2></p>\n<h3 id=\"mandatory-registration\">Mandatory Registration</h3>\n<p>As of July 1, 2021, new GST/HST rules for remote sellers of services and digital products have been implemented. Non-resident suppliers who make supplies of digital products or services to specified Canadian recipients are required to register for the GST/HST, if they meet certain criteria.</p>\n<p>The criteria for mandatory registration are as follows:\n<em> The supplier is a </em>specified non-resident supplier*.\n<em> The supplier's </em>threshold amount* of applicable revenues exceeds <strong>$30,000 CAD</strong> over any 12-month period beginning on or after July 1, 2021.</p>\n<p>In addition to non-resident suppliers, the same rules apply to non-resident <em>distribution platform operators</em> that facilitate the supply of services or digital products to Canadian recipients.\n<h3 id=\"voluntary-registration\">Voluntary Registration</h3></p>\n<p>Remote sellers of services and digital products who do not meet the criteria for mandatory registration may still choose to register for GST/HST voluntarily, if they:\n<em> Make taxable supplies and are engaged in a </em>commercial activity*.\n<li>Make a taxable supply in Canada in the course of a business carried on in Canada.</li>\n<li>Provide digital products and services to Canadian customers, and the supplier can reasonably expect the threshold amount of $30,000 CAD to be exceeded within the next 12 months.</li></p>\n<p>The benefits of voluntary registration include:\n<em> The ability to recover </em>input tax credits* (ITCs) related to the GST/HST paid on business expenses.\n<li>Ensuring compliance with Canadian tax laws to avoid potential penalties.</li></p>\n<p>It's important for remote sellers of services and digital products to understand the new GST/HST rules and determine if they need to register or voluntarily register for GST/HST. Proper registration and collection of taxes can help businesses avoid legal issues, maintain a positive reputation with customers, and support Canada's tax infrastructure.\n<h2 id=\"calculating-gst-hst\">Calculating GST/HST</h2></p>\n<h3 id=\"determination-of-taxable-services\">Determination of Taxable Services</h3>\n<p>To calculate GST/HST on remote services, it's important to first determine whether the service provided is taxable. Some services may be exempt or zero-rated under specific circumstances. To ensure accurate calculation, refer to the Canada Revenue Agency (CRA) guidelines on exempt and taxable services.\n<h3 id=\"place-of-supply-rules\">Place of Supply Rules</h3></p>\n<p>The place of supply is a crucial factor in determining the need to collect GST/HST. For remote services, the CRA considers the place of supply to be the client's location, even if the services are performed remotely. It's essential to charge the appropriate rate based on the client's province:\n<li><strong>Alberta</strong>: 5% (GST only)</li>\n<li><strong>British Columbia</strong>: 5% (GST only, PST may apply depending on services provided)</li>\n<li><strong>Manitoba</strong>: 5% (GST only, RST may apply depending on services provided))</li>\n<li><strong>New Brunswick</strong>: 15% (HST)</li>\n<li><strong>Newfoundland and Labrador</strong>: 15% (HST)</li>\n<li><strong>Northwest Territories</strong>: 5% (GST only)</li>\n<li><strong>Nova Scotia</strong>: 15% (HST)</li>\n<li><strong>Nunavut</strong>: 5% (GST only)</li>\n<li><strong>Ontario</strong>: 13% (HST)</li>\n<li><strong>Prince Edward Island</strong>: 15% (HST)</li>\n<li><strong>Quebec</strong>: 5% (GST, also need to register for QST separately)</li>\n<li><strong>Saskatchewan</strong>: 5% (GST only, PST may apply depending on services provided))</li>\n<li><strong>Yukon</strong>: 5% (GST only)</li></p>\n<p>Keep in mind that these rates may change, so always verify the current rates before invoicing your client.\n<h3 id=\"exchange-rate-application\">Exchange Rate Application</h3></p>\n<p>For remote services provided to Canadian clients by non-Canadian service providers, GST/HST must be calculated based on the client's location. When invoicing in a currency other than Canadian dollars, it's vital to convert the amount using the Bank of Canada's exchange rate on the day the service is invoiced. This ensures accurate and consistent exchange rates.</p>\n<p>In summary, calculating GST/HST on remote services requires determining the taxability of the service, applying the correct place of supply rules, and using the appropriate exchange rate when invoicing in different currencies.\n<h2 id=\"filing-and-remittances\">Filing and Remittances</h2></p>\n<h3 id=\"filing-gst-hst-returns\">Filing GST/HST Returns</h3>\n<p>Businesses required to charge and collect GST/HST on remote services must file their GST/HST returns regularly. They can be submitted through various methods such as online filing, TELEFILE, or on paper. Electronic filing is preferred due to its ease, speed, and efficiency. It is essential to avoid common mistakes and ensure accurate information is provided to avoid penalties or delays in processing.\n<h3 id=\"remittance-methods\">Remittance Methods</h3></p>\n<p>Several remittance methods exist for the submission of GST/HST payments. They include:\n<li><strong><a href=\"https://www.canada.ca/en/revenue-agency/services/e-services/payment-save-time-pay-online.html\">My Payment</a>:</strong> This allows businesses to make payments through Interac or Visa/Mastercard Debit cards through the CRA website.</li>\n<li><strong>Financial Institutions:</strong> Participating Canadian financial institutions can process the payment of net taxes owed electronically.</li></p>\n<h3 id=\"deadlines-and-penalties\">Deadlines and Penalties</h3>\n<p>Adhering to the proper <a href=\"/blog/tax-filing-deadlines-in-canada-a-comprehensive-guide\">filing deadlines</a> is crucial to ensure compliance and avoid penalties. The deadlines for filing GST/HST returns vary depending on the reporting period (monthly, quarterly, or annually) assigned by the Canada Revenue Agency (CRA) and/or chosen by the taxpayer. Regularly monitoring and adhering to these deadlines helps maintain good standing with the CRA.</p>\n<p>Failure to file on time or submitting inaccurate information may result in penalties. These penalties are based on the severity and duration of the infraction. It is essential for businesses to regularly review their GST/HST obligations and ensure they are up-to-date on filing requirements and remittance methods to maintain compliance.\n<h2 id=\"input-tax-credits\">Input Tax Credits</h2></p>\n<p><strong>Input Tax Credits (ITCs)</strong> are an essential aspect of the GST/HST system for businesses. They allow businesses to recover GST/HST paid or payable on purchases and expenses related to their commercial activities. When filing a GST/HST return, ITCs are claimed in line 108 for electronic filing and line 106 for paper filing.</p>\n<p>Remote sellers of services and digital products must also navigate GST/HST regulations. The Fall Economic Statement introduced by the Canadian government on November 30, 2020, aims to increase fairness and competitiveness between Canadian-based suppliers of digital property and services and similar suppliers located outside of Canada. This update requires remote sellers to pay close attention to input tax credits.</p>\n<p>To utilize ITCs effectively, businesses should follow these steps:\n1. <strong>Determine the types of purchases and expenses</strong>: Identify the items and services that have a direct link to your commercial activities and are eligible for ITCs.\n2. <strong>Determine the percentage of use in commercial activities</strong>: Calculate the portion of the items and services that are directly related to your business operations, as the ITC claim should only cover those expenses.\n3. <strong>Determine the ITC eligibility percentage</strong>: Figure out the percentage of your eligible expenses that can be claimed as ITCs based on your usage and the specific GST/HST rates.\n4. <strong>Choose a method to calculate ITCs</strong>: Select the appropriate calculation method that best suits your accounting system and business type.</p>\n<p>In summary, Input Tax Credits help businesses in managing the GST/HST related to their commercial activities, while the Canadian government's recent tax changes ensure a level playing field for remote sellers of services and digital products. Ensuring that you follow the steps in determining your ITCs will help your business stay compliant with the GST/HST system and maximize its benefit from tax credits.\n<h2 id=\"digital-platform-operator-responsibilities\">Digital Platform Operator Responsibilities</h2></p>\n<h3 id=\"collection-of-gst-hst\">Collection of GST/HST</h3>\n<p>Digital platform operators are responsible for charging and collecting GST/HST on supplies of digital products or services made through their platforms to specified Canadian recipients. If a digital platform operator is registered for GST/HST under the simplified GST/HST regime or the normal GST/HST registration regime, they must adhere to these obligations. It is important to note that remote sellers of services or digital products, as well as distribution platform operators, are not required to charge and collect GST/HST on tangible personal property (i.e., goods) sold by the supplier, unless they are subject to other existing rules or proposals.\n<h3 id=\"reporting-obligations\">Reporting Obligations</h3></p>\n<p>The Government of Canada announced in the April 19, 2021 Federal Budget that the Canada Revenue Agency (CRA) will work closely with businesses and platform operators to assist them in meeting their obligations. Digital platform operators should be aware of the new reporting rules and ensure they are in compliance to avoid any penalties or fines.\n<h2 id=\"business-considerations\">Business Considerations</h2></p>\n<h3 id=\"pricing-strategy\">Pricing Strategy</h3>\n<p>When incorporating GST/HST into the pricing strategy for remote services, businesses must consider the added tax implications for their customers. As of July 1, 2021, <a href=\"/blog/non-resident-corporation-doing-business-in-canada-canadian-subsidiary-corporation-vs-branch-tax\">nonresident and remote vendors</a> of digital products and services are required to charge, collect and remit GST/HST on sales to consumers located in Canada. This change may affect companies' pricing strategies, depending on whether they decide to include GST/HST in their listed prices or add it as an additional charge during checkout.</p>\n<p>It can also be helpful for businesses to identify the type of customers they serve. Generally, remote services provided to clients outside of Canada are not subject to GST/HST. Understanding their customer base will help businesses know when to apply the tax and how it may influence pricing decisions.\n<h3 id=\"impact-on-digital-economy\">Impact on Digital Economy</h3></p>\n<p>The new GST/HST rules have a considerable influence on the digital economy. Digital platform operators and online businesses now need to comply with updated regulations. Some major effects of these rules include:\n<li><strong>Increased compliance:</strong> Digital economy businesses must be diligent in registering, collecting, and remitting the appropriate GST/HST amounts, ensuring to follow Canadian tax regulations.</li>\n<li><strong>Taxation of different supplies:</strong> Businesses must stay informed on which types of supplies are taxable. Generally, digital products, online services, and digital software subscriptions would require applying GST/HST on taxable transactions.</li>\n<li><strong>Potential rate fluctuation:</strong> The GST/HST rate may vary based on the province where the consumer is located. As a result, companies must be aware of provincial tax rates while pricing products and services for customers from different parts of Canada.</li></p>\n<p>In summary, with the introduction of the new GST/HST rules on remote services and digital products, businesses must adapt their pricing strategies and stay informed about tax regulations. Compliance with these updated rules is essential to maintaining a successful presence in Canada's evolving digital economy.\n<h2 id=\"consumer-implications\">Consumer Implications</h2></p>\n<p>With the implementation of the new GST/HST rules on remote services and digital products, consumers in Canada are impacted when they purchase these products and services from non-resident suppliers. This section will highlight the key implications for consumers.</p>\n<p>Firstly, an important change for consumers is the <strong>extension of tax obligations</strong> to non-resident suppliers. Previously, remote sellers of digital products and services may not have had to charge GST/HST. However, as per the new rules that came into effect on July 1, 2021, nonresident remote suppliers of digital products and services must charge, collect and remit GST/HST on sales to Canadian consumers.</p>\n<p>For consumers, this means that digital products like streaming services, e-books, or mobile apps, as well as remote services such as online courses or consulting, will now attract GST/HST. This change is significant because, in many cases, it will lead to a <strong>price increase</strong> for consumers when purchasing these products or services.</p>\n<p>Another aspect of this new rule is the <strong>tax registration threshold for nonresident sellers</strong>. As was mentioned, nonresident sellers of digital services and intangibles must register for GST/HST if their sales to unregistered Canadian purchasers exceed or are expected to exceed CAD 30,000 in a 12-month period.</p>\n<p>The relevance of this threshold to consumers is that it helps ensure that small-scale remote sellers will not be disproportionately impacted by these rules. Consequently, it may also affect consumers if they primarily purchase digital services or products from smaller digital vendors whose sales fall below this registration threshold.</p>\n<p>In summary, consumers should be mindful of the GST/HST implications when purchasing digital services and products from non-resident suppliers. The introduction of these new rules, while helping to level the playing field and ensure tax fairness, will likely result in price increases for some digital products and services.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<h3 id=\"is-it-necessary-for-businesses-to-apply-gst-hst-on-digital-products-sold-to-customers-in-canada-\">Is it necessary for businesses to apply GST/HST on digital products sold to customers in Canada?</h3>\n<p>Yes, businesses are required to charge and collect GST/HST on taxable supplies, including digital products, when the customer is located in Canada. The tax rate depends on the province where the customer is situated.\n<h3 id=\"which-remote-services-are-subject-to-gst-hst-exemptions-in-canada-\">Which remote services are subject to GST/HST exemptions in Canada?</h3></p>\n<p>Some remote services may be exempt from GST/HST, depending on the type of service provided. For example, certain educational and training services, health and medical services, and financial services can be exempt. To determine whether a service is exempt, consult the specific GST/HST guidelines for the service in question.\n<h3 id=\"should-canadian-businesses-charge-hst-to-international-clients-outside-of-canada-\">Should Canadian businesses charge HST to international clients outside of Canada?</h3></p>\n<p>No, generally and barring some exclusions, Canadian businesses do not charge HST on remote services provided to international clients outside of Canada. The place of supply for services is considered to be the location of the client, even if the work is performed remotely within Canada. In most situations, exported services would be considered to be zero-rated (or taxable at 0%).\n<h3 id=\"how-does-gst-hst-apply-to-software-sold-by-canadian-businesses-to-both-domestic-and-foreign-customers-\">How does GST/HST apply to software sold by Canadian businesses to both domestic and foreign customers?</h3></p>\n<p>For domestic customers, Canadian businesses must charge and collect GST/HST on the sale of software, based on the customer's location. For foreign customers, software sales are generally considered as exports and are not subject to GST/HST. However, businesses should consult the specific export rules and regulations in case of any exceptions.\n<h3 id=\"are-consulting-services-provided-remotely-by-canadian-companies-to-foreign-entities-gst-hst-taxable-\">Are consulting services provided remotely by Canadian companies to foreign entities GST/HST taxable?</h3></p>\n<p>No, consulting services provided remotely by Canadian companies to foreign entities are generally not subject to GST/HST, as the place of supply is considered to be the location of the foreign entity.</p>",
    "toc": [
        {
            "id": "overview-of-gst-hst-on-remote-services",
            "title": "Overview of GST/HST on Remote Services"
        },
        {
            "id": "legislation-and-compliance",
            "title": "Legislation and Compliance"
        },
        {
            "id": "registration-requirements",
            "title": "Registration Requirements"
        },
        {
            "id": "calculating-gst-hst",
            "title": "Calculating GST/HST"
        },
        {
            "id": "filing-and-remittances",
            "title": "Filing and Remittances"
        },
        {
            "id": "input-tax-credits",
            "title": "Input Tax Credits"
        },
        {
            "id": "digital-platform-operator-responsibilities",
            "title": "Digital Platform Operator Responsibilities"
        },
        {
            "id": "business-considerations",
            "title": "Business Considerations"
        },
        {
            "id": "consumer-implications",
            "title": "Consumer Implications"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "December 23, 2023",
    "readTime": "5 min read",
    "tags": [
        "Sales Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_startup.png"
}