{
    "id": "how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide",
    "slug": "how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide",
    "title": "How do I file a GST/HST return in Canada: A Step-by-Step Guide",
    "excerpt": "Filing a GST/HST return in Canada is an essential process for many businesses and individuals engaged in commercial activities within the country. If ...",
    "content": "<p>Filing a GST/HST return in Canada is an essential process for many businesses and individuals engaged in commercial activities within the country. If you provide taxable goods and services, it's likely you're required to collect and remit the Goods and Services Tax (GST) or the Harmonized Sales Tax (HST) to the <a href=\"https://www.canada.ca/en/revenue-agency.html\">Canada Revenue Agency</a> (CRA). Knowing your filing obligations, including deadlines and methods available, is crucial to remain in compliance with tax laws.</p>\n<p>The process for filing a GST/HST return can be completed electronically, through TELEFILE, or on paper. You must first determine if you are obligated to file online, as this may vary depending on factors such as your revenue or the nature of your business. The CRA's online services offer several electronic filing methods, and it's important to choose the one that aligns with your business needs.</p>\n<p>To minimize errors and ensure that your return is processed smoothly, familiarize yourself with common mistakes to avoid and the correct way to report your sales and input tax credits. For certain builders and public service bodies, specific filing methods are required and particular rebates and forms apply. Staying informed on these requirements will help you handle the GST/HST filing process with confidence.\n<h2 id=\"understanding-gst-hst-in-canada\">Understanding GST/HST in Canada</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-22-13.53.09-A-symbolic-illustration-depicting-the-concept-of-additional-administrative-burden-without-text.-The-image-shows-a-person-of-Hispanic-descent-in-a-sma.png\" alt=\"\" class=\"img-fluid\" />\n<p>Goods and Services Tax (GST) and Harmonized Sales Tax (HST) are forms of value-added taxes levied by the Canadian government on the sale of goods and services within Canada. When you operate a business in Canada, understanding how GST/HST works is crucial for compliance with tax laws.\n<li><strong>GST</strong> is a federal tax charged at a rate of 5% across Canada on most goods and services.</li>\n<li><strong>HST</strong> combines the GST with <a href=\"/blog/current-gst-hst-rate-canada-and-by-provinces\">provincial sales taxes</a> in certain provinces, resulting in a single tax rate that varies from 13% to 15%.</li></p>\n<p>Here's a breakdown of where HST applies and the combined rates:</p>\n<p>| Province | Combined HST Rate |\n| --- | --- |\n| Ontario | 13% |\n| Nova Scotia | 15% |\n| New Brunswick | 15% |\n| Newfoundland | 15% |\n| Prince Edward Island | 15% |\n| Other Provinces | 5% (GST only) |</p>\n<p>If your business operates in a province that collects HST, you charge the HST rate relevant to that province. In provinces and territories that do not participate in the HST program, you would charge GST alone, without additional provincial sales taxes.</p>\n<p>You are required to file a GST/HST return periodically if you own a business that is registered to collect GST/HST. The return summarizes the total sales and calculates net tax, which is the difference between the GST/HST collected from customers and the GST/HST paid on business purchases. Your filing frequency can be monthly, quarterly, or annually, depending on your business's sales and preferences.\n<h2 id=\"eligibility-for-filing-gst-hst-returns\">Eligibility for Filing GST/HST Returns</h2></p>\n<img src=\"https://koala.sh/api/image/v2-340y7-ieu9j.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>To be eligible for filing a GST/HST return in Canada, you must be a business owner or a representative of a business that is registered for the GST/HST. Here is a straightforward rundown of what makes you eligible:\n<li><strong>Business Registration</strong>: Once you have registered for a GST/HST account with the Canada Revenue Agency (CRA), you are obligated to file GST/HST returns regularly.</li>\n<li><strong>Reporting Period</strong>: Your eligibility to file also depends on the established reporting period for your business, which the CRA determines based on your annual taxable revenues.</li></p>\n<p>Ensure you adhere to the following criteria:\n<li>Even if you had <strong>no business transactions</strong> or no net tax to remit within a filing period, you are still required to file a return.</li>\n<li>In circumstances where your due date falls on a weekend or public holiday, the CRA deems your payment on time if it is received on the next business day.</li></p>\n<p>A business might need to file GST/HST returns monthly, quarterly, or annually, and these timelines are crucial for maintaining compliance with the CRA. Keep track of your specific filing deadline to avoid penalties.</p>\n<p>Remember, whether a sole proprietorship, partnership, or corporation, if your business is registered for the GST/HST, you must file a return per your determined schedule. Being proactive and understanding your obligations can streamline the filing process and keep your business in good standing with the CRA.\n<h2 id=\"the-gst-hst-filing-process\">The GST/HST Filing Process</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL%C2%B7E-2023-11-22-15.39.50-A-conceptual-illustration-showing-multiple-steps-to-achieve-a-goal-without-any-text.-The-image-features-a-series-of-ascending-3D-rendered-steps-lead.png\" alt=\"\" class=\"img-fluid\" />\n<p>The filing of GST/HST returns in Canada is a straightforward procedure if you understand the steps and records required. Follow a structured approach to make the process efficient and compliant with the Canada Revenue Agency (CRA) guidelines.\n<h3 id=\"registering-for-a-gst-hst-account\">Registering for a GST/HST Account</h3></p>\n<p>Before you file a GST/HST return, you must register for a GST/HST account with the CRA if your business meets the <a href=\"https://www.canada.ca/en/revenue-agency/services/tax/businesses/topics/gst-hst-businesses/when-register-charge.html\"><strong>mandatory registration requirements</strong></a>. If your taxable revenues exceed $30,000 in a single calendar quarter or over four consecutive calendar quarters, you are required to register.\n<h3 id=\"determining-the-reporting-period\">Determining the Reporting Period</h3></p>\n<p>Your reporting period dictates how often you need to file your GST/HST returns. It can be monthly, quarterly, or annually, depending on your business’s annual revenue. <strong>Determine your reporting period</strong> through the CRA's My Business Account or review the CRA correspondence that indicates your assigned reporting periods.\n<h3 id=\"collecting-the-necessary-financial-information\">Collecting the Necessary Financial Information</h3></p>\n<p>Compile all relevant financial transactions, including total sales and other revenues. Ensure you have documentation for all taxable sales, <strong>GST/HST collected</strong>, and <strong>Input Tax Credits (ITCs)</strong>, which are credits for the GST/HST paid on business purchases.</p>\n<p>Using a cloud accounting software like <a href=\"http://xero.com\">Xero</a> will make the process of tracking GST/HST collected and ITCs paid much easier.\n<h3 id=\"calculating-net-tax\">Calculating Net Tax</h3></p>\n<p>The net tax calculation is essential for filing your return correctly. Calculate the <strong>net tax</strong> using:\n<li>GST/HST collected from customers.</li>\n<li>Minus the GST/HST paid on business purchases (ITCs).</li></p>\n<p>Your net tax could result in either an amount owing to the CRA or a refund, depending on these values. Follow the lines on the return, lines 103 to 115, to calculate accurately.</p>\n<p>Always consult with a professional or reach out to the CRA directly if you have specific questions or unique circumstances related to your GST/HST returns.\n<h2 id=\"completing-the-gst-hst-return\">Completing the GST/HST Return</h2></p>\n<img src=\"https://koala.sh/api/image/v2-340yt-uxodm.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Filing a GST/HST return in Canada requires precision and attention to detail. You'll need to accurately report your total sales, input tax credits, and the resulting balance, whether you owe money or are due for a refund.\n<h3 id=\"filling-out-the-gst-hst-return-form\">Filling Out the GST/HST Return Form</h3></p>\n<p>Begin by entering <strong>your personal business information</strong>. On <strong>line 101</strong>, report <strong>your total sales and other revenues.</strong> The form will guide you through a series of calculations to determine your net tax, including the amounts for lines <strong>103 to 109</strong>. Make sure to follow the form instructions carefully to avoid errors.\n<h3 id=\"claiming-input-tax-credits\">Claiming Input Tax Credits</h3></p>\n<p>Input Tax Credits (ITCs) are credits for the GST/HST you paid on business-related purchases and expenses. On the return form, enter <strong>other credits</strong> on <strong>lines 110, 111, 112, and 113A</strong>. These will offset against the GST/HST you owe from your sales.\n<h3 id=\"calculating-the-amount-owing-or-refund\">Calculating the Amount Owing or Refund</h3></p>\n<p>Calculate the difference between the GST/HST collected and the ITCs you are claiming. The result will be either the amount you owe (<strong>line 115</strong>) or the amount of your refund (<strong>line 114</strong>). Make sure to double-check your calculations to ensure accuracy before submitting your return.\n<h2 id=\"gst-hst-return-submission-methods\">GST/HST Return Submission Methods</h2></p>\n<img src=\"https://koala.sh/api/image/v2-340zc-4f0rf.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>When filing your GST/HST return in Canada, choose the most convenient method for your needs from electronic submission, mailing, or in-person.\n<h3 id=\"electronic-submission\">Electronic Submission</h3></p>\n<p>You can file your GST/HST return online through the <strong>Canada Revenue Agency (CRA)</strong>'s electronic services. Options include <strong>GST/HST NETFILE</strong> and <strong>My Business Account</strong>. <strong>NETFILE</strong> is accessible to most businesses and allows for fast processing of returns, especially if no amounts are due. If filing a nil return, you can quickly confirm all amounts as $0.00 and submit.\n<h3 id=\"submitting-via-mail\">Submitting via Mail</h3></p>\n<p>If you prefer to file your return on paper, you have the option to mail your completed GST/HST return to the CRA. Ensure that all information is accurate to avoid delays. You'll need to obtain the necessary forms either online or from a CRA service center.\n<h3 id=\"in-person-submission\">In-Person Submission</h3></p>\n<p>For those who wish to file in person, you can bring your completed GST/HST return to a designated <strong>Service Canada location</strong>. This option may be suitable if you require assistance or lack access to online services. Ensure the return is complete to prevent return trips.\n<h2 id=\"deadlines-and-due-dates-for-gst-hst-returns\">Deadlines and Due Dates for GST/HST Returns</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-24-11.25.58-A-minimalistic-depiction-of-deadlines-in-an-office-setting.-The-image-features-a-diverse-group-of-office-workers-including-a-Caucasian-woman-a-Hispa.png\" alt=\"\" class=\"img-fluid\" />\n<p>Your <a href=\"/blog/tax-filing-deadlines-in-canada-a-comprehensive-guide\">GST/HST return deadlines</a> depend on your reporting period. If you're a monthly or quarterly filer, <strong>GST/HST returns</strong> are due one month after the end of the reporting period. For example, if your reporting period ends on March 31, your return and payment are due by April 30.</p>\n<p>For annual filers, the deadline to file and make payments can vary. If your fiscal year corresponds with the calendar year, ending on December 31, your GST/HST return and payment are due by June 15 of the following year. However, if your fiscal year end is different, your return is due by <em>three months</em> after the end of your fiscal year.</p>\n<p>Here's a quick reference:</p>\n<p>| Reporting Period | Deadline for Filing & Payment |\n| --- | --- |\n| Monthly | 1 month after reporting period |\n| Quarterly | 1 month after reporting period |\n| Annual | 3 months after fiscal year-end |</p>\n<p>In addition, if you owe GST/HST, remember that your payment deadline might differ from the filing deadline. Generally, payments are to be made at the same time as the returns are due. Keep in mind the <strong>consequences</strong> for late filing or payment can include penalties and interest charges. It's crucial to stay current with these obligations to avoid any unnecessary fees.</p>\n<p>Stay aware of the most recent updates on the Canada Revenue Agency's (CRA) website, as deadlines and policies might undergo changes.\n<h2 id=\"payment-options-and-procedures\">Payment Options and Procedures</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL%C2%B7E-2023-11-22-15.35.18-An-illustration-showing-someone-paying-in-a-timely-manner.-The-scene-features-a-young-adult-Asian-female-with-long-black-hair-smiling-as-she-hands-ov.png\" alt=\"\" class=\"img-fluid\" />\n<p>When you're ready to file your GST/HST return in Canada, you have multiple payment avenues at your disposal. Each method offers a distinct process tailored to meet various taxpayer needs.\n<h3 id=\"online-banking\">Online Banking</h3></p>\n<p>You can remit your GST/HST payment using your financial institution's online banking service. To do this, add the Canada Revenue Agency (CRA) as a payee in your online banking profile. <strong>Ensure to use your Business Number as your account number</strong> to facilitate the correct processing of your payment.\n<h3 id=\"telefile-system\">Telefile System</h3></p>\n<p>The Telefile system allows you to pay your GST/HST by phone. You should call the CRA's Telefile number and follow the automated prompts. Remember to <strong>have your Business Number and access code</strong> handy when you use this service.\n<h3 id=\"through-financial-institutions\">Through Financial Institutions</h3></p>\n<p>You have the option to pay your GST/HST directly at a participating financial institution. For this, you would typically complete a remittance voucher, which is accessible through the CRA website or by request, and present it with your payment. <strong>Payments of $50,000 or more must be paid electronically</strong> or through these institutions.\n<h2 id=\"record-keeping-for-gst-hst\">Record Keeping for GST/HST</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-24-11.28.33-An-image-representing-good-record-keeping-without-text-or-numbers-showing-a-series-of-color-coded-document-folders-on-a-neat-organized-desk.-Each-fo.png\" alt=\"\" class=\"img-fluid\" />\n<p>When handling GST/HST for your business in Canada, maintaining accurate records is essential. <strong>You must <a href=\"/#services\">keep all records</a> related to your sales, purchases, and other business operations</strong>. These records include but are not limited to:\n<li>Invoices</li>\n<li>Receipts</li>\n<li>Contracts</li>\n<li>Bank Statements</li></p>\n<p>Your records must be detailed enough to <strong>support the GST/HST you report and claim</strong>.</p>\n<p><strong>Retention Period:</strong> You are typically required to retain your records for <strong>six years</strong> from the end of the last fiscal year they pertain to. This period may be extended if you file an objection or appeal.</p>\n<p><strong>Format of Records:</strong> Your records can be kept in:\n<li><strong>Paper format</strong></li>\n<li><strong>Electronic format</strong></li></p>\n<p>Ensure that electronic records are <strong>readable, reliable, and easily accessible</strong> for potential review by Canada Revenue Agency (CRA) officials.</p>\n<p><strong>Accessibility:</strong> Be prepared to <strong>present your records to CRA officials</strong> upon request. If records are not adequately maintained or are inaccessible, it could lead to reassessments or penalties.</p>\n<p><strong>When Records Can Be Discarded:</strong> Before discarding any records early, you must first <strong>obtain written permission from the CRA</strong>. Without this permission, keep all records for the required retention period.</p>\n<p><strong>Tips for Record Keeping:</strong>\n<li>Regularly update and review your records.</li>\n<li>Store records in a secure, organized manner.</li>\n<li>Consider digitizing paper records for enhanced security and accessibility.</li></p>\n<p>Remember, thorough and precise record keeping is not just a regulatory requirement, but it also provides clarity on your business’s financial transactions and tax obligations.\n<h2 id=\"handling-audits-and-compliance\">Handling Audits and Compliance</h2></p>\n<img src=\"https://koala.sh/api/image/v2-34115-sc2oi.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>When dealing with GST/HST audits in Canada, it's crucial to be thorough and proactive. If you receive notice of an audit, you <a href=\"/blog/how-do-you-deal-with-a-cra-audit\">should prepare</a> by organizing your business records, including invoices, receipts, and past returns.</p>\n<p><strong>Key Steps for Preparing for an Audit:</strong>\n<li><strong>Review Your Returns</strong>: Prior to the audit, revisit the GST/HST returns you've filed to ensure they are complete and accurate.</li>\n<li><strong>Organize Documentation</strong>: Assemble all relevant financial records that support the GST/HST you’ve collected and the input tax credits you’ve claimed.</li>\n<em> <strong>Know Your Rights</strong>: Understand your rights and obligations under the </em>Taxpayer Bill of Rights*.</p>\n<p>In the event of a reassessment, you have the right to <strong>file an <a href=\"/blog/notice-of-objection-cra\">objection</a></strong>. The timeframe for raising an objection with the Canada Revenue Agency (CRA) is typically:</p>\n<p>| Action | Timeframe |\n| --- | --- |\n| <strong>File an Objection</strong> | Within 90 days after the reassessment notice. |</p>\n<p>During an audit, it's beneficial to:\n<li>Be cooperative and transparent with the auditor.</li>\n<li>Provide clear explanations for transactions and bookkeeping practices.</li>\n<li>Address any discrepancies the auditor may find.</li></p>\n<p>Remember that staying compliant involves:\n<li>Timely filing of returns.</li>\n<li>Accurate calculation of GST/HST.</li>\n<li>Proper documentation of all business transactions.</li></p>\n<p>By following these guidelines, you can manage audits effectively and minimize the likelihood of compliance issues.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-24-11.33.41-An-image-designed-for-a-Frequently-Asked-Questions-FAQ-section-of-a-blog.-The-illustration-shows-a-large-stylized-question-mark-in-the-center-surr.png\" alt=\"\" class=\"img-fluid\" />\n<p>When filing your GST/HST return in Canada, precise information is essential for compliance and to ensure timely submissions.\n<h3 id=\"what-is-the-process-for-submitting-a-gst-hst-return-electronically-\">What is the process for submitting a GST/HST return electronically?</h3></p>\n<p>You can submit your GST/HST return electronically using the GST/HST NETFILE service. Access this online form through the 'Ready to file' page on the Canada Revenue Agency (CRA) website or by selecting 'File a return' in My Business Account.\n<h3 id=\"where-can-i-find-the-gst-hst-return-form-in-pdf-format-\">Where can I find the GST/HST return form in PDF format?</h3></p>\n<p>To find the GST/HST return working copy in PDF format, visit the CRA website. You can use this form to prepare your return before filing it electronically or through other means.\n<h3 id=\"what-is-the-deadline-for-filing-gst-hst-returns-in-2023-\">What is the deadline for filing GST/HST returns in 2023?</h3></p>\n<p>The filing deadline for GST/HST returns varies based on your reporting period. Generally, returns must be filed and any amount owed must be paid within one month after the end of the reporting period. It's essential to verify your specific due dates on the CRA website to avoid penalties.\n<h3 id=\"how-can-i-obtain-an-access-code-to-file-my-gst-hst-online-\">How can I obtain an access code to file my GST/HST online?</h3></p>\n<p>The four-digit access code needed to file your GST/HST return online is sent to you by mail by the CRA. If you've misplaced it, you can call their Business Enquiries line to obtain it, or you can use My Business Account where an access code is not necessary.</p>\n<p>It is also possible to change use the <a href=\"https://www.canada.ca/en/revenue-agency/services/e-services/digital-services-businesses/gst-hst-netfile/need-access-code.html\">GST/HST Access Code Online</a> system on the CRA website to change your access code to a number of your choice. This number can then be used to file all future returns. In order to change your access code, you will need the following from a previously filed return:\n<li>the reporting period and line 109 (net tax) where the amount on line 109 is not $0.00; <strong>or</strong>,</li>\n<li>the reporting period and confirmation number from a return filed using GST/HST NETFILE, TELEFILE, or Internet File Transfer.</li></p>\n<h3 id=\"what-information-do-i-need-to-complete-line-101-on-a-gst-hst-return-\">What information do I need to complete line 101 on a GST/HST return?</h3>\n<p>For line 101 on your GST/HST return, you'll need to enter your total sales and other revenues. Ensure you report all amounts in Canadian dollars and include all taxable supplies, zero-rated supplies, and exempt supplies.\n<h3 id=\"how-can-i-claim-a-refund-for-gst-hst-paid-\">How can I claim a refund for GST/HST paid?</h3></p>\n<p>If you are eligible for a GST/HST refund, report the amount on line 113C of your GST/HST return. Ensure you have accurately calculated your input tax credits and the net tax. If the input tax credits exceed the amount of GST/HST you owe, a refund may be claimed.</p>",
    "toc": [
        {
            "id": "understanding-gst-hst-in-canada",
            "title": "Understanding GST/HST in Canada"
        },
        {
            "id": "eligibility-for-filing-gst-hst-returns",
            "title": "Eligibility for Filing GST/HST Returns"
        },
        {
            "id": "the-gst-hst-filing-process",
            "title": "The GST/HST Filing Process"
        },
        {
            "id": "completing-the-gst-hst-return",
            "title": "Completing the GST/HST Return"
        },
        {
            "id": "gst-hst-return-submission-methods",
            "title": "GST/HST Return Submission Methods"
        },
        {
            "id": "deadlines-and-due-dates-for-gst-hst-returns",
            "title": "Deadlines and Due Dates for GST/HST Returns"
        },
        {
            "id": "payment-options-and-procedures",
            "title": "Payment Options and Procedures"
        },
        {
            "id": "record-keeping-for-gst-hst",
            "title": "Record Keeping for GST/HST"
        },
        {
            "id": "handling-audits-and-compliance",
            "title": "Handling Audits and Compliance"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "November 6, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax",
        "Personal Tax",
        "Sales Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_xero_mobile_v2.png"
}