{
    "id": "how-to-file-ontario-annual-return",
    "slug": "how-to-file-ontario-annual-return",
    "title": "How to File Ontario Annual Return: A Step-by-Step Guide",
    "excerpt": "Filing an annual return is a legal requirement for corporations operating in Ontario. An annual return provides critical information to the provincial...",
    "content": "<p>Filing an annual return is a legal requirement for corporations operating in Ontario. An annual return provides critical information to the provincial government regarding the current status and activities of a corporation over the past year. This document serves as an update to the public record, ensuring transparency and facilitating the ease of commerce and regulation. Ontario <a href=\"/blog/tax-benefits-and-disadvantages-of-incorporating-in-canada\">corporations</a> must file these returns under the Corporations Information Act using the online Ontario Business Registry.</p>\n<p>The process requires accuracy and attention to detail, as corporations must provide up-to-date information on directors, officers, and the registered office address. Moreover, the registry has streamlined the filing process by integrating a variety of services online, allowing businesses to manage their reporting obligations with more efficiency. Access to filing services, along with a host of other registry functions, requires a company key, which serves as a security measure and grants authority over the corporation's information.</p>\n<p>To maintain compliance, Ontario businesses must submit their annual returns within the prescribed timelines following the end of their fiscal year. This ensures that their status remains in good standing and avoids potential penalties. Managers and business owners are responsible for understanding these requirements and ensuring they are met, a task that is facilitated by the information and tools provided through the Ontario Business Registry's online platform.\n<h2 id=\"understanding-ontario-annual-returns\">Understanding Ontario Annual Returns</h2></p>\n<p>The Ontario Annual Return is a factual document that corporations must submit yearly to update their corporate records with the province of Ontario. This process verifies that a company's information remains current and compliant with legal standards.\n<h3 id=\"legal-requirements-for-ontario-businesses\">Legal Requirements for Ontario Businesses</h3></p>\n<p>Every Ontario corporation is mandated to file an Annual Return each year. This requirement is stipulated as part of maintaining the legal status of the business within the province. The Annual Return must include the following:\n<li><strong>Corporate name</strong> and <strong>Ontario Corporation Number (OCN)</strong></li>\n<li><strong>Registered office address</strong></li>\n<li>The <strong>names and addresses</strong> of the corporation's directors</li>\n<li><strong>Financial year-end date</strong></li>\n<li><strong>Type of business</strong> the corporation engages in</li>\n<li><strong>Classification</strong> and the total number of <strong>authorized shares</strong></li></p>\n<p>It is critical for businesses to adhere to this requirement, as failure to do so can lead to penalties or even dissolution of the corporation.\n<h3 id=\"annual-vs-other-periodic-filings\">Annual vs. Other Periodic Filings</h3></p>\n<p>An <strong>Annual Return</strong> differs from other periodic filings in that it is required <strong>annually</strong>, regardless of any changes in the corporate information. On the other hand, other periodic filings may be required either quarterly, semi-annually, or on an as-needed basis when specific changes occur within the corporation, such as amendments to the corporate structure or changes in the directorship. The information captured in the Annual Return is a snapshot of the corporation's status as of the last day of the corporation's tax year.\n<h2 id=\"preparing-to-file-your-return\">Preparing to File Your Return</h2></p>\n<p>Before one begins the process of filing an Ontario annual return, it is crucial to have all necessary documents prepared and a clear understanding of the business's fiscal year-end and financial statements.\n<h3 id=\"gathering-necessary-information\">Gathering Necessary Information</h3></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-30-10.13.14-An-image-of-a-person-gathering-documentation-in-an-office-setting.-The-person-is-a-Caucasian-man-standing-at-a-desk-organizing-various-papers-and-fo.png\" alt=\"\" class=\"img-fluid\" />\n<p>An individual should compile all relevant financial documents, which typically include:\n<li><strong>My Ontario Account login info</strong>: The Ontario government has changed the way you access your Service Ontario account. One-key ID has been discontinued and My Ontario Account must now be used. The steps on how to create a My Ontario Account can be found <a href=\"https://www.appmybizaccount.gov.on.ca/wps85/osb/public/POC/SOAB_Self_Help_User_Guide_EN.pdf\">here</a></li>\n<li><strong>Your Primary Business Activity</strong>: If your primary business activity has changed, it will need to updated. This can be found using the <a href=\"https://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&TVD=1181553\">NAICS code database</a> or upon completing Step 1 of the Ontario Annual Return.</li>\n<li><strong>Registered or Head Office Address</strong>: Every Ontario corporation has to have a registered or head office in Ontario. This has to be a complete address and a PO Box alone is not an acceptable address.</li>\n<li><strong>Director(s) Information</strong>: The name, email address, Canadian residency, address and elected date of each director of the corporation.</li>\n<li><strong>Officer(s) Information</strong>: The name, position, email address, address and appointed date of each officer of the corporation.</li></p>\n<h2 id=\"completing-the-ontario-annual-return-form\">Completing the Ontario Annual Return Form</h2>\n<p>Each year, Ontario corporations must file an Annual Return to update or confirm their business's current information with the government. This includes operational details and financial summaries.\n<h3 id=\"log-in-to-my-ontario-account-and-access-annual-return\">Log in to My Ontario Account and Access Annual Return</h3></p>\n<li><strong>Access My Ontario Account</strong>: Log in to <a href=\"https://signin.ontario.ca/\">My Ontario Account</a> on the official government website.</li>\n<li><strong>Navigate to Corporate Services</strong>: Look for the section related to corporate services or business filings.</li>\n<li><strong>Select the Annual Return Option:</strong>Locate the specific option for filing the Ontario Return or updating corporate information.</li>\n<h3 id=\"step-1-select-annual-return-year-and-confirm-update-primary-activity-if-required\">Step 1: Select Annual Return Year and Confirm/Update Primary Activity if Required</h3>\n<p>Once you've access the Annual Return page, you will be taken to Step 1 where you will select the Annual Return Year for the return you are trying to file. You will also need to review your Primary Activity. If your business activity has not changed you can move to the next section. If there has been a change, find the new NAICS code that applies to your primary business activity and update it.\n<h3 id=\"step-2-confirm-or-update-registered-or-head-office-address\">Step 2: Confirm or Update Registered or Head Office Address</h3></p>\n<p>Review the current Registered or Head Office Address and confirm it or make changes if there is a new address by clicking Change Registered or Head Office Address.\n<h3 id=\"step-3-enter-confirm-or-change-director-s-information\">Step 3: Enter, Confirm or Change Director(s) Information</h3></p>\n<p>Verify and/or enter, wherever applicable, the name, email address, Canadian residency, address and elected date of each director of the corporation.\n<h3 id=\"step-4-enter-confirm-or-change-officer-s-information\">Step 4: Enter, Confirm or Change Officer(s) Information</h3></p>\n<p>Verify and/or enter, wherever applicable, the name, position, email address, address and appointed date of each officer of the corporation.\n<h3 id=\"step-5-certification\">Step 5: Certification</h3></p>\n<p>On the certification page, you will select the Director or Officer that will certify that all information set out in the Ontario Annual Filing is true, correct and complete.\n<h3 id=\"step-6-review\">Step 6: Review</h3></p>\n<p>You will review all of the Ontario Annual Return information to confirm that it is correct. On this page, it is also possible to create a .pdf that you can then save for your records and include in the corporation's minute book. Once you've confirmed that all information is correct, click Submit.</p>\n<p>Before submission, it is crucial to:\n1. Scrutinize each section for <strong>accuracy</strong>. Verify that all numbers and details are current and match internal records.\n2. Ensure <strong>completeness</strong>. Every mandatory field should be filled to comply with the filing requirements and avoid potential penalties or processing delays</p>\n<p>After submission, you will receive a confirmation email that the return has been filed and processed.\n<h2 id=\"filing-options\">Filing Options</h2></p>\n<p>Ontario offers convenient methods for businesses to file their annual returns either online or through traditional paper filing.\n<h3 id=\"online-filing-through-my-ontario-account\">Online Filing Through My Ontario Account</h3></p>\n<p>Businesses can file their Ontario annual return electronically using their <a href=\"https://signin.ontario.ca/\">My Ontario Account</a>, a secure access system. To file online:\n1. <strong>Log in</strong> to <a href=\"https://signin.ontario.ca/\">My Ontario Account</a>.\n2. <strong>Select</strong> the <em>File and Manage</em> option.\n3. <strong>Complete</strong> the electronic form with accurate and current business information.</p>\n<h3 id=\"contact-your-lawyer\">Contact your Lawyer</h3>\n<p>If you prefer that your lawyer files the Ontario Annual Return on your behalf, make sure to contact them and ask that this be done every year. Lawyers have access to a third party service that lets them file this information for your corporation.\n<h2 id=\"after-filing\">After Filing</h2></p>\n<p>Once an Ontario corporation has filed its annual return, the process is not complete without taking note of post-submission procedures that ensure compliance and accuracy.\n<h3 id=\"issuance-of-acknowledgement\">Issuance of Acknowledgement</h3></p>\n<p>After the annual return is successfully filed, the Ontario Business Registry issues an acknowledgement receipt. This document confirms that the filing has been recorded. Corporations should <strong>save and print</strong> this receipt for their records.\n<h3 id=\"maintaining-corporate-records\">Maintaining Corporate Records</h3></p>\n<p>A corporation must update its corporate records to reflect the information submitted in the annual return. These records typically include minutes from meetings, amendments to <strong>by-laws</strong>, and updates to the <strong>board of directors</strong> or <strong>corporate address, if any changes have occurred</strong>.\n<li><strong>Minutes and Resolutions:</strong> Record any changes affirmed in the return.</li>\n<li><strong>Register of Directors:</strong> Ensure the current list of directors is accurate.</li>\n<li><strong>Register of Shareholders:</strong> If there were changes, these must be updated.</li>\n<li><strong>Corporate By-laws and Articles:</strong> File amended versions if alterations have been made.</li></p>\n<h3 id=\"dealing-with-rejections-or-corrections\">Dealing with Rejections or Corrections</h3>\n<p>If an annual return is rejected, a corporation will receive a rejection notice outlining the reasons for the rejection. Necessary corrections must be made promptly to meet regulatory compliance. Corporations should <strong>carefully review the rejection notice, correct all discrepancies</strong>, and resubmit the annual return as soon as possible.\n<h2 id=\"compliance-and-deadlines\">Compliance and Deadlines</h2></p>\n<p>In Ontario, corporations must adhere strictly to legislated timelines for filing their annual returns. Failure to comply can invite penalties and potentially serious consequences such as dissolution of the corporation.\n<h3 id=\"statutory-deadlines\">Statutory Deadlines</h3></p>\n<li><strong>Ontario Corporations with Share Capital:</strong> These must file an annual information return within <strong>six months</strong> of their fiscal year-end.</li>\n<li><strong>All Other Ontario Entities:</strong> They are required to update their information within <strong>60 days</strong> following the corporation's anniversary date, which is the same date the corporation was initially incorporated.</li>\n<h3 id=\"consequences-of-non-compliance\">Consequences of Non-compliance</h3>\n<li><strong>Penalties:</strong> Late filing can result in monetary fines that could impact the financial status of the business.</li>\n<li><strong>Dissolution:</strong> Prolonged non-compliance might lead to involuntary dissolution of the corporation, meaning it would no longer exist as a legal entity.</li>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p>When filing an annual return for a corporation in Ontario, clarity on common queries is essential. This section addresses the frequently asked questions about the process.\n<h3 id=\"what-are-the-steps-to-file-an-annual-return-for-a-corporation-in-ontario-\">What are the steps to file an annual return for a corporation in Ontario?</h3></p>\n<p>To file an annual return in Ontario, a corporation should collect all necessary information including the corporation's name, Ontario Corporation Number, registered office address, director details, financial year-end date, business type, and share classifications. These details are submitted through the Ontario Business Registry.\n<h3 id=\"what-forms-are-needed-for-filing-an-ontario-corporation-annual-return-\">What forms are needed for filing an Ontario corporation annual return?</h3></p>\n<p>Corporations in Ontario must complete the form known as the Corporation Information Act Annual Return, which can be filed through the Ontario Business Registry system.\n<h3 id=\"how-can-i-find-my-corporation-information-to-file-an-annual-return-in-ontario-\">How can I find my corporation information to file an annual return in Ontario?</h3></p>\n<p>Corporation information can be found on documents from initial registration or from previous annual returns. If necessary, corporations can also contact the Ministry of Government and Consumer Services or retrieve records from the Ontario Business Registry.\n<h3 id=\"is-it-mandatory-for-all-ontario-businesses-to-file-an-annual-return-\">Is it mandatory for all Ontario businesses to file an annual return?</h3></p>\n<p>Yes, all corporations operating in Ontario are required to file an annual return. This applies to profit, professional, and not-for-profit corporations as per their respective corporate legislation.\n<h3 id=\"what-information-is-required-when-registering-a-business-in-the-ontario-business-registry-\">What information is required when registering a business in the Ontario Business Registry?</h3></p>\n<p>When registering a business in the Ontario Business Registry, the required information includes the corporate name, Ontario Corporation Number, business and office addresses, director details, financial year-end, type of business, and authorized share structure.\n<h3 id=\"how-does-one-access-the-ontario-business-registry-to-file-an-annual-return-\">How does one access the Ontario Business Registry to file an annual return?</h3></p>\n<p>To access the Ontario Business Registry for filing an annual return, a corporation must create an account on the Service Ontario website. After account activation, annual information returns can be submitted online.</p>",
    "toc": [
        {
            "id": "understanding-ontario-annual-returns",
            "title": "Understanding Ontario Annual Returns"
        },
        {
            "id": "preparing-to-file-your-return",
            "title": "Preparing to File Your Return"
        },
        {
            "id": "completing-the-ontario-annual-return-form",
            "title": "Completing the Ontario Annual Return Form"
        },
        {
            "id": "filing-options",
            "title": "Filing Options"
        },
        {
            "id": "after-filing",
            "title": "After Filing"
        },
        {
            "id": "compliance-and-deadlines",
            "title": "Compliance and Deadlines"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "November 30, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_tax_canada.png"
}