{
    "id": "nr4-slip-vs-t4a-nr-proof-of-withholding",
    "slug": "nr4-slip-vs-t4a-nr-proof-of-withholding",
    "title": "What Documents Prove Withholding? NR4 vs T4A-NR vs Payer Letter",
    "excerpt": "Need to claim your Regulation 105 refund? You need specific slips. We explain the NR4, T4A-NR, and what to do if your client didn't send them.",
    "content": "<p>The Canada Revenue Agency (CRA) is a stickler for paperwork. You might know they withheld 15% of your money. Your client knows it. But unless the CRA receives the official slip matching that amount, your refund application will grind to a halt.</p>\n<p>Here is the guide to the documents you need to prove your case.</p>\n<h2 id=\"the-nr4-slip-the-gold-standard\">The NR4 Slip: The Gold Standard</h2>\n<p>For most US corporations, the <strong>NR4</strong> (Statement of Amounts Paid or Credited to Non-Residents of Canada) is the document you need. It is a small slip that shows:</p>\n<ul>\n<li><strong>Income Code:</strong> Describing the type of service.</li>\n<li><strong>Gross Income:</strong> The total amount invoiced (CAD).</li>\n<li><strong>Non-Resident Tax Withheld:</strong> The 15% amount.</li>\n</ul>\n<p>Your client is legally required to file this with the CRA and send you a copy.</p>\n<h2 id=\"the-t4a-nr-for-individuals\">The T4A-NR: For Individuals</h2>\n<p>If you are a sole proprietor or an individual consultant, you might receive a <strong>T4A-NR</strong> (Statement of Fees, Commissions, or Other Amounts Paid to Non-Residents for Services Rendered in Canada) instead. It serves the same purpose but is linked to your Social Security Number or ITN rather than a corporate Business Number.</p>\n[[CTA_CONSULT]]\n<h2 id=\"when-should-i-receive-these\">When Should I Receive These?</h2>\n<p>The deadline for Canadian companies to issue these slips is <strong>the last day of February</strong> following the calendar year of payment. If you did work in June 2025, you should get the slip by February 28, 2026.</p>\n<h2 id=\"what-to-do-if-your-client-is-ghosting-you\">What to Do If Your Client is Ghosting You</h2>\n<p>Sometimes clients forget. Sometimes they go out of business. If you cannot get an NR4, you can try submitting:</p>\n<ol>\n<li><strong>Copies of invoices</strong> showing the deduction.</li>\n<li><strong>Bank statements</strong> showing the net deposit.</li>\n<li><strong>A confirmation letter</strong> from the client's payroll/finance department stating the amount remitted to CRA.</li>\n</ol>\n<p>The CRA <em>may</em> accept this, but it will trigger a manual review, slowing down your refund.</p>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p><strong>The NR4 is in Canadian Dollars. Do I convert it?</strong><br>You must file your Canadian tax return in CAD. If your books are in USD, exchange rate calculations are required.</p>\n<p><strong>My client withheld tax but didn't send it to the CRA. What now?</strong><br>This is a serious issue. You are effectively paying tax that wasn't remitted. Usually, the burden is on the Canadian payer, but you will need strong proof.</p>\n<p><strong>Can I download the NR4 from the CRA website?</strong><br>Only if you have a \"Representation a Client\" account authorized for your business in Canada. We can often check this for our clients.</p>\n<p><strong>Is the NR4 the same as a T4?</strong><br>No. T4 is for resident employees. NR4 is for non-resident passive or business income.</p>\n<p><strong>Do I need the original copy?</strong><br>PDF copies are generally accepted for E-filing.</p>"
}