{
    "id": "ontario-hst-exemptions-list",
    "slug": "ontario-hst-exemptions-list",
    "title": "Ontario HST Exemptions List: A Comprehensive Guide",
    "excerpt": "The Harmonized Sales Tax (HST) is a combined federal and provincial tax applicable to most goods and services in Ontario. However, there are exemption...",
    "content": "<p>The <a href=\"/blog\">Harmonized Sales Tax</a> (HST) is a combined federal and provincial tax applicable to most goods and services in Ontario. However, there are exemptions to this tax, which means certain items and services are not subject to HST. Understanding the scope of these exemptions can help individuals and businesses make well-informed decisions about their purchases and the taxes they are expected to pay.</p>\n<p>Some examples of goods and services on the Ontario HST exemption list include health, medical, and dental services provided by licensed physicians and dentists for medical reasons. With a variety of HST exempt items, consumers and business owners can benefit from being aware of these exemptions and planning their expenses accordingly.</p>\n<p>In addition to these exemptions, it is essential to be aware of false GST/HST exemption claims and counterfeit exemption cards. By being knowledgeable about the HST exemptions in Ontario and recognizing potential fraudulent activities, individuals and businesses can better navigate the tax system and make informed decisions.\n<h2 id=\"overview-of-hst-in-ontario\">Overview of HST in Ontario</h2></p>\n<p>In Ontario, the Harmonized Sales Tax (HST) is a combination of the federal goods and services tax (GST) and the provincial sales tax. Currently, the <a href=\"/blog/canadian-corporate-tax-rates-by-province\">HST rate</a> stands at <strong>13%</strong>. It came into effect on July 1, 2010, replacing the 5% GST and 8% RST on most goods and services in the province.</p>\n<p>HST applies to a wide range of goods and services; however, certain goods and services are exempt. This means that businesses in Ontario do not collect HST on these exempt items, and consequently, are not required to <a href=\"/blog/how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide\">remit the tax</a>.</p>\n<p>Examples of HST-exempt goods and services in Ontario are as follows:\n<li>Health, medical, and dental services provided by licensed physicians and dentists for medical reasons</li>\n<li>Most educational services, such as vocational and college courses</li>\n<li>Childcare services</li>\n<li>Long-term rentals</li>\n<li>Legal aid services</li></p>\n<p>It is essential for businesses and consumers in Ontario to be aware of the HST exemption list. This knowledge helps businesses maintain their compliance with tax regulations, while consumers understand their rights and responsibilities related to the taxes they pay.\n<h2 id=\"general-hst-exemptions\">General HST Exemptions</h2></p>\n<p>In Ontario, certain products and services are exempt from the 13% Harmonized Sales Tax (HST). This section will discuss the general exemptions, which include basic groceries, prescription drugs, medical devices, books, children's goods, feminine hygiene products, and agricultural products.\n<h3 id=\"basic-groceries\">Basic Groceries</h3></p>\n<p>Items considered as basic groceries are exempt from HST. These include most unprocessed food products such as fresh fruits, vegetables, meat, poultry, and fish. Processed foods such as snack foods and carbonated beverages do not fall under this category and are subject to HST.\n<h3 id=\"prescription-drugs\">Prescription Drugs</h3></p>\n<p>Prescription drugs are considered zero-rated supplies when they are prescribed by a licensed healthcare provider and dispensed by a pharmacist. Any over-the-counter (OTC) medications and vitamins are subject to HST unless they are specifically prescribed by a healthcare professional.\n<h3 id=\"medical-devices\">Medical Devices</h3></p>\n<p>Most medical devices, such as hearing aids, artificial limbs, and walking aids, are exempt from HST when prescribed by a medical practitioner for a patient's use. This also includes medical equipment that is necessary for the patient's treatment or mobility.\n<h3 id=\"books\">Books</h3></p>\n<p>Printed books, audio recordings of printed books, and electronic books (e-books) are generally exempt from HST. This includes textbooks, children's books, and literary works. Magazines, newspapers, and periodicals, however, are still subject to HST.\n<h3 id=\"children-s-goods\">Children's Goods</h3></p>\n<p>Clothing and footwear designed for children under 14 years of age are exempt from HST. This includes baby garments, children's hats, gloves, and outerwear. Children's car seats and booster seats are also exempt from HST.\n<h3 id=\"feminine-hygiene-products\">Feminine Hygiene Products</h3></p>\n<p>Feminine hygiene products, such as tampons, pads, and menstrual cups, are exempt from HST in Ontario to make them more accessible and affordable for those who need them.\n<h3 id=\"agricultural-products\">Agricultural Products</h3></p>\n<p>Agricultural products, including livestock, poultry, and raw wool, are exempt from HST. Farm equipment and machinery used for agricultural purposes may also qualify for HST exemption depending on certain criteria.</p>\n<p>These general exemptions aim to make essential goods and services more accessible to Ontario residents.\n<h2 id=\"hst-exempt-services\">HST Exempt Services</h2></p>\n<h3 id=\"health-care-services\">Health Care Services</h3>\n<p>In Ontario, health care services provided by licensed physicians, dentists, and other health professionals for medical reasons are exempt from HST. This includes services such as <em>diagnosis, treatment, and prevention of illness or injury</em>. However, cosmetic procedures and non-medical services are subject to HST.\n<h3 id=\"educational-services\">Educational Services</h3></p>\n<p>Educational services consisting of <em>tuition fees</em> for courses leading to a diploma or degree from an accredited institution are HST exempt. This exemption also extends to vocational training provided by public or designated private schools. Please note that some extracurricular activities and materials may be subject to HST.</p>\n<p>| Exempt Educational Services | Non-Exempt Educational Services |\n| --- | --- |\n| Degree and diploma courses | Tutoring services |\n| Vocational training | Learning materials |\n| Government-funded training | Extracurricular activities |</p>\n<h3 id=\"\"></h3>\n<h3 id=\"legal-aid-services\">Legal Aid Services</h3>\n<p>Legal aid services that are provided or funded by <em>government-funded organizations</em> are exempt from HST. This exemption ensures that individuals in need of legal assistance can access these services without additional cost barriers.\n<h3 id=\"financial-services\">Financial Services</h3></p>\n<p>Certain financial services in Ontario are also HST exempt. These include:\n<li>Deposits and loans</li>\n<li>Insurance policies</li>\n<li>Credit card and debit card services</li>\n<li>Investment management and advisory services</li></p>\n<p>It is important for businesses and consumers to be aware that some financial services, such as service fees and ATM usage fees, may still be subject to HST.\n<h3 id=\"child-care-services\">Child Care Services</h3></p>\n<p>Child care services provided for children aged 14 or under are exempt from HST in Ontario when provided by licensed facilities, schools, and camps. This exemption eases the financial burden on parents seeking quality care for their children.</p>\n<p><strong>Note</strong>: Private child care providers that are not licensed by the government are subject to HST, and unlicensed child care services may not have the same quality standards in place.\n<h2 id=\"property-and-real-estate-exemptions\">Property and Real Estate Exemptions</h2></p>\n<h3 id=\"residential-rentals\">Residential Rentals</h3>\n<p>Long-term residential rentals, defined as rentals for a continuous period of one month or more, are <strong>exempt</strong> from HST in Ontario. This includes renting out residential properties such as houses, apartments, and condominiums. However, short-term rentals, like those often found on platforms such as Airbnb, are still subject to HST as they are considered a supply of accommodation.\n<h3 id=\"sales-of-used-residential-housing\">Sales of Used Residential Housing</h3></p>\n<p>In Ontario, the sale of used residential properties is typically <strong>exempt</strong> from HST. This means that when individuals sell their homes, they generally do not need to collect and remit HST as part of the transaction. It's essential to note that this exemption only applies to used residential properties and does not include newly built homes or commercial properties.\n<h3 id=\"certain-real-property-transactions\">Certain Real Property Transactions</h3></p>\n<p>Some specific real property transactions may also qualify for HST exemption. For example, sales of personal-use vacant land are typically exempt from HST. Personal-use vacant land refers to land that is not used for commercial purposes, such as farming or generating income. Additionally, specific transfers of real property between closely related parties, such as family members or corporations under common control, can be exempt from HST if certain conditions are met. In these cases, it's vital to consult a tax professional to ensure eligibility for the exemption.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<h3 id=\"what-types-of-groceries-are-not-subject-to-sales-tax-in-ontario-\">What types of groceries are not subject to sales tax in Ontario?</h3>\n<p>Most basic groceries are not subject to HST in Ontario, including items such as fresh fruits and vegetables, raw meat, dairy products, and bread. However, some groceries that involve additional processing, packaging, or are considered snack items or ready-to-eat meals may be subject to HST.\n<h3 id=\"are-children-s-clothing-items-exempt-from-hst-in-the-province-\">Are children's clothing items exempt from HST in the province?</h3></p>\n<p>Children's clothing items in Ontario are exempt from HST if they are designed specifically for a child under the age of 15. This includes items such as clothing, footwear, and accessories. However, adult-sized clothing that is intended for children is not exempt.\n<h3 id=\"how-is-restaurant-food-taxed-differently-from-other-goods-in-ontario-\">How is restaurant food taxed differently from other goods in Ontario?</h3></p>\n<p>Restaurant food is subject to the full 13% HST in Ontario, unlike many grocery items that are exempt. This tax applies to prepared meals, snacks, and beverages sold at restaurants or other food establishments, as well as delivery and takeout meals.\n<h3 id=\"which-business-expenses-may-be-claimed-as-exemptions-on-an-hst-return-in-ontario-\">Which business expenses may be claimed as exemptions on an HST return in Ontario?</h3></p>\n<p>Businesses registered for HST in Ontario can claim <a href=\"/blog/how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide\">Input Tax Credits (ITCs)</a> for the HST paid on eligible expenses related to their commercial activities. Examples of eligible expenses include rent, office supplies, utilities, and vehicle expenses, among others. It is important for businesses to maintain proper records and documentation to support their ITC claims.</p>",
    "toc": [
        {
            "id": "overview-of-hst-in-ontario",
            "title": "Overview of HST in Ontario"
        },
        {
            "id": "general-hst-exemptions",
            "title": "General HST Exemptions"
        },
        {
            "id": "hst-exempt-services",
            "title": "HST Exempt Services"
        },
        {
            "id": "property-and-real-estate-exemptions",
            "title": "Property and Real Estate Exemptions"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "January 2, 2024",
    "readTime": "5 min read",
    "tags": [
        "Sales Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_tax_canada.png"
}