{
    "id": "quebec-non-resident-withholding-refund-tp-1015",
    "slug": "quebec-non-resident-withholding-refund-tp-1015",
    "title": "Québec Non-Resident Withholding (9%): Refunds & Rules",
    "excerpt": "Services rendered in Québec are subject to an EXTRA 9% withholding tax on top of the federal 15%. Learn about Revenu Québec rules and refunds.",
    "content": "<p>Canada has a complex tax system, but no province has more unique rules than Québec. If you provide services in Montreal, Quebec City, or anywhere in the province, you might find that your client hasn't just withheld the standard 15%—they've withheld an additional 9%.</p>\n<p>This is the <strong>Québec provincial withholding tax</strong> for non-residents.</p>\n<h2 id=\"the-24-percent-surprise-in-quebec\">The \"24% Surprise\" in Québec</h2>\n<p>For services rendered in Québec, the withholding requirement stacks:</p>\n<ul>\n<li><strong>Federal (CRA) Regulation 105:</strong> 15%</li>\n<li><strong>Provincial (Revenu Québec) Regulation 1015:</strong> 9%</li>\n</ul>\n<p>That means on a $100,000 contract, you might only receive $76,000. That is a massive hit to cash flow.</p>\n<h2 id=\"who-governs-this\">Who Governs This? (CRA vs Revenu Québec)</h2>\n<p>Unlike other provinces where the CRA collects all taxes, Québec collects its own corporate taxes. This means you are dealing with two separate tax agencies, two separate business numbers, and two separate refund processes.</p>\n[[CTA_CONSULT]]\n<h2 id=\"how-to-get-the-provincial-refund\">How to Get the Provincial Refund</h2>\n<p>Just like the federal 15%, the provincial 9% is generally refundable if you are treaty-exempt (no permanent establishment in Canada). However, the US-Canada tax treaty applies to federal taxes. Québec technically isn't a signatory to the treaty, but it generally respects the same rules through its own tax laws.</p>\n<h2 id=\"the-co-17-return\">The CO-17 Return</h2>\n<p>To get the 9% back, you must file a <strong>CO-17 (Déclaration de revenus des sociétés)</strong> with Revenu Québec. This is the provincial equivalent of the T2.</p>\n<p>You will need:</p>\n<ul>\n<li>A Québec Enterprise Number (NEQ).</li>\n<li>The <strong>RL-1 Slip</strong> (Relevé 1) or equivalent documentation from your client showing the withholding.</li>\n<li>To file within 6 months of year-end.</li>\n</ul>\n<h2 id=\"do-i-need-a-waiver-for-quebec-too\">Do I Need a Waiver for Québec Too?</h2>\n<p>Yes. A federal Regulation 105 waiver does <strong>not</strong> automatically stop Quebec withholding. You must apply for a separate waiver with Revenu Québec (Form VD-101.M).</p>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p><strong>Are the forms in English?</strong><br>Revenu Québec provides courtesy translations, but official correspondence often happens in French.</p>\n<p><strong>Does the treaty apply to Québec?</strong><br>The Canada-US treaty is federal, but Québec tax law mirrors many of its provisions for business profits.</p>\n<p><strong>Can I file one return for both?</strong><br>No. Québec is the only province requiring a completely separate corporate tax return.</p>\n<p><strong>What if I only file the federal return?</strong><br>You will get your 15% back but lose the 9% held by Québec.</p>\n<p><strong>Do I need a Quebec Business Number (NEQ)?</strong><br>Yes, you will need to register your business in Québec to file the return.</p>"
}