{
    "id": "regulation-105-refund-us-companies-treaty-t2",
    "slug": "regulation-105-refund-us-companies-treaty-t2",
    "title": "Regulation 105 Refund for US Companies: Treaty Basics & T2 Filing",
    "excerpt": "US companies doing business in Canada can often recover Regulation 105 withholding taxes. Learn how the Canada-US Tax Treaty protects your profits.",
    "content": "<p>For US companies expanding into Canada, securing a contract north of the border is a great win. But that win often comes with a surprise: a 15% holdback on your fees under <strong>Regulation 105</strong>.</p>\n<p>Many US business owners mistakenly assume this is a \"cost of doing business\" or a final tax. It is neither. Thanks to the <strong>Canada-US Income Tax Convention</strong> (the Tax Treaty), your business profits earned in Canada are typically exempt from Canadian taxation—unless you set up a permanent shop here.</p>\n<p>Here is how US companies can leverage the treaty to get that 15% back.</p>\n<h2 id=\"the-canada-us-tax-treaty-your-best-friend\">The Canada-US Tax Treaty: Your Best Friend</h2>\n<p>The tax treaty exists to prevent double taxation. Without it, you might pay tax on the same income to both the IRS and the CRA. The treaty clarifies that specific types of income are only taxable in your home country (the US).</p>\n<h2 id=\"what-is-regulation-105-really\">What is \"Regulation 105\" really?</h2>\n<p>Regulation 105 is a <em>withholding</em> requirement, not a tax liability. The CRA requires your Canadian client to withhold 15% of your gross fees simply because they don't know your final tax status yet. The CRA holds onto this money until you file a return proving you owe nothing.</p>\n<h2 id=\"do-i-have-to-file-a-canadian-tax-return\">Do I have to file a Canadian Tax Return?</h2>\n<p>Yes. Even if you owe $0 in taxes, you generally must file a <strong>T2 Corporation Income Tax Return</strong> to:</p>\n<ol>\n<li>Claim the treaty exemption to reduce your Canadian tax liability to $0.</li>\n<li>Request the refund of the 15% that was withheld.</li>\n</ol>\n<h2 id=\"article-v-the-permanent-establishment-rule\">Article V: The Permanent Establishment Rule</h2>\n<p>This is the most critical part of the treaty for your refund. Under <strong>Article V</strong>, a US company typically only has a \"Permanent Establishment\" (PE) in Canada if:</p>\n<ul>\n<li>It has a fixed place of business (office, branch, factory) in Canada.</li>\n<li>It has an agent in Canada with authority to sign contracts.</li>\n<li>It provides services in Canada for more than 183 days in a 12-month period (under specific conditions).</li>\n</ul>\n<p>If you fly in for a few weeks to consult and then fly out, you likely <strong>do not</strong> have a PE.</p>\n[[CTA_CONSULT]]\n<h2 id=\"article-vii-business-profits-exemption\">Article VII: Business Profits Exemption</h2>\n<p>If you don't have a PE, <strong>Article VII</strong> states that your \"Business Profits\" are taxable <em>only</em> in the United States. This is the legal basis for your Regulation 105 refund.</p>\n<h2 id=\"how-to-file-for-your-refund\">How to File for Your Refund</h2>\n<p>To get your money, you can't just write a letter. You must submit a full T2 return package, including:</p>\n<ul>\n<li><strong>T2 Jacket:</strong> The main return form.</li>\n<li><strong>Schedule 91:</strong> Information Concerning Claims for Treaty-Based Exemptions.</li>\n<li><strong>Schedule 97:</strong> Additional Information on Non-Resident Corporations in Canada.</li>\n<li><strong>NR4 Slip:</strong> The proof of tax withheld.</li>\n</ul>\n<p>While it requires paperwork, recovering 15% of your gross revenue is well worth the effort.</p>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p><strong>Does filing a Canadian return increase my audit risk?</strong><br>Filing a \"Treaty-Based\" return is a standard procedure. Not filing while having Canadian income is actually higher risk.</p>\n<p><strong>What if I actually <em>did</em> have a permanent establishment?</strong><br>Then the 15% withheld is applied against the Canadian tax you owe. You may owe more, or you may get a partial refund using foreign tax credits.</p>\n<p><strong>Can I file digitally?</strong><br>Yes, non-resident T2 returns can often be net-filed if you have a valid Business Number and Web Access Code, which we handle for clients.</p>\n<p><strong>How far back can I claim?</strong><br>You generally have 3 years from the end of the tax year to ask for a refund.</p>\n<p><strong>Do I need a Canadian Business Number?</strong><br>Yes, you will need to apply for one (RC1 form) if you don't have one already.</p>"
}