{
    "id": "regulation-105-waiver-application-canada",
    "slug": "regulation-105-waiver-application-canada",
    "title": "Regulation 105 Waiver (R105): How to Stop the 15% Withholding",
    "excerpt": "Want to stop Canadian clients from withholding 15% of your fees? Learn how to apply for a Regulation 105 Waiver (Form R105) before you invoice.",
    "content": "<p>Getting a Regulation 105 refund is great, but waiting six months for your own money is not. For consultants and businesses with tight cash flow, having 15% of every invoice stripped away can be crippling.</p>\n<p>The solution? The <strong>Regulation 105 Waiver</strong>.</p>\n<p>If successful, a waiver allows your Canadian client to pay you 100% of your invoice amount, bypassing the withholding requirement entirely. Here is how to get one.</p>\n<h2 id=\"refunds-vs-waivers\">Refunds vs. Waivers: What's the Difference?</h2>\n<p>A <strong>refund</strong> is reactive: The tax is taken, and you file a return next year to get it back.</p>\n<p>A <strong>waiver</strong> is proactive: You ask the CRA for permission <em>in advance</em> to not have the tax taken at all. This keeps the cash in your pocket throughout the project.</p>\n<h2 id=\"who-should-apply-for-a-waiver\">Who Should Apply for a Waiver?</h2>\n<p>You should consider a waiver if:</p>\n<ul>\n<li>The contract value is significant (losing 15% would hurt operations).</li>\n<li>You are clearly exempt under a tax treaty (no Permanent Establishment).</li>\n<li>You have your documentation organized and ready before the work starts.</li>\n</ul>\n<h2 id=\"the-application-process-form-r105\">The Application Process (Form R105)</h2>\n<p>You must file <strong>Form R105</strong> (Regulation 105 Waiver Application) with the CRA Centre of Expertise. This is not a simple form; it requires:</p>\n<ul>\n<li>A copy of your contract.</li>\n<li>Identification of all employees coming to Canada.</li>\n<li>A description of exactly what you will be doing.</li>\n<li>An explanation of why you are treaty-exempt or an income/expense statement showing you won't owe tax.</li>\n</ul>\n[[CTA_CONSULT]]\n<h2 id=\"the-30-day-rule\">The \"30-Day Rule\"</h2>\n<p>Timing is everything. The CRA requires the waiver application to be submitted <strong>at least 30 days before</strong> the period of service begins or the first payment is made.</p>\n<p>If you apply late, the CRA may not process it in time for your first invoice, meaning the 15% will still be withheld on initial payments.</p>\n<h2 id=\"what-happens-after-approval\">What Happens After Approval?</h2>\n<p>If approved, the CRA sends a letter to you and, crucially, to your <strong>Canadian Client</strong>. This letter is the legal authority they need to pay you the full amount without withholding tax. Without this physical letter, prudent Canadian CFOs will refuse to waive the withholding.</p>\n<h2 id=\"what-if-my-waiver-is-denied\">What if My Waiver is Denied?</h2>\n<p>If denied, or if you didn't apply in time, don't panic. You simply revert to the standard Refund method: let them withhold the 15%, file your T2 return at year-end, and claim it back then.</p>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p><strong>Is a waiver permanent?</strong><br>No. Waivers are usually specific to a contract/client and a specific time period.</p>\n<p><strong>Does a waiver mean I don't have to file a tax return?</strong><br><strong>No!</strong> This is a common myth. Even with a waiver, you generally must file a T2 return to confirm the exemption.</p>\n<p><strong>What about my employees' taxes (Reg 102)?</strong><br>Regulation 105 is for the company. Regulation 102 is for employee payroll. You may need a separate \"Regulation 102 Waiver\" for employees.</p>\n<p><strong>How strict is the 30-day rule?</strong><br>Very. The CRA is busy. If you submit it 5 days before the job, it likely won't be processed in time for the first payment.</p>\n<p><strong>Can I apply for a blanket waiver?</strong><br>In some cases, for recurring clients, yes. But typically it is per engagement.</p>"
}