{
    "id": "regulation-105-refund-filing-deadlines-canada",
    "slug": "regulation-105-refund-filing-deadlines-canada",
    "title": "Deadlines: When to File for Your Regulation 105 Refund",
    "excerpt": "When is your Regulation 105 refund return due? Learn the 6-month filing deadline, lateness penalties, and the 3-year hard stop for refunds.",
    "content": "<p>One of the most common questions we get from US clients is: \"When do I need to deal with this Canadian 15% withholding?\"</p>\n<p>The answer depends on whether you like paying penalties or getting refunds. Here is the timeline you need to know.</p>\n<h2 id=\"the-6-month-rule\">The 6-Month Rule</h2>\n<p>Technically, a T2 Corporation Income Tax Return required under Regulation 105 must be filed within <strong>six months of your fiscal year-end</strong>.</p>\n<ul>\n<li>If your Year-End is December 31 -> <strong>Deadline: June 30.</strong></li>\n</ul>\n<h2 id=\"the-difference-between-owing-and-refund-deadlines\">The Difference Between \"Owing\" and \"Refund\" Deadlines</h2>\n<p><strong>If you OWE tax (you had a Permanent Establishment):</strong> You must pay by the deadline to avoid interest and penalties.</p>\n<p><strong>If you are owed a REFUND (Treaty Exempt):</strong> The CRA is more lenient. Because you don't owe them money, they typically won't fine you for being a few months late, <em>however</em>, they will hold your refund until you file.</p>\n<h2 id=\"the-3-year-hard-stop\">The 3-Year Hard Stop</h2>\n<p>This is the dangerous one. <strong>You have a maximum of 3 years</strong> from the end of the tax year to claim a tax refund. If you file 3 years and one day later, the CRA is legally allowed to keep your Regulation 105 withholding <em>forever</em>.</p>\n<p>We have seen companies lose tens of thousands of dollars simply because they waited too long.</p>\n[[CTA_CONSULT]]\n<h2 id=\"what-if-i-am-late\">What If I Am Late?</h2>\n<p>If you miss the 6-month deadline but you are within the 3-year window:</p>\n<ul>\n<li>File as soon as possible.</li>\n<li>If you are treaty-exempt (Schedule 91), there is usually no late-filing penalty because penalties are calculated based on <em>tax owing</em> (which is zero).</li>\n</ul>\n<h2 id=\"how-long-does-the-refund-take\">How Long Does the Refund Take?</h2>\n<p>Once you file, patience is required. Non-resident returns are not processed automatically; they often undergo manual review.\n<strong>Expect 4 to 7 months</strong> from the date of filing to receive your cheque or direct deposit.</p>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p><strong>My year-end is different in Canada. Can I change it?</strong><br>Canada usually expects your detailed T2 fiscal period to match your US fiscal period.</p>\n<p><strong>Can I file early?</strong><br>You can file as soon as your fiscal year ends, provided you have the NR4 slip (which often doesn't arrive until Feb/March).</p>\n<p><strong>Do I get interest on my refund?</strong><br>Yes! The CRA pays interest on delayed refunds, starting from the later of the filing date or 120 days after year-end.</p>\n<p><strong>What if I haven't filed for 5 years?</strong><br>Years 4 and 5 are likely lost causes for refunds, but you should still file to close the compliance loop and avoid future scrutiny.</p>\n<p><strong>Is the deadline different for individuals?</strong><br>Yes. T1 returns for individuals are generally due June 15th, but taxes (if owed) are due April 30th.</p>"
}