{
    "id": "regulation-105-vs-regulation-102-canada",
    "slug": "regulation-105-vs-regulation-102-canada",
    "title": "Reg 105 vs Reg 102: Contractors vs Employees (and why it matters)",
    "excerpt": "Regulation 105 applies to the company invoice. Regulation 102 applies to employee payroll. Learn the difference and avoid double withholding.",
    "content": "<p>If you send employees to Canada to perform a service, you might run into two different Canadian tax regulations that sound confusingly similar: <strong>Regulation 105</strong> and <strong>Regulation 102</strong>.</p>\n<p>They are not the same. In fact, if you manage them poorly, the CRA might take money from your company's invoice <em>and</em> your employees' paychecks.</p>\n<h2 id=\"regulation-105-the-company-tax\">Regulation 105: The \"Company\" Tax</h2>\n<p><strong>Who pays it:</strong> The Canadian Client.</p>\n<p><strong>Who it affects:</strong> Your Company (the vendor).</p>\n<p><strong>What it is:</strong> A 15% withholding on the gross fee mandated by your invoice. It is an advance on your company's potential corporate income tax.</p>\n<h2 id=\"regulation-102-the-payroll-tax\">Regulation 102: The \"Payroll\" Tax</h2>\n<p><strong>Who pays it:</strong> You (the employer).</p>\n<p><strong>Who it affects:</strong> Your Employees (the workers).</p>\n<p><strong>What it is:</strong> Even if you are a US company paying US employees from a US bank account, if those employees are physically working on Canadian soil, Canada considers that \"Canadian Source Employment Income.\"</p>\n<p>Technically, you are supposed to withhold Canadian income tax from their paychecks for the days they work in Canada and remit it to the CRA. This is <strong>Regulation 102</strong>.</p>\n[[CTA_CONSULT]]\n<h2 id=\"the-double-whammy-scenario\">The \"Double Whammy\" Scenario</h2>\n<p>Imagine you send a consultant to Toronto for a month.</p>\n<ol>\n<li><strong>Reg 105:</strong> Your client withholds 15% of your $50,000 invoice ($7,500).</li>\n<li><strong>Reg 102:</strong> The CRA expects you to withhold Canadian tax from your consultant's salary for that month, even though they are already taxed in the US.</li>\n</ol>\n<p>This creates a massive cash flow and administrative burden.</p>\n<h2 id=\"do-i-need-to-set-up-canadian-payroll\">Do I Need to Set Up Canadian Payroll?</h2>\n<p>Strictly speaking, yes, unless you apply for a <strong>Regulation 102 Waiver</strong> or your employees fall under specific \"Non-Resident Employer Certification\" exceptions. Many small US companies miss this requirement and risk penalties for failing to withhold operational payroll taxes.</p>\n<h2 id=\"how-to-manage-both\">How to Manage Both</h2>\n<ul>\n<li><strong>The Company:</strong> File a T2 return to recover the Reg 105 withholding.</li>\n<li><strong>The Employees:</strong> File a T1 Personal return to recover Reg 102 withholding (if any was remitted), or—better yet—get a Reg 102 waiver beforehand so you don't have to withhold it at all.</li>\n</ul>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p><strong>Does the 15% Reg 105 cover the payroll tax?</strong><br>No. They are completely separate accounts.</p>\n<p><strong>My employees are only there for 2 weeks. Does Reg 102 apply?</strong><br>Technically yes, but there are \"Non-Resident Employer\" certification exceptions that can simplify this for short-term stays.</p>\n<p><strong>Can my employees get the Reg 102 tax back?</strong><br>Yes, by filing a Canadian personal tax return (T1). They can usually claim a foreign tax credit in the US for any Canadian tax paid.</p>\n<p><strong>What forms do I file for my employees?</strong><br>You likely need to issue them a T4 slip (Statement of Remuneration Paid) for their Canadian work days.</p>\n<p><strong>Is this advice for sole proprietors?</strong><br>Sole proprietors are unique because they are both the business and the individual. Usually, only Reg 105 applies to them directly unless they have staff.</p>"
}