{
    "id": "t1135-reporting-requirements",
    "slug": "t1135-reporting-requirements",
    "title": "T1135 Reporting Requirements: A Guide for Canadian Taxpayers",
    "excerpt": "Canadian taxpayers with international interests must navigate Form T1135, also known as the Foreign Income Verification Statement. This form is crucia...",
    "content": "<p>Canadian taxpayers with international interests must navigate Form T1135, also known as the Foreign Income Verification Statement. This form is crucial for individuals, corporations, certain trusts, and partnerships within Canada who hold specified foreign property with a total cost of over $100,000 at any point during the tax year. The form serves to disclose foreign assets and income, ensuring that taxpayers meet their reporting obligations under Canadian tax law.</p>\n<p>The reporting requirements aim to promote transparency in tax matters involving foreign investments, and non-compliance can lead to significant penalties. Form T1135 must be filed alongside the income tax return by the prescribed deadline, which is the same as the due date for submitting the income tax return or partnership information return. It includes detailed information about each specified foreign property, such as the location, cost, and income earned from the property.</p>\n<p>Failure to file or incorrect filing of the T1135 can lead to severe repercussions, including penalties. Therefore, understanding the T1135 reporting requirements is essential for taxpayers who are involved in foreign investment and wish to remain compliant with the Canada Revenue Agency.\n<h2 id=\"overview-of-t1135-foreign-income-verification-statement\">Overview of T1135 Foreign Income Verification Statement</h2></p>\n<p>The T1135 form is a crucial disclosure for Canadian taxpayers holding foreign property with a total cost of more than $100,000 CAD. Ensuring compliance with this requirement helps maintain transparency with the Canada Revenue Agency (CRA).\n<h3 id=\"purpose-of-t1135\">Purpose of T1135</h3></p>\n<p>The <strong>Form T1135</strong>, also known as the <strong>Foreign Income Verification Statement</strong>, serves a vital purpose: to report specified foreign property owned by Canadian residents during a tax year. This reporting is mandatory if the total cost of the foreign property exceeds $100,000 CAD at any point within the year. This form helps the CRA track foreign income that should be reported and taxed in Canada, deterring income concealment and promoting an equitable tax system.\n<h3 id=\"legal-background\">Legal Background</h3></p>\n<p>Legally, the requirement to file a Form T1135 is outlined in the Income Tax Act. Taxpayers who meet the criteria must submit this form concurrently with their income tax return or, for partnerships, with their partnership information return. Failure to file or incomplete filings can result in significant penalties. Over the years, diligent adherence to these regulations has been emphasized to uphold the integrity of the tax system and ensure fair taxation on global income.\n<h2 id=\"eligibility-criteria\">Eligibility Criteria</h2></p>\n<p>In meeting the T1135 reporting requirements, taxpayers must understand which properties are reportable and who is obligated to file.\n<h3 id=\"definition-of-specified-foreign-property\">Definition of Specified Foreign Property</h3></p>\n<p><strong>Specified Foreign Property</strong> refers to certain types of property held outside Canada. They include funds in foreign bank accounts, shares in foreign companies, interests in foreign trusts, foreign real estate, and other income-earning foreign properties. The key criterion for reporting is whether the <strong>total cost</strong> of such property <strong>exceeds $100,000 CAD</strong> at any time during the tax year.\n<h3 id=\"resident-status-and-reporting-obligations\">Resident Status and Reporting Obligations</h3></p>\n<p>Individuals who are <strong>Canadian residents</strong>, <strong>certain trusts</strong>, and <strong>corporations</strong> have an obligation to file a T1135 form if they own specified foreign property above the mentioned threshold. This includes non-resident trusts that are deemed resident under specific <strong>Foreign Accrual Property Income (FAPI)</strong> rules. The T1135 must be filed by the due date of the taxpayer’s income tax return, even if no income tax is due.\n<h2 id=\"filing-requirements\">Filing Requirements</h2></p>\n<p>Canadian taxpayers have specific obligations under tax law regarding foreign property. It is crucial they are aware of and comply with Form T1135 filing requirements to accurately report foreign investments.\n<h3 id=\"filing-deadlines\">Filing Deadlines</h3></p>\n<p>The <a href=\"/blog/tax-filing-deadlines-in-canada-a-comprehensive-guide\">deadline</a> for filing Form T1135 aligns with the taxpayer's income tax return due date. <strong>Individuals</strong> must file by April 30th following the calendar year of reporting, while <strong>self-employed individuals</strong> have until June 15th. For <strong>corporations</strong>, the form must be filed no later than six months after the end of the corporation's tax year. <strong>Partnerships</strong> must submit Form T1135 by the due date of the partnership's information return.\n<h3 id=\"amended-returns-and-voluntary-disclosures\">Amended Returns and Voluntary Disclosures</h3></p>\n<p>If a taxpayer discovers errors or omissions after submitting Form T1135, they should file an amended return as soon as possible. This action demonstrates compliance and can mitigate potential penalties. The Canada Revenue Agency (CRA) offers a <a href=\"/blog/cra-voluntary-disclosure\"><strong>Voluntary Disclosures Program</strong></a> (VDP) for taxpayers who wish to correct incorrect or incomplete information without penalty or prosecution, provided they meet certain criteria and act before they are audited or investigated by the CRA.\n<h2 id=\"information-to-report\">Information to Report</h2></p>\n<p>This section outlines the specific requirements for reporting foreign income and property details on Form T1135. Complying with these requirements is crucial for taxpayers who meet the filing criteria.\n<h3 id=\"required-financial-details\">Required Financial Details</h3></p>\n<p>Taxpayers must report certain information for each specified foreign property with a cost amount of over $100,000 CAD. The details include:\n<li><strong>Type of property:</strong> Categorize the property according to definitions provided by the CRA.</li>\n<li><strong>Country where the property is located:</strong> Specify the location of the foreign property.</li>\n<li><strong>Maximum cost amount during the year:</strong> Indicate the highest cost amount throughout the year.</li>\n<li><strong>Cost amount at year end:</strong> Report the cost amount of the property at the end of the tax year.</li>\n<li><strong>Income (loss) from the property:</strong> State the total income or loss generated from the property in the tax year.</li>\n<li><strong>Gain (loss) on disposition:</strong> If the property was sold, report the resultant gain or loss.</li></p>\n<h3 id=\"maximum-cost-amount-determination\">Maximum Cost Amount Determination</h3>\n<p>To determine the maximum cost amount:\n1. Record the cost amount of each specified foreign property at various points throughout the year.\n2. <strong>Identify the highest value</strong> which is considered the maximum cost amount.\n3. Record the <strong>maximum cost amount</strong> related to each property separately.</p>\n<h3 id=\"income-from-foreign-property\">Income from Foreign Property</h3>\n<p>For each specified foreign property, taxpayers must also report:\n<li><strong>Total income generated:</strong> Disclose all income (interest, dividends, rents, etc.) earned from foreign property during the applicable tax year.</li>\n<li><strong>Deductible expenses:</strong> List any expenses related to the income earned that are deductible according to the CRA guidelines.</li></p>\n<h2 id=\"penalties-and-consequences\">Penalties and Consequences</h2>\n<p>Canadian taxpayers who fail to comply with Form T1135 reporting requirements face stringent penalties. These penalties are designed to enforce compliance and ensure accurate reporting of specified foreign property.\n<h3 id=\"failure-to-file\">Failure to File</h3></p>\n<p>Taxpayers who do not file the T1135 form by the deadline are subject to a penalty of <strong>$25 per day</strong>. This penalty has a minimum of $100 and can accumulate up to a maximum of $2,500. However, should the non-compliance exceed 24 months, more severe penalties can be imposed.\n<li>For over 24-month infractions, an additional penalty of <strong>5% of the property's cost</strong>, could be levied, potentially increasing the financial consequences significantly.</li></p>\n<h3 id=\"inaccuracies-and-omissions\">Inaccuracies and Omissions</h3>\n<p>The Canada Revenue Agency (CRA) also imposes penalties for inaccuracies or omissions on the T1135 form.\n<li>The penalty for making a false statement or omission is the greater of <strong>$100</strong> or <strong>50% of the understated tax</strong> and/or the overclaimed credits related to the omitted foreign income.</li>\n<li>Continuous non-compliance or negligence is treated severely, with penalties potentially increasing for repeat offenses or gross negligence.</li></p>\n<h2 id=\"supporting-documentation\">Supporting Documentation</h2>\n<p>When filing Form T1135, taxpayers must retain and, if requested, submit adequate records to support their foreign property ownership and associated income. The following subsections detail the requirements for records retention and the submission of supporting documents.\n<h3 id=\"records-retention\">Records Retention</h3></p>\n<p>Taxpayers must keep all records that support what they report on Form T1135 for a period of <strong>six years</strong> from the end of the last tax year to which the records relate. These records should be kept in case the Canada Revenue Agency (CRA) asks to see them.\n<li><strong>Records include</strong>:</li>\n\t+ Bank statements\n\t+ Brokerage statements\n\t+ Statements of real estate holdings</p>\n<p>They should accurately detail the cost, description, and income related to foreign property. Electronic records are acceptable as long as they are accessible and readable by the CRA.\n<h3 id=\"supporting-documents-submission\">Supporting Documents Submission</h3></p>\n<p>Supporting documents should not be submitted with Form T1135 unless specifically requested by the CRA. When requested:\n<li>Provide the documents in the format required by the CRA.</li>\n<li>Ensure documents substantiate:</li>\n\t+ The fair market value of the reported foreign property.\n\t+ The income or loss from the foreign property.\n\t+ Any capital gain or loss realized upon disposition.</p>\n<p>Supporting documents must provide conclusive details regarding <strong>each property</strong> filed on Form T1135 and the relevant transactions within the tax year.\n<h2 id=\"online-reporting\">Online Reporting</h2></p>\n<p>The Canada Revenue Agency (CRA) accommodates online filing for Form T1135, streamlining the process and allowing for quick confirmation of submission. This section examines the electronic methods available to taxpayers for the submission of the Foreign Income Verification Statement.\n<h3 id=\"electronic-signature-authorization\">Electronic Signature Authorization</h3></p>\n<p>The CRA requires taxpayer authorization to apply electronic signatures on Form T1135. Taxpayers or their authorized representatives must, therefore, consent to this procedure. <strong>Key points regarding authorization are</strong>:\n<li><strong>Consent must be explicit</strong>: The taxpayer confirms their understanding and agrees to the use of an electronic signature in their tax filings.</li>\n<li><strong>Record-keeping is essential</strong>: Electronic consent records must be retained by the taxpayer or representative, in case the CRA requests validation.</li></p>\n<h2 id=\"guidance-and-interpretation\">Guidance and Interpretation</h2>\n<p>The understanding of Form T1135 is critical for maintaining compliance with the Canadian tax laws regarding foreign income and assets. The Canada Revenue Agency (CRA) provides specific materials that assist taxpayers in meeting their reporting obligations accurately.\n<h3 id=\"interpretation-bulletin\">Interpretation Bulletin</h3></p>\n<p>The CRA's website is a crucial resource for taxpayers looking to understand the subtleties of Form T1135 reporting. A lot of information is available there to clarify various scenarios and definitions that a taxpayer may encounter. For instance, it explains what constitutes <strong>specified foreign property</strong> and details the thresholds that necessitate the filing of Form T1135. Taxpayers can refer to the website for a comprehensive explanation of terms and requirements. Due to the complexity of the reporting requirements, it is also recommended to taxpayers that they consult with a tax professional to ensure compliance.\n<h3 id=\"revenue-agency-assistance\">Revenue Agency Assistance</h3></p>\n<p>For direct assistance, taxpayers can contact the Canada Revenue Agency. The CRA offers guidance through:\n<li><strong>Informational resources:</strong> Ensuring taxpayers have access to up-to-date instructions on how to report their foreign assets.</li>\n<li><strong>Helpline:</strong> A dedicated phone line provides personalized support for questions related to Form T1135.</li>\n<li><strong>Online tools:</strong> Interactive platforms and downloadable guides that simplify the process of completing the Foreign Income Verification Statement.</li></p>\n<p>Taxpayers are encouraged to use these official channels for accurate information and help with their specific circumstances related to Form T1135.\n<h2 id=\"international-agreements-and-impact\">International Agreements and Impact</h2></p>\n<p>The reporting requirements for Form T1135 are influenced by international tax agreements, which aim to ensure tax compliance through cooperative measures between countries.\n<h3 id=\"information-sharing-agreements\">Information Sharing Agreements</h3></p>\n<p>Information sharing agreements are critical for the enforcement of Form T1135 reporting requirements. Through these agreements, Canada collaborates with other nations to exchange taxpayer information, enhancing compliance and transparency.\n<li><strong>Enhanced Compliance:</strong> Information sharing enables the Canada Revenue Agency (CRA) to cross-verify the accuracy of T1135 submissions.</li>\n<li><strong>Prevent Tax Evasion:</strong> By sharing information, tax authorities aim to detect and prevent offshore tax evasion.</li></p>\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2>\n<p>This section aims to clarify common queries related to the Form T1135, outlining the essentials for taxpayers who hold foreign property.\n<h3 id=\"what-is-the-threshold-for-filing-the-t1135-foreign-income-verification-statement-\">What is the threshold for filing the T1135 Foreign Income Verification Statement?</h3></p>\n<p>Canadian resident individuals, corporations, and certain trusts must file the T1135 if they own specified foreign property with a total cost of more than $100,000 CAD at any point during the year.\n<h3 id=\"are-there-any-exemptions-to-the-t1135-filing-requirement-\">Are there any exemptions to the T1135 filing requirement?</h3></p>\n<p>No exemptions are mentioned for taxpayers who meet the specified criteria; all relevant taxpayers with foreign property above the threshold at any time during the tax year must file Form T1135.\n<h3 id=\"what-penalties-can-be-incurred-for-failing-to-file-form-t1135-on-time-\">What penalties can be incurred for failing to file Form T1135 on time?</h3></p>\n<p>Taxpayers can face penalties for non-compliance. The penalty for failing to file Form T1135 by the due date is $25 per day, with a maximum of $2,500 per tax year.\n<h3 id=\"how-should-foreign-income-and-property-be-reported-for-t1135-purposes-\">How should foreign income and property be reported for T1135 purposes?</h3></p>\n<p>Foreign income and property should be reported by detailing the type of property, the country where it is located, and any income it generates. Accurate, comprehensive records are required for each specified foreign property.\n<h3 id=\"by-what-date-must-corporations-submit-their-t1135-forms-\">By what date must corporations submit their T1135 forms?</h3></p>\n<p>Corporations should complete and file Form T1135 on or before the due date of their income tax return.\n<h3 id=\"in-which-currency-should-foreign-assets-be-reported-on-the-t1135-\">In which currency should foreign assets be reported on the T1135?</h3></p>\n<p>Foreign assets should be reported in Canadian dollars (CAD) on the T1135 form. The exchange rate to be applied must be consistent with the rates used for the taxpayer's income tax return.</p>",
    "toc": [
        {
            "id": "overview-of-t1135-foreign-income-verification-statement",
            "title": "Overview of T1135 Foreign Income Verification Statement"
        },
        {
            "id": "eligibility-criteria",
            "title": "Eligibility Criteria"
        },
        {
            "id": "filing-requirements",
            "title": "Filing Requirements"
        },
        {
            "id": "information-to-report",
            "title": "Information to Report"
        },
        {
            "id": "penalties-and-consequences",
            "title": "Penalties and Consequences"
        },
        {
            "id": "supporting-documentation",
            "title": "Supporting Documentation"
        },
        {
            "id": "online-reporting",
            "title": "Online Reporting"
        },
        {
            "id": "guidance-and-interpretation",
            "title": "Guidance and Interpretation"
        },
        {
            "id": "international-agreements-and-impact",
            "title": "International Agreements and Impact"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "December 3, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax",
        "Personal Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_tax_canada.png"
}