{
    "id": "tax-write-offs-for-small-business-canada",
    "slug": "tax-write-offs-for-small-business-canada",
    "title": "Tax Write Offs for Small Businesses in Canada: Maximizing Your Deductions",
    "excerpt": "Navigating the complexities of small business taxation can significantly affect a company's financial health. Tax write-offs—expenses that the Canada ...",
    "content": "<p>Navigating the complexities of small business taxation can significantly affect a company's financial health. Tax write-offs—expenses that the Canada Revenue Agency (CRA) allows businesses to deduct from their total taxable income—play a crucial role in reducing the overall tax burden for small businesses in Canada. These deductions can range from common operating expenses like rent and utilities to more specific costs such as <a href=\"/blog/self-employed-home-office-tax-deduction-canada\">business use-of-home deductions</a>.</p>\n<p>The eligibility to deduct these expenses depends on their nature and the business's ability to validate that these costs were indeed necessary for earning business income. The categorization of expenses into current or capital expenses and understanding the nuances of what qualifies as a deductible expense are fundamental in maximizing the benefits of tax write-offs. For small businesses, keeping comprehensive records and maintaining a clear understanding of the CRA's guidelines is essential to effectively manage their finances and ensure compliance.\n<h2 id=\"eligibility-criteria-for-tax-write-offs\">Eligibility Criteria for Tax Write-Offs</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38p27-thede.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Understanding which entities qualify for tax write-offs is crucial to leverage Canada's tax regulations to benefit small businesses.\n<h3 id=\"defining-small-business\">Defining Small Business</h3></p>\n<p>In Canada, a small business is typically defined as a privately incorporated company with less than <strong>$10 million</strong> in taxable capital employed in the country. Canadian-controlled private corporations (CCPCs) that meet this criteria can claim the <a href=\"/blog/small-business-tax-rate-canada\">small business deduction</a> (SBD) on the first $500,000 of taxable active business income. The SBD allows for a reduced federal corporate tax rate of 9%. Companies that have between <strong>$10 million and $15 million</strong> in taxable capital can qualify for a partial deduction. Conversely, businesses exceeding the <strong>$15 million</strong> threshold are ineligible for the SBD.\n<h3 id=\"tax-residency-and-business-structure\">Tax Residency and Business Structure</h3></p>\n<p>Tax deductions are available to businesses that are tax residents of Canada. This refers to businesses that are either incorporated in Canada or have established significant residential ties to Canada, such as a principal place of business or central management. Furthermore, the business must be structured as a private corporation, not publicly traded, and not controlled by a combination of non-resident corporations.\n<h2 id=\"understanding-tax-deductible-expenses\">Understanding Tax Deductible Expenses</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38p2l-f2pjn.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, small business owners can reduce their taxable income by claiming a variety of tax deductions. These deductions can lower tax liabilities and in certain instances, may move a business into a lower tax bracket.\n<h3 id=\"types-of-deductible-expenses\">Types of Deductible Expenses</h3></p>\n<p>Small businesses are permitted to subtract many incurred costs from their income, provided they are legitimate business expenses. Common deductible expenses include:\n<li><strong>Office Supplies:</strong> Paper, pens, and other everyday supplies.</li>\n<li><strong>Rent:</strong> For any property used for business purposes.</li>\n<li><strong>Utilities:</strong> Electricity, water, and internet services exclusively for business use.</li>\n<li><strong>Professional Fees:</strong> Payments for legal, accounting, and consulting services.</li></p>\n<p>These categories are not exhaustive, and each has specific criteria that must be met to qualify as a deduction.\n<h3 id=\"home-based-business-deductions\">Home-Based Business Deductions</h3></p>\n<p>For businesses operated from home, additional specific expenses can be deducted:\n<li><strong>Home Office Space:</strong> A percentage of mortgage interest, property taxes, insurance, and maintenance costs relative to the space used for business.</li>\n<li><strong>Utilities and Services:</strong> A proportionate amount of heating, electricity, phone, and internet bills.</li></p>\n<p>The Canada Revenue Agency (CRA) stipulates that the home office must be the principal place of business or used exclusively for business to qualify for deductions.\n<h3 id=\"vehicle-related-deductions\">Vehicle-Related Deductions</h3></p>\n<p>When a vehicle is used for business purposes, expenses can often be deducted, such as:\n<li><strong>Fuel/Gas:</strong> Costs for business travel.</li>\n<li><strong>Maintenance and Repairs:</strong> Routine vehicle upkeep.</li>\n<li><strong>Insurance:</strong> A portion based on business use.</li>\n<li><strong>Lease Payments:</strong> For leased business vehicles, a calculated amount can be claimed.</li></p>\n<p>The business portion of these expenses is deductible, which means careful tracking and documentation of business versus personal use is necessary.\n<h2 id=\"capital-cost-allowance\">Capital Cost Allowance</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38p38-et54o.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>The Capital Cost Allowance (CCA) is a key tax deduction mechanism for small businesses in Canada, allowing them to write off the cost of depreciable assets over time.\n<h3 id=\"depreciation-of-assets\">Depreciation of Assets</h3></p>\n<p>CCA is effectively the tax version of depreciation. Small businesses can't expense the full cost of a depreciable property, such as equipment or buildings, in the year of purchase. Instead, <strong>Canada Revenue Agency (CRA)</strong> permits them to deduct these costs over a period of years at prescribed rates. These properties depreciate due to wear and tear, or obsolescence, and the CCA serves to reflect this gradual loss in value.</p>\n<p>| Property Class | CCA Rate | Example Assets |\n| --- | --- | --- |\n| Class 1 | 4% | Buildings |\n| Class 8 | 20% | Office equipment |\n| Class 10 | 30% | Vehicles |\n| Class 50 | 55% | Computer equipment |</p>\n<h3 id=\"claiming-capital-cost-allowance\">Claiming Capital Cost Allowance</h3>\n<p>To claim the CCA, small business owners will need to fill in the appropriate areas on their income tax return. They should determine the class of each depreciable asset and use the corresponding CCA rate to calculate their claim. It is important to note that they do not have to claim the maximum CCA in any given year. A partial claim or even no claim can be made, which could be beneficial if the business has low income for the year or if saving the claim for a higher income year is more strategic.\n<h2 id=\"employment-and-labour-expenses\">Employment and Labour Expenses</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38p3s-5zeih.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, small businesses can significantly reduce their taxable income by deducting legitimate employment and labour expenses. Accurate record-keeping is essential, as the Canada Revenue Agency requires documentation for these deductions.\n<h3 id=\"employee-salaries-and-wages\">Employee Salaries and Wages</h3></p>\n<p>Employee compensation is one of the primary tax-deductible expenses for a small business. This includes <strong>salaries, wages, bonuses, and other incentives</strong> paid to employees. They must be reasonable and paid for services directly related to the business. To ensure compliance, the business owner must issue <a href=\"/blog/what-is-the-difference-between-t3-t4-t4a-and-t5-slips\">T4</a> slips to employees annually, reporting these earnings.\n<h3 id=\"contractor-and-freelance-payments\">Contractor and Freelance Payments</h3></p>\n<p>Payments made to <strong><a href=\"/blog/employee-vs-contactor\">contractors</a> and freelancers</strong> are also tax-deductible. These can include fees for professional services, such as consulting, marketing, or repair work. The business should issue a T4A slip to each contractor if the service fees exceed $500 for the year. These payments must be for business-related activities to qualify as deductible expenses.\n<h2 id=\"operational-expenses\">Operational Expenses</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38p45-ecye6.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>In managing their finances, small businesses in Canada can leverage various tax deductions. Operational expenses, essential for daily business functions, often qualify for these deductions.\n<h3 id=\"office-supplies-and-equipment\">Office Supplies and Equipment</h3></p>\n<p>Small businesses can write off the cost of office supplies and equipment required for their operations. This includes but is not limited to:\n<li>Paper, pens, and stationery</li>\n<li>Computers and software</li>\n<li>Printers and copiers</li>\n<li>Furniture such as desks and chairs</li>\n<li>Specialized equipment depending on the business type</li></p>\n<p><strong>Eligibility for Deductions</strong>: The Canada Revenue Agency (CRA) mandates that these items must be used directly in the running of the business to qualify.\n<h3 id=\"utilities-and-rent\">Utilities and Rent</h3></p>\n<p>Regular overhead costs such as utilities and rent are also deductible:\n<li>Electricity</li>\n<li>Water</li>\n<li>Heating</li>\n<li>Internet service</li></p>\n<p><strong>Commercial Rent</strong>: Rent paid for property used for business purposes is fully deductible.\n<h3 id=\"insurance-premiums\">Insurance Premiums</h3></p>\n<p>Businesses can deduct premiums paid for various insurance policies:\n<li><strong>Property Insurance</strong>: Covers the location and its contents.</li>\n<li><strong>Liability Insurance</strong>: Protects against legal liability.</li>\n<li><strong>Business Interruption Insurance</strong>: Compensates for lost income during unforeseen closures.</li></p>\n<p><strong>Note</strong>: The CRA allows deductions for insurance costs directly linked to business operation.\n<h2 id=\"professional-and-legal-fees\">Professional and Legal Fees</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38p4w-ldvw9.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, small business owners can reduce their taxable income by deducting fees paid for professional and legal services that relate directly to their business operations.\n<h3 id=\"accountant-fees\">Accountant Fees</h3></p>\n<p>Accountant fees are deductible when they are incurred in the process of managing a business’s finances, including the preparation of an objection or appeal against an income tax assessment. Specific activities might involve:\n<li><strong>Bookkeeping:</strong> Necessary for financial record maintenance.</li>\n<li><strong>Tax Preparation:</strong> Fees for preparing business tax returns.</li>\n<li><strong>Financial Consultation:</strong> Advice on business financial management.</li></p>\n<h3 id=\"legal-consultation-expenses\">Legal Consultation Expenses</h3>\n<p>Legal fees can be deducted when they are associated with obtaining advice or services related to the business's legal matters. These expenses include:\n<li><strong>Contract Reviews:</strong> Legal assistance in drafting or reviewing agreements.</li>\n<li><strong>Litigation Costs:</strong> Expenditures related to business-related legal disputes.</li>\n<li><strong>Regulatory Compliance:</strong> Expenses for advice on following industry regulations.</li></p>\n<h2 id=\"advertising-and-promotion-costs\">Advertising and Promotion Costs</h2>\n<img src=\"https://koala.sh/api/image/v2-38p5d-p5l2h.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, small businesses can deduct a variety of advertising and promotion expenses. These costs must be incurred as part of their attempt to attract customers and generate income.\n<h3 id=\"traditional-advertising-expenses\">Traditional Advertising Expenses</h3></p>\n<li><strong>Canadian Content</strong>: Expenses for advertising on Canadian television, radio stations, and in Canadian newspapers are deductible.</li>\n<li><strong>Finder’s Fees</strong>: Some businesses may also deduct finder's fee expenses.</li>\n<p><strong>Restrictions</strong>: It's important to note that there are limits to the amount you can deduct for certain types of advertising.\n<h3 id=\"online-marketing-costs\">Online Marketing Costs</h3></p>\n<li><strong>Ad Platforms</strong>: Costs for advertising through online platforms, social media, and search engines can be included in tax deductions.</li>\n<li><strong>Website Costs</strong>: Regular expenses for maintaining a business website also qualify, including domain registration and web hosting.</li>\n<p><strong>Evidence</strong>: Businesses must keep records of these online expenses to support their claims.\n<h2 id=\"travel-expenses\">Travel Expenses</h2></p>\n<p>Small businesses in Canada are entitled to deduct travel expenses that are incurred for business purposes. These deductions can significantly reduce their taxable income.\n<h3 id=\"domestic-travel-deductions\">Domestic Travel Deductions</h3></p>\n<li><strong>Public Transportation Fares</strong>: Businesses can deduct costs related to trains, buses, and other modes of public transportation when travelling within Canada for business.</li>\n<li><strong>Hotel Accommodations</strong>: Lodging expenses are deductible when a business owner or employee is travelling for business.</li>\n<li><strong>Meals</strong>: 50% of the meal costs during business travel can be deducted.</li>\n<li><strong>Other Deductible Items</strong>:</li>\n\t+ Internet fees at a hotel\n\t+ Tips given for services related to business travel\n\t+ Cancellation fees for travel arrangements\n<h3 id=\"international-travel-deductions\">International Travel Deductions</h3>\n<li><strong>Transportation</strong>: Flights and other transportation costs to and from destinations outside Canada are deductible when the travel is for business purposes.</li>\n<li><strong>Lodging</strong>: Similar to domestic travel, the cost of hotels and accommodations abroad for business are deductible.</li>\n<li><strong>Meals and Entertainment</strong>: Half of the expenses for meals and entertainment while on international business travel can be claimed.</li>\n<li><strong>Other Expenses</strong>:</li>\n\t+ Foreign exchange fees\n\t+ Travel insurance for business trips\n\t+ Communication expenses (calls, data roaming) directly related to business needs\n<h2 id=\"interest-and-bank-charges\">Interest and Bank Charges</h2>\n<img src=\"https://koala.sh/api/image/v2-38p6k-rtb8g.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Small businesses in Canada may reduce their taxable income through specific deductions relating to interest on loans and banking fees. These categories include both ongoing financial costs and those associated with acquiring capital, which are often overlooked.\n<h3 id=\"loan-interest-deductions\">Loan Interest Deductions</h3></p>\n<p>A small business can deduct interest paid on loans that are specifically used for business operations. This can include, but is not limited to:\n<li><strong>Interest on business loans:</strong> Deductible in the tax year it's incurred.</li>\n<li><strong>Mortgage interest:</strong> When a property is used for business purposes.</li>\n<li><strong>Credit card interest:</strong> For business-related expenses charged on the card.</li></p>\n<p><strong>Note:</strong> Interest on loans for personal use is not deductible.\n<h3 id=\"bank-service-charges\">Bank Service Charges</h3></p>\n<p>Regular bank fees incurred from the day-to-day operations of a business can also be deducted. These may encompass:\n<li>Monthly account fees</li>\n<li>Transaction fees</li>\n<li>Fees for business banking packages</li></p>\n<p><em>It's crucial to keep detailed records to substantiate these deductions during the tax filing process.</em>\n<h2 id=\"research-and-development-credits\">Research and Development Credits</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38p70-zboe8.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>In Canada, small businesses can leverage the Scientific Research and Experimental Development (SR&ED) tax incentives to offset a portion of their research and development costs. These credits can significantly reduce income tax payable.\n<h3 id=\"eligible-r-d-activities\">Eligible R&D Activities</h3></p>\n<p><strong>Scientific Research and Experimental Development (SR&ED)</strong> activities are defined as systematic investigation or search carried out in a field of science or technology by means of experiment or analysis. For an activity to qualify for SR&ED tax incentives, it must meet one of the following criteria:\n<li><strong>Advancement of Scientific Knowledge</strong>: Activities aimed at discovering new facts, or developing a new theory, are often eligible.</li>\n<li><strong>Technological Advancement</strong>: The pursuit to gain new knowledge that may lead to new or improved materials, devices, products or processes.</li>\n<li><strong>Uncertainty and Experimentation</strong>: Resolving technological uncertainties which mundane R&D approaches have failed to address may qualify.</li>\n<li><strong>Systematic Investigation</strong>: The work must be carried out through a systematic investigation by qualified personnel, which includes a hypothesis and testing.</li></p>\n<h3 id=\"claiming-sr-ed-tax-incentives\">Claiming SR&ED Tax Incentives</h3>\n<p>To claim the <strong>SR&ED tax incentives</strong>, businesses must:\n1. Conduct eligible R&D activities within Canada.\n2. Incur qualifying expenditures which may include wages, materials, machinery, equipment costs, and some overheads.</p>\n<p>The process to claim SR&ED tax incentives involves:\n<li>Filing tax forms such as T661 along with the corporation income tax return.</li>\n<li>Supporting documentation is crucial to substantiate the SR&ED claim.</li></p>\n<p>For small businesses, these incentives are particularly valuable as they can be:\n<li>Fully refundable at an enhanced rate of <strong>35%</strong> on expenditures up to <strong>CAD 3 million</strong> for Canadian-controlled Private Corporations (CCPCs).</li>\n<li>Partially refundable or non-refundable for other types of corporations, which nevertheless can provide a substantial benefit against income tax payable.</li></p>\n<h2 id=\"record-keeping-and-compliance\">Record Keeping and Compliance</h2>\n<img src=\"https://koala.sh/api/image/v2-38p81-j9vse.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Accurate record keeping is essential for small businesses in Canada to ensure compliance with the Canada Revenue Agency's regulations. It not only aids in the substantiation of tax write-offs but also serves to maintain organized financial information.\n<h3 id=\"documentation-required\">Documentation Required</h3></p>\n<p>Small business owners should maintain a thorough collection of records that include, but are not limited to:\n<li><strong>Financial Accounts:</strong> Bank statements, credit card statements, and cash register tapes.</li>\n<li><strong>Agreements:</strong> Contracts and leases.</li>\n<li><strong>Receipts:</strong> Purchase invoices, receipts, and expense reports.</li>\n<li><strong>Sales Records:</strong> Sales invoices, cash register receipts, and bank deposit slips.</li>\n<li><strong>Tax Returns and Assessments:</strong> Past tax returns and notices of assessment from the CRA.</li></p>\n<h3 id=\"retention-period-for-tax-records\">Retention Period for Tax Records</h3>\n<p>The CRA mandates that all tax records and supporting documents be retained for a period of <strong>six years</strong> from the end of the last tax year they relate to. Records must be kept in a format that can be audited by the CRA, which includes:\n<li><strong>Paper:</strong> Original hard copies of documents.</li>\n<li><strong>Electronic:</strong> Scanned copies of original documents or records that were created electronically and saved in a format that is acceptable to the CRA, such as PDFs.</li></p>\n<h2 id=\"how-to-file-and-maximizing-deductions\">How to File and Maximizing Deductions</h2>\n<img src=\"https://koala.sh/api/image/v2-38p8n-6gukx.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Small businesses in Canada need to follow a precise process when filing tax returns to effectively claim deductions. By accurately reporting and leveraging legitimate tax deductions, businesses can maintain compliance and optimize their tax benefits.\n<h3 id=\"filing-tax-returns\">Filing Tax Returns</h3></p>\n<p>When a small business files its tax returns, <strong>Form T2125, Statement of Business or Professional Activities (for individuals)</strong>, must be accurately completed. This form is essential for sole proprietorships and partnerships to detail their income and expenses. <strong>Operating expenses</strong> are reported under <strong>Part 4 Net income (loss) before adjustments</strong> and are crucial for determining the business's net profit or loss for the year. For <a href=\"/blog/tax-benefits-and-disadvantages-of-incorporating-in-canada\">corporations</a>, a <strong>T2 Return</strong>should be filed.</p>\n<p>Here's a checklist of documents small businesses should prepare for tax filing:\n<li><strong>Financial Statements:</strong> This includes balance sheets and income statements that show revenue and expenses.</li>\n<li><strong>Receipts and Records:</strong> All receipts for business-related purchases should be organized and readily available.</li>\n<li><strong>Form T2125 or T2 return:</strong> Completed with precise information about business income and expenses.</li></p>\n<h3 id=\"strategies-for-maximizing-deductions\">Strategies for Maximizing Deductions</h3>\n<p>To maximize deductions, businesses should maintain comprehensive records of all expenses incurred to generate income. Small businesses can deduct a variety of expenses, provided they are both reasonable and directly linked to earning business income. Here are some strategies:\n<li><strong>Keep Meticulous Records</strong>: Store all receipts and document the purpose of each expense.</li>\n<li><strong>Understand Allowable Deductions</strong>: Familiarize with what the Canada Revenue Agency (CRA) permits as deductible expenses.</li>\n<li><strong>Claim All Eligible Expenses</strong>: Ensure to claim both common and lesser-known deductions where applicable.</li></p>\n<p>Eligible expenses include, but are not limited to, advertising, utilities, office supplies, professional fees, and insurance. It's vital that these expenses are not personal and are directly related to business operations.</p>\n<p><strong>Note</strong>: Some expenses are capital in nature and must be claimed over time as capital cost allowance (CCA), not as immediate deductions.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<p>Navigating tax deductions can significantly reduce a small business's tax liability in Canada. This section answers common queries regarding what qualifies for deductions and the specifics of claiming such expenses.\n<h3 id=\"what-are-the-qualifications-for-a-small-business-deduction-in-canada-\">What are the qualifications for a small business deduction in Canada?</h3></p>\n<p>The Canadian Revenue Agency (CRA) specifies that to qualify for a small business deduction, a business must be a Canadian-controlled private corporation and have an active business income. The corporation can typically claim a deduction on the first $500,000 of qualifying active business income annually.\n<h3 id=\"what-criteria-allow-small-businesses-to-pay-less-taxes-in-canada-\">What criteria allow small businesses to pay less taxes in Canada?</h3></p>\n<p>Small businesses in Canada can pay less taxes by utilizing the small business deduction, writing off appropriate business expenses that are both necessary and reasonable to earn income, and possibly by splitting income among family members involved in the business.\n<h3 id=\"can-clothing-be-classified-as-a-business-expense-for-tax-purposes-in-canada-\">Can clothing be classified as a business expense for tax purposes in Canada?</h3></p>\n<p>Clothing expenses can only be claimed as a business tax deduction in Canada if they are specific work-related uniforms or protective gear required to perform business duties. Everyday clothing, even if purchased for work, is typically not deductible.\n<h3 id=\"is-it-possible-for-a-sole-proprietor-to-write-off-business-expenses-in-canada-\">Is it possible for a sole proprietor to write off business expenses in Canada?</h3></p>\n<p>Yes, sole proprietors in Canada can write off legitimate business expenses against their business income. This includes costs directly related to the operation and administration of their business, such as office supplies, home office expenses, and travel costs.\n<h3 id=\"can-a-laptop-be-claimed-as-a-business-expense-by-canadian-small-business-owners-\">Can a laptop be claimed as a business expense by Canadian small business owners?</h3></p>\n<p>A laptop can indeed be claimed as a business expense by small business owners in Canada if it is used primarily for business operations. The expense is usually amortized over several years as a capital cost allowance.\n<h3 id=\"are-there-any-deductions-small-business-owners-in-canada-can-claim-without-receipts-\">Are there any deductions small business owners in Canada can claim without receipts?</h3></p>\n<p>While small business owners are generally expected to keep detailed receipts for tax deductions, minor expenses without receipts may still be claimable within the CRA's reasonable limits. However, it is advisable to keep all receipts to substantiate claims and avoid disputes with the CRA.</p>",
    "toc": [
        {
            "id": "eligibility-criteria-for-tax-write-offs",
            "title": "Eligibility Criteria for Tax Write-Offs"
        },
        {
            "id": "understanding-tax-deductible-expenses",
            "title": "Understanding Tax Deductible Expenses"
        },
        {
            "id": "capital-cost-allowance",
            "title": "Capital Cost Allowance"
        },
        {
            "id": "employment-and-labour-expenses",
            "title": "Employment and Labour Expenses"
        },
        {
            "id": "operational-expenses",
            "title": "Operational Expenses"
        },
        {
            "id": "professional-and-legal-fees",
            "title": "Professional and Legal Fees"
        },
        {
            "id": "advertising-and-promotion-costs",
            "title": "Advertising and Promotion Costs"
        },
        {
            "id": "travel-expenses",
            "title": "Travel Expenses"
        },
        {
            "id": "interest-and-bank-charges",
            "title": "Interest and Bank Charges"
        },
        {
            "id": "research-and-development-credits",
            "title": "Research and Development Credits"
        },
        {
            "id": "record-keeping-and-compliance",
            "title": "Record Keeping and Compliance"
        },
        {
            "id": "how-to-file-and-maximizing-deductions",
            "title": "How to File and Maximizing Deductions"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "October 25, 2023",
    "readTime": "5 min read",
    "tags": [
        "Business Management",
        "Corporate Tax"
    ],
    "category": "Business Management",
    "image": "/images/blog-heroes/hero_creator.png"
}