{
    "id": "transferring-personal-assets-from-proprietorship-to-a-corporation-in-canada-section-85-rollover",
    "slug": "transferring-personal-assets-from-proprietorship-to-a-corporation-in-canada-section-85-rollover",
    "title": "Transferring Personal Assets from Proprietorship to a Corporation in Canada: Understanding Section 85 Rollover Requirements",
    "excerpt": "When a business owner in Canada decides to incorporate a proprietorship, they often need to transfer their personal assets to the newly formed corpora...",
    "content": "<p>When a business owner in Canada decides to incorporate a proprietorship, they often need to transfer their personal assets to the newly formed <a href=\"/blog/tax-benefits-and-disadvantages-of-incorporating-in-canada\">corporation</a>. This process involves tax implications that can be mitigated by making use of a provision in the Canadian Income Tax Act known as Section 85 rollover. The mechanism is specifically designed to facilitate the transfer of assets from an individual to a corporation while deferring potential immediate tax consequences.</p>\n<p>The Section 85 rollover allows taxpayers to elect an agreed upon value for the transferred assets, which may differ from the fair market value (FMV). This election is beneficial as it permits the deferral of capital gains taxes that would otherwise arise at the point of transfer. It's a strategic tool aimed at minimizing the tax burden during the restructuring or incorporation process and requires careful adherence to legal guidelines to ensure compliance.</p>\n<p>Understandably, the process requires the completion and submission of form T2057, Election on Disposition of Property by a Taxpayer to a Taxable Canadian Corporation. To benefit from the rollover, both the transferor and the corporation must jointly elect and meet the specific conditions outlined by the Canada Revenue Agency. The due date for filing hinges on the taxpayer's situation, but it's notably time-sensitive to adhere to the CRA's deadlines for these elections.\n<h2 id=\"understanding-section-85-rollover\">Understanding Section 85 Rollover</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/12/DALL·E-2023-12-14-08.42.45-Two-paths-merging-into-one-with-one-path-filled-with-personal-assets-and-the-other-with-corporate-assets-symbolizing-the-integration-process-of-tran.png\" alt=\"\" class=\"img-fluid\" />\n<p>When business owners in Canada transition their operations from a sole proprietorship to a corporation, the Section 85 rollover is a vital tool for deferring taxes on the transfer of assets.\n<h3 id=\"definition-and-purpose\">Definition and Purpose</h3></p>\n<p>The Section 85 rollover is a mechanism in the Canadian Income Tax Act designed for business owners transferring personal assets into a corporation. Its primary purpose is to allow the deferral of taxes, including capital gains that would be triggered if these assets were sold at market value instead of being transferred.\n<h3 id=\"eligibility-criteria\">Eligibility Criteria</h3></p>\n<p>To be eligible for a Section 85 rollover, a business owner must meet specific criteria. The assets being transferred typically include business property such as equipment or intellectual property. Both the transferor (business owner) and the transferee (corporation) must also agree to the elected amount set for the assets, which is crucial for the rollover to apply.\n<h3 id=\"benefits-for-business-owners\">Benefits for Business Owners</h3></p>\n<p>The Section 85 rollover offers several benefits for business owners:\n<li><strong>Tax Deferral</strong>: It permits the deferral of the tax liability that would be incurred on the immediate recognition of capital gains.</li>\n<li><strong>Flexibility</strong>: Owners can select an 'agreed amount' for property transfer, offering greater control over the valuation process.</li>\n<li><strong>Estate Planning</strong>: It can be a strategic part of estate planning by minimizing tax impact on asset transfer.</li></p>\n<p>The Section 85 rollover is a strategic consideration for any business owner contemplating incorporation, as it eases the tax implications and provides financial flexibility.\n<h2 id=\"preparing-for-asset-transfer\">Preparing for Asset Transfer</h2></p>\n<p>Transferring assets from a sole proprietorship to a corporation in Canada using Section 85 rollover involves specific preparations to ensure compliance with tax laws and to optimize the benefits of the transfer.\n<h3 id=\"conducting-a-business-valuation\">Conducting a Business Valuation</h3></p>\n<p>One's initial step should be to accurately value their business. This valuation forms the basis for determining the Fair Market Value (FMV) of assets being transferred. A professional appraiser can provide a detailed valuation report, listing the assets and assigning a value to each based on current market conditions.\n<h3 id=\"identifying-eligible-assets\">Identifying Eligible Assets</h3></p>\n<p>To comply with Section 85, one must identify which assets are eligible for transfer. The assets typically include:\n<li>Tangible assets like equipment and property</li>\n<li>Intangible assets such as intellectual property and goodwill</li></p>\n<p>Each asset must be meticulously listed with its corresponding valuation as established during the business valuation process. This ensures clear documentation and facilitates the legal transfer under the general conveyance.\n<h2 id=\"legal-aspects-of-asset-transfer\">Legal Aspects of Asset Transfer</h2></p>\n<p>When transferring personal assets from a sole proprietorship to a corporation in Canada, the Section 85 rollover is a critical legal mechanism. It encompasses specific procedures and documentation for compliance with the Canadian Income Tax Act.\n<h3 id=\"legal-documentation\">Legal Documentation</h3></p>\n<p>The transfer of assets requires proper legal documentation to ensure that it abides by tax laws and regulations. Documentation typically involves an asset purchase agreement and a general conveyance. An <strong>asset purchase agreement</strong> outlines the terms of the transfer, including the assets being transferred and the consideration being paid. A <strong>general conveyance</strong> is a legal instrument that transfers the title of assets. Legal counsel is key in drafting these documents to precisely reflect the transaction and to prevent future disputes or tax complications.\n<h3 id=\"regulatory-compliance\">Regulatory Compliance</h3></p>\n<p>Regulatory compliance for an asset transfer under a Section 85 rollover involves adhering to the stipulations of the Canadian Income Tax Act. The taxpayer must file an election with the Canada Revenue Agency (CRA) to utilize the Section 85 rollover provisions. This election allows the deferral of capital gains taxes that would otherwise be due on the transfer.\n<li><strong>Deadline</strong>: The election must be filed no later than any of the parties' due date for filing an income tax return during the year in which the transfer occurred.</li>\n<li><strong>Fair Market Value</strong>: Assets should be transferred at their fair market value (FMV), which becomes their opening undepreciated capital cost (UCC) for tax purposes.</li>\n<li><strong>Elected Amount</strong>: The taxpayer can elect an amount, often lower than the FMV, which minimizes immediate tax liability.</li></p>\n<p>Failing to comply with these regulations can result in penalties, reassessments, and additional taxes. Therefore, taxpayers are encouraged to seek guidance from tax professionals when engaging in a Section 85 rollover.\n<h2 id=\"tax-implications\">Tax Implications</h2></p>\n<p>Transferring personal assets to a corporation in Canada using Section 85 rollover can provide significant tax benefits, but requires careful consideration of various tax rules and regulations.\n<h3 id=\"tax-deferral-advantages\">Tax Deferral Advantages</h3></p>\n<p>The <strong>Section 85 rollover</strong> allows for the tax-deferred transfer of personal assets to a corporation. Tax deferral is beneficial as it permits the transferor to defer the recognition of a capital gain until a later time, specifically until the corporation disposes of the assets. This means that instead of paying taxes on capital gains at the time of transfer, taxes are paid when the corporation eventually sells the assets.\n<h3 id=\"shareholder-considerations\">Shareholder Considerations</h3></p>\n<p>For shareholders, structuring the transaction correctly is crucial. They must decide on an elected amount, which could be different from the fair market value (FMV) but must meet certain conditions to be accepted by the Canada Revenue Agency (CRA). The chosen amount affects the future tax liability when the assets are sold and the adjusted cost base of the shares received in exchange for the assets.\n<h3 id=\"reporting-requirements\">Reporting Requirements</h3></p>\n<p>A transfer under Section 85 is not automatically granted and must be elected by filing specific forms with the CRA. The key document to file is <strong>Form T2057</strong>, Election on Disposition of Property by a Taxpayer to a Taxable Canadian Corporation. This form outlines the details of the assets being transferred and the elected amount. It is vital for the transferor to ensure that all documents are properly filed by the prescribed deadline to avoid any potential penalties.\n<h2 id=\"implementing-the-rollover\">Implementing the Rollover</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/12/DALL·E-2023-12-14-08.39.22-A-professional-setting-where-a-business-owner-is-discussing-asset-transfer-with-an-accountant-showcasing-the-advisory-role-in-the-process.-The-scene-.png\" alt=\"\" class=\"img-fluid\" />\n<p>The implementation of a Section 85 rollover involves several crucial steps, each ensuring the proper transfer of assets from a sole proprietorship into a corporation with tax deferral benefits.\n<h3 id=\"drafting-the-rollover-agreement\">Drafting the Rollover Agreement</h3></p>\n<p>The first step involves drafting a rollover agreement, a legal document detailing the assets to be transferred and the shares to be issued. This agreement requires precise information about the assets and must be structured in compliance with the tax laws.\n<li><strong>Details Required:</strong></li>\n\t+ Identification of assets being transferred\n\t+ Fair market value of each asset\n\t+ Number and type of shares to be issued by the corporation</p>\n<h3 id=\"transfer-of-assets\">Transfer of Assets</h3>\n<p>For the rollover to be effective, the assets outlined in the agreement are physically transferred to the corporation. The assets must be meticulously listed, and the transfer must be logged accurately to maintain clear records for tax purposes.\n<li><strong>Process:</strong></li>\n\t+ Record transfer in the corporation's books\n\t+ Update asset ledgers with date and details of the transfer</p>\n<h3 id=\"issuance-of-shares\">Issuance of Shares</h3>\n<p>Upon the successful transfer of assets, the corporation issues shares to the proprietor, now shareholder, in exchange for the assets. The number of shares issued is determined by the rollover agreement and should reflect the fair market value of the transferred assets.\n<li><strong>Share Issuance Protocol:</strong></li>\n\t+ Determine share value based on the fair market value of assets\n\t+ Ensure share issuance is documented and compliant with corporate and tax regulations</p>\n<h2 id=\"post-transfer-consideration\">Post-Transfer Consideration</h2>\n<p>Once the assets from a sole proprietorship are transferred to a corporation through a Section 85 rollover in Canada, attention must be directed toward meticulous record keeping and adjusting business operations to reflect the new corporate structure.\n<h3 id=\"record-keeping\">Record Keeping</h3></p>\n<p><strong>Proper documentation</strong> is crucial after the transfer of assets to a corporation. The corporation needs to maintain records for each asset, stating its fair market value (FMV) and the elected amount at the time of transfer. Such records must include:\n<li>Asset Purchase Agreement</li>\n<li>General Conveyance Documents</li>\n<li>Documentation of Elected Amounts</li>\n<li>Share Certificates (if assets are exchanged for shares)</li></p>\n<p>These documents should be easily accessible and stored safely, as they are essential for future reference, particularly for tax reporting and compliance with Canada Revenue Agency (CRA) requirements.\n<h3 id=\"adjusting-business-operations\">Adjusting Business Operations</h3></p>\n<p>Post-transfer, the corporation must integrate the acquired assets into its operational framework. This includes:\n<li>Updating the Asset Register to include new assets under the corporation’s name.</li>\n<li>Revising insurance policies to cover the transferred assets under the corporate entity.</li>\n<li>Aligning the assets' usage with the corporation’s business activities and objectives.</li></p>\n<p>The corporation should also revisit its business plan and strategy to ensure the newly acquired assets are being utilized efficiently and contributing to the company's growth. It is imperative that these operations are aligned with the legal and tax obligations of the corporation's new structure.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<p>The Section 85 rollover is a crucial procedure for Canadian business owners seeking to move personal assets into their corporations in a tax-efficient manner. This section aims to address common queries regarding the rollover process.\n<h3 id=\"how-can-i-transfer-an-investment-property-to-my-corporation-tax-efficiently-under-section-85-\">How can I transfer an investment property to my corporation tax-efficiently under Section 85?</h3></p>\n<p>One may transfer personal investment property to their corporation without immediate taxable gains by electing to use a Section 85 rollover. This involves entering into a legal agreement with the corporation, following stipulated tax rules to defer potential capital gains.\n<h3 id=\"what-are-the-necessary-steps-for-converting-a-sole-proprietorship-to-a-corporation-using-section-85-rollover-\">What are the necessary steps for converting a sole proprietorship to a corporation using Section 85 rollover?</h3></p>\n<p>The individual needs to execute a transfer agreement that details the assets being transferred, file an election with the Canada Revenue Agency (CRA) by a specific deadline, and ensure proper valuation of the transferred assets is documented for the rollover to take effect.\n<h3 id=\"is-rental-property-eligible-for-the-section-85-rollover-when-incorporating-my-business-\">Is rental property eligible for the Section 85 rollover when incorporating my business?</h3></p>\n<p>Rental property can be transferred to a corporation using the Section 85 rollover, providing a way to incorporate a previously sole proprietorship-held rental business without triggering immediate taxation on appreciated value.\n<h3 id=\"what-accounting-entries-are-required-for-a-section-85-rollover-\">What accounting entries are required for a Section 85 rollover?</h3></p>\n<p>Accounting entries would typically include recording the transferred assets at their agreed-upon amount on the corporation’s balance sheet, and the shareholder's capital account would also reflect the transaction, often as a combination of shares and possibly a note payable.\n<h3 id=\"can-section-85-rollover-be-applied-between-two-corporations-for-asset-transfers-\">Can Section 85 rollover be applied between two corporations for asset transfers?</h3></p>\n<p>Yes, Section 85 rollovers can also be used for asset transfers between two corporations. Similar to personal transfers, this requires a legal agreement and adhering to tax regulations to defer any immediate tax on potential capital gains.\n<h3 id=\"what-are-the-tax-implications-of-transferring-personal-assets-from-a-sole-proprietorship-to-a-corporation-\">What are the tax implications of transferring personal assets from a sole proprietorship to a corporation?</h3></p>\n<p>When transferring assets, the individual may incur tax based on fair market value. However, by employing a Section 85 rollover, taxable gains can be deferred, meaning the corporation takes over the asset's tax basis, while the individual receives commensurate shares, often deferring personal tax until those shares are sold.</p>",
    "toc": [
        {
            "id": "understanding-section-85-rollover",
            "title": "Understanding Section 85 Rollover"
        },
        {
            "id": "preparing-for-asset-transfer",
            "title": "Preparing for Asset Transfer"
        },
        {
            "id": "legal-aspects-of-asset-transfer",
            "title": "Legal Aspects of Asset Transfer"
        },
        {
            "id": "tax-implications",
            "title": "Tax Implications"
        },
        {
            "id": "implementing-the-rollover",
            "title": "Implementing the Rollover"
        },
        {
            "id": "post-transfer-consideration",
            "title": "Post-Transfer Consideration"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "November 19, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_startup.png"
}