{
    "id": "treaty-based-return-for-non-resident-corporations-operating-in-canada-schedule-91-and-97",
    "slug": "treaty-based-return-for-non-resident-corporations-operating-in-canada-schedule-91-and-97",
    "title": "Treaty-Based Return for Non-Resident Corporations Operating in Canada: Schedule 91 and 97 Compliance Guide",
    "excerpt": "Non-resident corporations operating in Canada are subject to specific income tax filing requirements that vary from those of domestic companies. When ...",
    "content": "<p><a href=\"/blog/non-resident-corporation-doing-business-in-canada-canadian-subsidiary-corporation-vs-branch-tax\">Non-resident corporations</a> operating in Canada are subject to specific income tax filing requirements that vary from those of domestic companies. When such a corporation engages in business activities in Canada or disposes of Canadian property, their tax obligations may be influenced by tax treaties between Canada and the corporation's home country. Schedule 91 and Schedule 97 are integral forms associated with the T2 Corporation Income Tax Return that cater to the unique reporting needs of non-resident corporations claiming treaty-based exemptions.</p>\n<p>Schedule 91, \"Information Concerning Claims for Treaty-Based Exemptions,\" is designed for non-resident corporations to declare their entitlement to benefits under a tax treaty. This schedule must be completed if the non-resident corporation carried on a treaty-protected business or had a taxable capital gain in Canada. On the other hand, Schedule 97 provides additional details required from non-resident corporations, ensuring compliance with Canadian tax law. It is crucial for non-resident corporations to accurately complete and file these schedules within six months of their year-end to comply with Canadian tax legislation, claim any tax refunds owed and avoid potential penalties.\n<h2 id=\"overview-of-treaty-based-returns\">Overview of Treaty-Based Returns</h2></p>\n<p>Non-resident corporations conducting business in Canada have specific tax obligations under the country's Income Tax Act. They are required to file a T2 Corporation Income Tax Return, which includes additional schedules pertinent to their treaty-based exemptions.</p>\n<p><strong>Schedule 91</strong> is crucial for any non-resident corporation claiming treaty-based exemptions. This schedule must be completed if a corporation:\n<li>Is conducting treaty-protected business activities in Canada</li>\n<li>Has taxable capital gains or</li>\n<li>Has disposed of taxable Canadian property that falls under treaty protection</li></p>\n<p>Each relevant section within Schedule 91 captures details about the corporation’s treaty-based claims pertaining to its Canadian operations.</p>\n<p><strong>Schedule 97</strong> provides additional information about non-resident corporations. It is required when:\n<li>A non-resident corporation is filing its T2 Corporation Income Tax Return</li>\n<li>Detailed accounting of the corporation's financial activities in Canada is needed</li></p>\n<p>The proper application of treaty-based exemptions can be complex. A corporation must ensure accurate reporting of its Canadian-source income and compliance with payment and filing requirements to avoid penalties.</p>\n<p>Reference to the Canadian-U.S. Tax Convention, an example of such international agreements, clarifies the obligations and entitlements on cross-border taxation issues. It is generally modelled on the OECD guidelines, providing a framework for non-resident corporations to understand their tax treatments relative to bilateral treaties.</p>\n<p>Failure to comply with these filing requirements can result in mandatory penalties, emphasizing the need for rigorous adherence to the stipulated guidelines.\n<h2 id=\"non-resident-corporations-in-canada\">Non-Resident Corporations in Canada</h2></p>\n<p>This section provides specific information on what constitutes a non-resident corporation in Canada, their tax responsibilities, and the requirements for filing relevant tax schedules.\n<h3 id=\"definition-and-criteria\">Definition and Criteria</h3></p>\n<p>Non-resident corporations are entities that are incorporated outside of Canada or whose central management and control is situated outside of Canada. These corporations are either deemed non-resident under a tax treaty or meet common law criteria. The Income Tax Act (ITA) may consider a corporation a resident if it's managed and controlled in Canada; however, tax treaties might override this, deeming it non-resident.\n<h3 id=\"tax-obligations\">Tax Obligations</h3></p>\n<p>Non-resident corporations are subject to Canadian income tax on their income derived from Canadian sources under <a href=\"/blog/regulation-102-105-withholdings-for-payments-to-non-residents-canada\">Regulation 105</a> of the Income Tax Act. Types of taxable income include business income and passive investment income. Canadian taxation may be reduced by applicable tax treaties. Furthermore, non-resident corporations conducting business in Canada may need to withhold Part XIII tax on certain types of income paid or credited to other non-residents.\n<h3 id=\"filing-requirements\">Filing Requirements</h3></p>\n<p>Non-resident corporations operating in Canada must comply with specific filing obligations:\n<li><strong>Schedule 91</strong>: Must be filed by non-resident corporations claiming treaty-based exemptions. This applies to those carrying on a treaty-protected business in Canada.</li>\n<li><strong>Schedule 97</strong>: Should be filed alongside the T2 Corporation Income Tax Return for non-resident corporations with a Canadian filing requirement.</li></p>\n<p>To ensure compliance, it's critical for non-resident corporations to familiarize themselves with both schedules and complete them accurately.\n<h2 id=\"schedule-91\">Schedule 91</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38qeh-m51de.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Schedule 91 is an essential document for non-resident corporations doing business in Canada to claim treaty-based exemptions. This schedule is specifically designed for corporations that have conducted business or have had a taxable capital gain through the disposal of taxable Canadian property that is treaty-protected.\n<h3 id=\"information-gathering\">Information Gathering</h3></p>\n<p>To complete Schedule 91 accurately, a corporation must gather comprehensive details about its Canadian operations. This includes:\n<li>The nature and extent of business activities in Canada.</li>\n<li>Information regarding taxable Canadian property sold or disposed of.</li>\n<li>Relevant dates tying the corporation's activities to the tax year in question.</li></p>\n<p><strong>Documentation</strong> proving the corporation's residency in a country that has a tax treaty with Canada is also necessary.\n<h3 id=\"filing-process\">Filing Process</h3></p>\n<p>A non-resident corporation must file Schedule 91 with their T2 Corporation Income Tax Return. The key steps in the filing process are as follows:\n1. Identify the tax treaty under which the corporation seeks exemption.\n2. Detail the corporation's business activities in Canada to establish if they are treaty-protected.\n3. Submit the completed schedule within <a href=\"/blog/tax-filing-deadlines-in-canada-a-comprehensive-guide\"><strong>six months</strong></a> of the corporation’s year-end.</p>\n<p>Accurate completion of Schedule 91 ensures proper claim of treaty-based exemptions.\n<h3 id=\"compliance-and-penalties\">Compliance and Penalties</h3></p>\n<p>Failure to comply with the filing requirements can lead to penalties. Corporations need to be aware of two critical points for maintaining compliance:\n<li>All filings should be in Canadian currency.</li>\n<li>Late filings or omissions can result in penalties and interest.</li></p>\n<p>It is therefore imperative that corporations file on time and provide accurate and complete information to avoid any punitive measures.\n<h2 id=\"schedule-97\">Schedule 97</h2></p>\n<img src=\"https://koala.sh/api/image/v2-38qf2-smwkl.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Schedule 97 is a crucial document for non-resident corporations in Canada. It details the additional information required for filing a Canadian corporate tax return, specifically targeting those with different international tax obligations and assessments.\n<h3 id=\"eligibility-and-limitations\">Eligibility and Limitations</h3></p>\n<p>Non-resident corporations are eligible to file Schedule 97 if they have conducted business in Canada or have disposals of taxable Canadian property. The schedule applies to those corporations claiming treaty-based exemptions and must be completed when filing the T2 Corporation Income Tax Return. However, corporations must ensure they meet the criteria as treaty-based exempt entities, which hinges on their business activities and the tax treaty between Canada and their country of residence.\n<h3 id=\"calculation-of-income\">Calculation of Income</h3></p>\n<p>Schedule 97 requires non-resident corporations to provide an accurate calculation of the income derived from their Canadian operations. This includes specifying various types of income and deductions applicable under Canadian tax law. Corporations must report this financial information in Canadian dollars, and the proper conversion of foreign currency into Canadian funds is strictly enforced to maintain the integrity of the income reported.\n<h3 id=\"allocations-for-branch-tax\">Allocations for Branch Tax</h3></p>\n<p>The allocation for <a href=\"/blog/non-resident-corporation-doing-business-in-canada-canadian-subsidiary-corporation-vs-branch-tax\">branch tax</a> is an essential part of Schedule 97, reflecting the corporation's tax payable on the Canadian business's income. For non-resident corporations, branch tax functions similarly to corporate tax paid by resident companies. This section of the schedule ensures correct tax payment on income earned in Canada, taking into account the potential benefits from applicable international tax treaties that may reduce the branch tax liability.\n<h2 id=\"canada-s-tax-treaties\">Canada's Tax Treaties</h2></p>\n<p>Canada has established an extensive network of tax treaties with various countries to streamline fiscal obligations for non-resident corporations. These treaties play a crucial role in determining how a non-resident corporation may be taxed and highlight the country's commitment to preventing fiscal evasion.\n<h3 id=\"double-taxation-agreements\">Double Taxation Agreements</h3></p>\n<p>Canada's Double Taxation Agreements (DTAs) are bilateral treaties that aim to prevent individuals and corporations from being taxed by both Canada and their country of residence. <strong>Schedule 91</strong> is a critical document for non-resident corporations to claim treaty-based exemptions. It must be completed and attached to the T2 corporate tax return. Notable points regarding DTAs include:\n<li>They define which taxes are covered and who is a resident and eligible for benefits.</li>\n<li>DTAs often lower the taxes of one treaty country for residents of the other treaty country to minimize double taxation of the same income.</li></p>\n<h3 id=\"information-exchange-agreements\">Information Exchange Agreements</h3>\n<p>Alongside DTAs, Canada has Information Exchange Agreements (IEAs) that facilitate the exchange of tax-related information between two countries. These agreements ensure transparency and aid in tax administration, emphasizing both countries’ efforts to combat tax evasion. Pertinent details around IEAs involve:\n<li>They help enforce domestic tax laws by allowing the exchange of information that would be relevant to the administration and enforcement of the domestic laws concerning taxes covered by the treaties.</li>\n<li>The activation of such mechanisms is outlined in <strong>Schedule 97</strong>, which must also be completed by applicable corporations.</li></p>\n<h2 id=\"compliance-and-enforcement\">Compliance and Enforcement</h2>\n<img src=\"https://koala.sh/api/image/v2-38qgd-ndbvr.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>When dealing with the complexities of treaty-based returns for non-resident corporations operating in Canada, strict compliance with Schedule 91 and Schedule 97 filing requirements is essential. Enforcement mechanisms are in place to ensure adherence to these tax regulations.\n<h3 id=\"assessment-and-reassessment\">Assessment and Reassessment</h3></p>\n<p>The Canada Revenue Agency (CRA) assesses and reassesses the tax returns filed by non-resident corporations to ensure accurate reporting and compliance with the Income Tax Act. Non-resident corporations must provide the required information on Schedule 91 and 97 in a timely manner.\n<h3 id=\"dispute-resolution\">Dispute Resolution</h3></p>\n<p>In instances where a non-resident corporation disagrees with an assessment or reassessment made by the CRA, they have the right to object and seek resolution. The corporation must submit a notice of objection, outlining the reasons for the dispute. The CRA’s Appeals Division will review the case, and if necessary, the matter may be escalated to the Tax Court of Canada.\n<h3 id=\"penalties-and-interests\">Penalties and Interests</h3></p>\n<p>The CRA imposes penalties for non-compliance with tax obligations. These can include:\n<li><strong>Late filing penalties:</strong> If a non-resident corporation fails to file the required schedules on time.</li>\n<li><strong>Accuracy-related penalties:</strong> If reporting on Schedule 91 or 97 contains inaccuracies or omissions.</li>\n<li><strong>Failure to comply penalties:</strong> If a corporation fails to provide information when requested by the CRA.</li></p>\n<p>Interest is also charged on any outstanding tax balances and penalties, compounding daily from the due date of the return until the amount is paid in full.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<p>Non-resident corporations operating in Canada under a tax treaty are required to navigate specific tax obligations. This section provides guidance on fulfilling these obligations through Schedules 91 and 97 and understanding the withholding taxes applicable.\n<h3 id=\"what-obligations-does-a-non-resident-corporation-have-to-fulfill-when-operating-in-canada-under-a-tax-treaty-\">What obligations does a non-resident corporation have to fulfill when operating in Canada under a tax treaty?</h3></p>\n<p>Non-resident corporations must file a T2 return and are obligated to adhere to the Income Tax Act. They must report Canadian-source income and could be required to file Schedule 91 to claim treaty benefits.\n<h3 id=\"how-does-schedule-91-affect-the-taxation-of-non-resident-corporations-in-canada-\">How does Schedule 91 affect the taxation of non-resident corporations in Canada?</h3></p>\n<p>Schedule 91 allows non-resident corporations to claim benefits under a tax treaty. It outlines the criteria to reduce or exempt certain incomes from Canadian tax, based on the treaty’s terms.\n<h3 id=\"what-is-required-for-a-non-resident-corporation-to-claim-treaty-benefits-on-canadian-taxes-\">What is required for a non-resident corporation to claim treaty benefits on Canadian taxes?</h3></p>\n<p>To claim treaty benefits on Canadian taxes, non-resident corporations must complete Schedule 91 and 97, disclosing information about their residency status and the tax treaty that they are invoking to claim a reduction or exemption.\n<h3 id=\"how-does-schedule-97-apply-to-a-non-resident-corporation-s-canadian-branch-profits-\">How does Schedule 97 apply to a non-resident corporation's Canadian branch profits?</h3></p>\n<p>Schedule 97 is required for non-resident corporations with Canadian branches. It provides additional information related to the corporation's operations in Canada, impacting the assessment of taxes on branch profits.\n<h3 id=\"what-types-of-withholding-tax-are-non-resident-corporations-subject-to-in-canada-\">What types of withholding tax are non-resident corporations subject to in Canada?</h3></p>\n<p>Non-resident corporations are subject to withholding tax on certain types of Canadian-source income like rent, royalties, dividends, and management fees. The rates vary and may be reduced under a tax treaty.\n<h3 id=\"how-can-non-resident-corporations-contact-the-cra-regarding-their-tax-obligations-\">How can non-resident corporations contact the CRA regarding their tax obligations?</h3></p>\n<p>Non-resident corporations can contact the Canada Revenue Agency (CRA) through the CRA's Business Enquiries phone line for guidance on tax obligations, including filing requirements and treaty benefits application.</p>",
    "toc": [
        {
            "id": "overview-of-treaty-based-returns",
            "title": "Overview of Treaty-Based Returns"
        },
        {
            "id": "non-resident-corporations-in-canada",
            "title": "Non-Resident Corporations in Canada"
        },
        {
            "id": "schedule-91",
            "title": "Schedule 91"
        },
        {
            "id": "schedule-97",
            "title": "Schedule 97"
        },
        {
            "id": "canada-s-tax-treaties",
            "title": "Canada's Tax Treaties"
        },
        {
            "id": "compliance-and-enforcement",
            "title": "Compliance and Enforcement"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "November 5, 2023",
    "readTime": "5 min read",
    "tags": [
        "Non Residents"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_tax_canada.png"
}