{
    "id": "what-you-need-to-know-about-shareholder-loans-in-canada",
    "slug": "what-you-need-to-know-about-shareholder-loans-in-canada",
    "title": "What You Need to Know About Shareholder Loans in Canada",
    "excerpt": "As a shareholder of a corporation in Canada, you have various options to extract funds from your company. This includes salary, dividends, management ...",
    "content": "<p>As a shareholder of a <a href=\"/blog/tax-benefits-and-disadvantages-of-incorporating-in-canada\">corporation</a> in Canada, you have various options to extract funds from your company. This includes salary, <a href=\"/blog/are-dividends-taxable-in-canada\">dividends</a>, management fees, and shareholder loans. While salary and dividends are the more common methods, a shareholders loan can provide tax planning opportunities in certain circumstances. However, it’s crucial to understand the rules and guidelines set by the <a href=\"https://www.canada.ca/en/revenue-agency.html\">Canada Revenue Agency</a> (CRA). This will ensure compliance and help you avoid any potential income tax issues. In this comprehensive guide, we will explore the concept of shareholder loans, how they work, their income tax implications, and the CRA rules you need to be aware of.</p>\n<h2 id=\"what-is-a-shareholder-loan-\">What is a Shareholder Loan?</h2>\n<p>A shareholder loan, or shareholder advance, refers to an amount borrowed by a shareholder from their corporation. It can be seen as a form of remuneration, similar to <a href=\"/blog/is-it-better-to-pay-yourself-a-salary-or-dividends-in-canada\">salary or dividends</a>, where funds are withdrawn from the corporation for personal use. A corporate loan to shareholder can be made from the shareholder’s own company or a related company. These loans are usually temporary in nature and must be repaid within a specific timeframe to avoid tax consequences.</p>\n<h2 id=\"how-shareholder-loans-are-used\">How Shareholder Loans are Used</h2>\n<p>Shareholder loans can be categorized into two types: “due from shareholder” loans and “due to shareholder” loans.</p>\n<h3 id=\"due-from-shareholder\">Due from Shareholder</h3>\n<p>A “due from shareholder” loan occurs when a shareholder withdraws money from their corporation for personal use, without designating it as <a href=\"/blog/is-it-better-to-pay-yourself-a-salary-or-dividends-in-canada\">salary or dividends</a>. For example, if a shareholder uses corporate funds to purchase a personal item or cover personal expenses, it would be considered a loan from the company to the shareholder. These loans need to be repaid to the corporation within a specific timeframe to avoid income tax implications.</p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL%C2%B7E-2023-11-22-14.51.40-A-portrait-of-an-individual-in-a-business-setting-looking-worried-and-holding-an-invoice.-The-person-is-a-middle-aged-Caucasian-male-with-short-brown.png\" alt=\"\" class=\"img-fluid\" />\n<h3 id=\"due-to-shareholder\">Due to Shareholder</h3>\n<p>On the other hand, a “due to shareholder” loan, or loan from shareholder to corporation, occurs when a shareholder lends money to their corporation. This typically happens when the shareholder contributes personal funds to the company to cover expenses or provide additional capital. The corporation is then obligated to repay the shareholder at a later date.</p>\n<h2 id=\"income-tax-implications-of-shareholder-loans\">Income Tax Implications of Shareholder Loans</h2>\n<p>When it comes to shareholder loans, it’s crucial to understand the tax implications and CRA rules. Failure to comply with the CRA shareholder loans rules may result in both corporate and personal tax consequences. The key income tax implications of shareholder loans include:</p>\n<h3 id=\"repayment-rules-of-shareholder-loans\">Repayment Rules of Shareholder Loans</h3>\n<p>The repayment of shareholder loan rule is a fundamental principle to keep in mind when dealing with shareholder loans. A shareholder loan has to be repaid within one year from the end of the corporation’s fiscal year in which the loan was made. If repaid in that timeframe, it will not be included in the shareholder’s income. However, failing to repay the loan within this timeframe would mean that the unpaid amount will be deemed as other income to the shareholder and subject to personal income tax.</p>\n<h3 id=\"interest-rates\">Interest Rates</h3>\n<p>The Canada Revenue Agency requires that interest on shareholder loans bear the prescribed interest rate as indicated in the Income Tax Act. If no interest or inadequate shareholder loan interest is charged, the CRA may impute interest at the prescribed rate and consider it as a taxable benefit to the shareholder.</p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL%C2%B7E-2023-11-22-14.55.10-An-abstract-representation-of-interest-rates-and-debt-without-specific-currency-symbols.-The-image-features-a-large-stylized-percentage-sign-in-the-c.png\" alt=\"\" class=\"img-fluid\" />\n<h3 id=\"exceptions-and-special-circumstances\">Exceptions and Special Circumstances</h3>\n<p>There are certain exceptions and special circumstances where the shareholder loan repayment rule may not apply or different rules may come into play. For example, loans made in the ordinary course of business or loans used to purchase a principal residence or a motor vehicle for business use may have different repayment requirements or tax treatment. It’s important to consult with a tax professional or refer to the CRA guidelines for specific details regarding these exceptions as loans from shareholders rules can get quite complex.</p>\n<h2 id=\"cra-rules-and-guidelines-for-shareholder-loans\">CRA Rules and Guidelines for Shareholder Loans</h2>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL%C2%B7E-2023-11-22-15.05.48-An-illustration-of-a-tax-collector-in-a-professional-setting.-The-tax-collector-is-a-middle-aged-Hispanic-male-with-short-black-hair-wearing-formal-a.png\" alt=\"\" class=\"img-fluid\" />\n<p>The CRA has established rules and guidelines to ensure that shareholder loans are used appropriately and to prevent tax abuse. It’s essential to be familiar with these rules to comply with CRA requirements. Here are some key rules and guidelines to keep in mind:</p>\n<h3 id=\"documentation-and-record-keeping\">Documentation and Record-Keeping</h3>\n<p>Proper documentation and record-keeping are crucial when it comes to shareholder loans. It’s important to have a written loan agreement or corporate resolution that clearly outlines the terms of the loan, including the repayment period, interest rate, and any other relevant details. This documentation will provide evidence of the loan transaction and help establish the commercial nature of the loan.</p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL%C2%B7E-2023-11-22-14.57.43-An-image-focusing-on-a-large-stack-of-assorted-papers-and-documents-symbolizing-documentation-and-record-keeping.-The-stack-includes-various-types-of.png\" alt=\"\" class=\"img-fluid\" />\n<h3 id=\"arm-s-length-principle\">Arm’s Length Principle</h3>\n<p>The CRA applies the arm’s length principle when assessing shareholder loans. This means that the terms and conditions of the loan should be similar to what would be agreed upon between unrelated parties in a normal business transaction. If the loan terms are not consistent with arm’s length dealings, the CRA may challenge the loan and impute interest or deem it as income to the shareholder.</p>\n<h3 id=\"reasonable-repayment-period\">Reasonable Repayment Period</h3>\n<p>In cases where exceptions apply, the repayment period should be reasonable and reflect the circumstances of the loan. While there is no specific definition of what constitutes a reasonable repayment period, it should align with the purpose of the loan and the ability of the shareholder to repay. The CRA may scrutinize loans with lengthy repayment periods or loans that appear to be disguised income distributions.</p>\n<h3 id=\"interest-calculation-and-payment\">Interest Calculation and Payment</h3>\n<p>If interest is charged on the shareholder loan, it should be calculated based on the prescribed interest rate determined by the CRA. This rate is subject to change quarterly. Interest payments should be made within the prescribed timeframes to avoid any deemed taxable benefits related to unpaid interest.</p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL%C2%B7E-2023-11-22-15.04.40-A-simplistic-image-depicting-a-large-bold-3D-percentage-sign-in-the-center-surrounded-by-unmarked-generic-coins.-These-coins-are-featureless-with-.png\" alt=\"\" class=\"img-fluid\" />\n<h3 id=\"employed-shareholders-and-employee-loans\">Employed Shareholders and Employee Loans</h3>\n<p>Shareholder loans to owners who are also employees of the corporation are subject to additional rules. Loans made to employees in the course of their employment may be treated differently from shareholder loans. It’s important to differentiate between loans made as part of the employment relationship and loans made due to shareholdings.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Shareholder loans can be a useful tool for accessing funds from your <a href=\"/blog/tax-benefits-and-disadvantages-of-incorporating-in-canada\">corporation</a> or providing additional capital. However, it’s crucial to understand the tax implications and rules set by the <a href=\"https://www.canada.ca/en/revenue-agency.html\">CRA</a>. This will ensure compliance and avoid any potential tax issues. Adhering to the repayment rule, charging appropriate interest rates, and maintaining proper documentation is important. This way, you can navigate the complexities of shareholder loans while maximizing tax planning opportunities. If you need personalized advice regarding shareholder loans, it’s always recommended to consult with a qualified tax professional or accountant.</p>",
    "toc": [
        {
            "id": "what-is-a-shareholder-loan-",
            "title": "What is a Shareholder Loan?"
        },
        {
            "id": "how-shareholder-loans-are-used",
            "title": "How Shareholder Loans are Used"
        },
        {
            "id": "income-tax-implications-of-shareholder-loans",
            "title": "Income Tax Implications of Shareholder Loans"
        },
        {
            "id": "cra-rules-and-guidelines-for-shareholder-loans",
            "title": "CRA Rules and Guidelines for Shareholder Loans"
        },
        {
            "id": "conclusion",
            "title": "Conclusion"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "November 6, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_tax_canada.png"
}