{
    "id": "when-and-how-do-i-register-for-gst",
    "slug": "when-and-how-do-i-register-for-gst",
    "title": "When and How Do I Register for GST: A Step-by-Step Guide",
    "excerpt": "Businesses operating within Canada are subject to the Goods and Services Tax/Harmonized Sales Tax (GST/HST), a value-added tax levied by the federal g...",
    "content": "<p>Businesses operating within Canada are subject to the <a href=\"/blog/current-gst-hst-rate-canada-and-by-provinces\">Goods and Services Tax/Harmonized Sales Tax (GST/HST)</a>, a value-added tax levied by the federal government. It is important for business owners to know the specifics of GST/HST registration as it affects pricing, compliance with tax laws, and how the business collects and remits taxes to the government. Not all businesses are required to register for GST/HST; the need to register is contingent upon the type and volume of sales a business conducts.</p>\n<p>Generally, GST/HST registration is mandatory for businesses that provide taxable supplies in Canada and exceed the small supplier threshold of $30,000 in sales over any four consecutive calendar quarters. However, those whose business activities consist solely of selling exempt supplies are not eligible to register. On the other hand, businesses that fall below the threshold may register voluntarily. Voluntary registration can be advantageous as it permits the business to claim input tax credits, hence recovering the GST/HST paid on business expenses.</p>\n<p>The process of GST/HST registration can be initiated through the Business Registration Online (BRO) service after obtaining a business number. This streamlined online process offers the quickest method for businesses to obtain the necessary tax accounts. Establishing a GST/HST account marks an essential step for businesses in properly managing their tax responsibilities and maintaining compliant operations within Canada.\n<h2 id=\"understanding-gst-registration\">Understanding GST Registration</h2></p>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-28-16.00.26-A-middle-aged-white-man-dressed-in-comfortable-home-attire-working-intently-on-his-laptop.-The-laptop-is-placed-on-a-kitchen-table.-The-scene-captur.png\" alt=\"\" class=\"img-fluid\" />\n<p>GST registration is a critical step for businesses to comply with tax laws in Canada and involves specific eligibility criteria, types of registrations, and its significance in conducting business effectively.\n<h3 id=\"eligibility-criteria-for-gst-registration\">Eligibility Criteria for GST Registration</h3></p>\n<p>Businesses must register for the GST/HST if they provide taxable supplies in Canada and are not considered small suppliers. <strong>Small suppliers</strong> are typically businesses with taxable revenues below a certain threshold, which is currently <strong>$30,000</strong> over four consecutive calendar quarters. However, it is important to note that some entities, like public service bodies, have higher thresholds or different criteria.\n<h3 id=\"types-of-gst-registrations\">Types of GST Registrations</h3></p>\n<p>Broadly, GST registrations can be categorized into regular, voluntary, and simplified methods. The <strong>regular method</strong> is the standard process for most businesses. <strong>Voluntary registration</strong> can benefit businesses that make exempt supplies or are below the small supplier threshold but wish to claim input tax credits. The <strong>simplified method (quick method)</strong> is designed to ease the process for small businesses.\n<h3 id=\"significance-of-gst-registration\">Significance of GST Registration</h3></p>\n<p>Registering for GST is more than a legal formality; it legitimizes a business's operations and enables them to collect GST/HST on taxable supplies. It positions businesses to reclaim input tax credits on their purchases and expenses, thus potentially reducing overall tax liability and managing cash flow more effectively.\n<h2 id=\"pre-registration-requirements\">Pre-Registration Requirements</h2></p>\n<p>Before a business can register for the Goods and Services Tax (GST), certain pre-registration requirements must be met. These include gathering necessary documents and determining tax liability.\n<h3 id=\"documents-and-information-needed-for-gst-registration\">Documents and Information Needed for GST Registration</h3></p>\n<p>To register for GST, a business must have in its possession various documents and information. Here is a list of the information that is typically required:\n<li><strong>For all entities</strong></li>\n\t+ Effective date of registration\n\t+ Fiscal year for GST/HST. For individuals this will usually be a calendar year. Meanwhile, a corporation generally uses the same fiscal year for both income tax and GST/HST purposes.\n\t+ Your total taxable sales.\n<li><strong>For individual/sole proprietorship:</strong></li>\n\t+ Social insurance number\n\t+ Date of birth\n\t+ Personal postal code (where you live)\n<li><strong>For companies:</strong></li>\n\t+ Business name\n\t+ Business number (if the corporation has one)\n\t+ The type of business\n\t+ Name and social insurance number of all owners\n\t+ Physical address of the corporation\n\t+ Mailing address of the corporation\n\t+ Description of major business activity (NAICS code)</p>\n<p>Each document must be current, valid, and clear to ensure the registration process is smooth and without delays.\n<h3 id=\"determining-your-tax-liability\">Determining Your Tax Liability</h3></p>\n<p>Determining tax liability is essential to understand if a business is required to register for GST. A business is typically required to register for GST if it:\n<li>Makes <strong>taxable sales, leases, or other supplies in Canada</strong>, and</li>\n<li>Is not considered a <strong>small supplier</strong>; this applies unless the only taxable supplies are real property sold not in the course of a business.</li></p>\n<p>A small supplier is defined based on the total taxable revenue. For example, a business might be considered a small supplier if its total taxable revenues are not more than $30,000 in any four consecutive calendar quarters. The tax liability must be assessed regularly, as surpassing the small supplier threshold necessitates GST registration.\n<h2 id=\"gst-registration-process\">GST Registration Process</h2></p>\n<p>The GST registration process is a critical step for businesses to comply with tax regulations. It involves a systematic approach starting from a step-by-step guide, online registration, to the final verification and approval by the tax authorities.\n<h3 id=\"step-by-step-registration-guide\">Step-by-Step Registration Guide</h3></p>\n<li><strong>Determine Eligibility</strong>: A business must register for GST/HST if it provides taxable supplies in Canada and is not considered a small supplier.</li>\n<li><strong>Acquire a Business Number (BN)</strong>: Before registering for GST/HST, obtain a BN through Business Registration Online (BRO) or by other means provided by the Canada Revenue Agency (CRA).</li>\n<li><strong>Gather Required Information</strong>: This includes your business number and/or SIN, registration date, expected revenue, filing frequency, and fiscal year-end.</li>\n<li><strong>Choose Registration Method</strong>: Decide whether to register online, by mail, fax, or over the phone.</li>\n<h3 id=\"online-registration-on-gst-portal\">Online Registration on GST Portal</h3>\n<li><strong>Access the BRO System</strong>: Navigate to the Canada Revenue Agency's Business Registration Online (BRO) platform.</li>\n<li><strong>Complete the Application</strong>: Fill in the required fields with accurate business and contact information.</li>\n<li><strong>Submit the Form</strong>: After reviewing the details, submit the application to create your GST/HST account.</li>\n<h3 id=\"verification-and-approval-process\">Verification and Approval Process</h3>\n<li><strong>CRA Review</strong>: The CRA will review the submitted application for completeness and accuracy.</li>\n<li><strong>Issuance of GST/HST Number</strong>: Upon approval, the CRA provides a GST/HST number, which serves as the official registration.</li>\n<li><strong>Confirmation Document</strong>: A confirmation of registration document is sent to the business, detailing the effective date of the GST/HST registration and any other necessary information.</li>\n<h2 id=\"after-registration\">After Registration</h2>\n<img src=\"https://ledgerlogic.ca/wp-content/uploads/2023/11/DALL·E-2023-11-28-16.02.08-An-Asian-woman-in-her-thirties-dressed-in-a-professional-outfit-with-a-friendly-and-professional-demeanor-holding-a-portable-payment-machine.-She-i.png\" alt=\"\" class=\"img-fluid\" />\n<p>Once registered for GST, businesses must manage their GST/HST obligations effectively to ensure compliance with tax authorities.\n<h3 id=\"generating-the-gst-identification-number\">Generating the GST Identification Number</h3></p>\n<p>Upon successful registration for GST, the business is assigned a unique GST/HST number. This number is crucial for all business transactions, tax invoices, and compliance.\n<h3 id=\"compliance-and-invoicing-requirements\">Compliance and Invoicing Requirements</h3></p>\n<p>Businesses must ensure that <strong>all tax invoices</strong> include their GST/HST number, and they must charge the <a href=\"/blog/current-gst-hst-rate-canada-and-by-provinces\">appropriate GST/HST rate</a> based on their supplies and location. <strong>Compliance</strong> with <a href=\"/blog/how-do-i-file-a-gsthst-return-in-canada-a-step-by-step-guide\">filing periodic returns</a> is obligatory, detailing the GST collected and the input tax credit.\n<h3 id=\"record-keeping-mandates\">Record-Keeping Mandates</h3></p>\n<p><strong>Record-keeping</strong> is mandatory for all registered businesses. They must maintain detailed accounts of sales and purchases. Record-keeping allows businesses to track their GST/HST liabilities and support claims for input tax credits.\n<h2 id=\"frequently-asked-questions\">Frequently Asked Questions</h2></p>\n<img src=\"https://koala.sh/api/image/v2-34y7d-fafpp.jpg?width=1216&height=832&dream\" alt=\"\" class=\"img-fluid\" />\n<p>Registering for a GST/HST number is an important step for businesses in Canada to comply with tax regulations. This section addresses questions on the registration process, requirements, and filing practices.\n<h3 id=\"what-are-the-steps-to-register-for-a-gst-hst-number-online-\">What are the steps to register for a GST/HST number online?</h3></p>\n<p>To register for a GST/HST number online, businesses should use the Business Registration Online service provided by the Canada Revenue Agency (CRA). They'll need to have a valid Business Number (BN) beforehand, which can be obtained in the same registration process.\n<h3 id=\"do-contractors-need-to-charge-gst-hst-on-their-services-\">Do contractors need to charge GST/HST on their services?</h3></p>\n<p>Contractors in Canada must charge GST/HST on their services if they are registered for GST/HST. Registration is typically required if the revenue exceeds the specified threshold unless all services provided are exempt supplies.\n<h3 id=\"at-what-threshold-of-income-do-i-become-obligated-to-register-for-gst-hst-\">At what threshold of income do I become obligated to register for GST/HST?</h3></p>\n<p>Businesses are obligated to register for GST/HST when their taxable supplies exceed $30,000 in any consecutive 12-month period. Upon reaching this threshold, it becomes mandatory to charge and remit GST/HST.\n<h3 id=\"what-is-the-process-for-registering-a-gst-number-through-the-cra-\">What is the process for registering a GST number through the CRA?</h3></p>\n<p>The process for registering a GST number through the CRA involves completing the registration form through Business Registration Online or by other means such as mail, fax, or telephone. A Business Number will be assigned, which includes the GST/HST account number.\n<h3 id=\"how-frequently-should-i-file-my-gst-hst-returns-\">How frequently should I file my GST/HST returns?</h3></p>\n<p>The <a href=\"/blog/tax-filing-deadlines-in-canada-a-comprehensive-guide\">frequency of GST/HST return</a> filing depends on the business's taxable revenue and can be monthly, quarterly, or annually. The CRA assigns the frequency based on revenue but businesses can request a different filing frequency.\n<h3 id=\"is-it-mandatory-to-collect-gst-hst-if-my-business-earns-less-than-30-000-per-year-\">Is it mandatory to collect GST/HST if my business earns less than $30,000 per year?</h3></p>\n<p>It is not mandatory for businesses that earn less than $30,000 in annual taxable revenue to register for GST/HST. This applies unless they choose to register voluntarily; in which case, they must collect and remit GST/HST.</p>",
    "toc": [
        {
            "id": "understanding-gst-registration",
            "title": "Understanding GST Registration"
        },
        {
            "id": "pre-registration-requirements",
            "title": "Pre-Registration Requirements"
        },
        {
            "id": "gst-registration-process",
            "title": "GST Registration Process"
        },
        {
            "id": "after-registration",
            "title": "After Registration"
        },
        {
            "id": "frequently-asked-questions",
            "title": "Frequently Asked Questions"
        }
    ],
    "author": "Seb Prost, CPA",
    "date": "September 24, 2023",
    "readTime": "5 min read",
    "tags": [
        "Corporate Tax",
        "Cra",
        "Sales Tax"
    ],
    "category": "Tax",
    "image": "/images/blog-heroes/hero_ledgerlogic_gst_registration.png"
}